{"title": "General Assistant", "description": "The General Assistant will report to the Director while being responsible for administrative, sales, translation, and other functions. She will work directly with students of Trường THPT Chuyên Lê Hồng Phong, Trần Đại Nghĩa, and others, as well as graduates of top American colleges and universities, like UChicago, Columbia, Williams, Colby, UCLA, and UC Berkeley.\n\nThe General Assistant must be native Vietnamese and speak and write English at a high level (IELTS > 7.5-9, or equivalent — proficiency will be evaluated at the time of the interview). This is an entry-level position for talented recent graduates.\n\n- Open the office at 9 am sharp each day\n- Set up meetings\n- Sit in client meetings with the director, translate and assist in communication among the director, the parents and the students, and record relevant information at each meeting (training will be provided)\n- Translate documents and interpret as needed\n- Revise and send out contracts under the instructions of senior staff. Assist director in contract negotiation (training will be provided) \n- Keep track of students’ progress and liaise between the counselors/the company and the families\n- Handle calls and inquiries, answer clients and potential clients’ questions, relay issues and challenging questions to relevant staff\n- Fulfill administrative duties such as organizing, filing, keep track of paperwork, ordering supplies when needed \n- During peak application season: help with college application and financial aid paperwork (training provided)\n- Interact with and create a warm, welcoming environment for students\n- Man the reception desk, take calls, and receive clients in a proper and professional manner\n- Handle scheduling for classes, mock tests, meetings and etc.\n- Manage the director and assistant email inboxes, including filing reports and memos that arrive in those inboxes\n- Occasionally deliver essential contracts and other documents\n- Increase the sales, efficiency, and profitability of Bedrock\n- Meet with the Director at the end of each day to review the work done and plan briefly for the next day.\n\nThe General Assistant will work directly with graduates of top American colleges and universities, like UChicago, Columbia, Williams, Colby, UCLA, and UC Berkeley.\n", "requirements": "- High English language proficiency (IELTS > 7.5 - 9, or equivalent)\n- Native Vietnamese language proficiency\n- BA/BS", "required_skills": []}