{"title": "Tech Lead (Java)", "description": "As a Tech Lead, you will oversee the entire development of our health-tech platform consisting of multiple products including a patient app, a doctor app, an internal dashboard, various external integrations with hospitals and much more.\nYou help build and work with the development team to identify the best technologies and solutions to implement as well as oversee the overall development process. Further, you keep an eye out on technical operations to ensure system availability, smooth release processes etc. Your ultimate success is measured by the success of our product\n\nResponsibilities:\n- Oversee the entire development process of the development team\n- Ensure high code quality including ensuring an extendible and scalable code base\n- Get your hands dirty coding - the best way to make sure you have a good sense of the overall codebase is to be active in it so we expect you to be actively contributing code\n- Daily management of engineering team\n- Support with recruitment of new developers through technical interviews etc.\n- Oversee infrastructure setup\n- Identify new technologies that can have a positive impact on the business\n", "requirements": "- Strong experience in production systems written in Java\n- Ideally some frontend experience in either React Native, Swift or similar\n- Basic understanding of dev-ops - you don’t need to be a guru but you have to know how to make sure that your team’s code runs smoothly in production!\n- Ability to build strong and trusted relationships with various internal and external stakeholders from medical, technical and business backgrounds\n- High level of empathy and care\n- 5-7 years of professional working experience in engineering roles, a least 1-2 as lead\n- Degree in Computer Science from a reputable university\n- Have work experience on large systems\n- Have exposure to consumer tech products\n- Have good English (can express idea well in English)\n- Willing to contribute a lot to product and team development", "required_skills": ["trust relationship", "swift", "react native", "java"]}