{"title": "Senior Front End Developer (Strong at AngularJS)", "description": "Integrate the front-end elements into the application.\nYou must be very pro-active and perform assigned tasks independently.\nEnsure the assigned tasks to be performed on-time and with high quality.\nInvestigate and analyze the requirements\nWrite design/technical documents.\nReview design/technical solutions/code.\nSupport creating system architecture.\nWeekly and/or on-demand report to supervisor.\nStrictly follow the project and organization processes, policies and regulations", "requirements": "•\tProficient in Advanced English. (Please asses your English level in IELST or TOEIC in the cover letter if possible)\n•\tMinimum holding a Bachelor's degree or equivalent\n•\tHaving at least 3 years working experience with Javascript\n•\tWilling to learn new technologies is required as you may work with different technologies over the time\n•\tHaving experienced working in international - Agile team and English-speaking skill is crucial\n•\tSelf-management and teamwork-minded\n•\tOnly accepted English version CV & fluent English.\n•\tAt least 2+ years experienced at least one of frameworks: Bootstrap, ReactJS AngularJs, JQuery, NodeJS; VueJS.\n•\tExcellent knowledge in HTML5, CSS3, Object-Oriented JavaScript;\n•\tAt least 1 year experience in one unit test frameworks: Jasmine, Mocha;\n•\tStrong experience with OOP, DI/IoC, SOLID principles, Design pattern;\n•\tPatterns and software development best practices;\n•\tStrong experience with RESTful web service and SSO;\n•\tExperience with responsive design and mobile web;\n•\tExperience with preprocessors such as Less, Sass;", "required_skills": ["mocha", "responsive", "agile", "jasmine", "javascript", "design pattern", "angularjs", "reactjs", "unit test", "css3", "teamwork", "software development", "bootstrap", "jquery", "html5", "le", "management", "oop", "object oriented", "vuejs", "restful"]}