{"title": "Senior iOS software engineer (Remote)", "description": " Lead and mentor the mobile engineering team\n Responsible for working on all layers of our Mobile SDKs with focus on iOS.\n Architect and maintain our set of native mobile applications.\n Building applications in memory- and network-constrained scenarios.\n Integrating with in-house built APIs.\n Solid understanding of UI/UX concepts and principles for mobile devices.\n Partner closely with our design and product team to architect a gorgeous application flow that is seamless and works intuitively for our users.\n Influence every aspect of the SDK development process from API creation, design, to the final product.\n Own important pieces of the product that has high visibility both internally and externally.\n Stay informed on the latest versions of iOS and mentor other developers / Xcode and Objective C APIs and mentor other developers.\n Envision new products and features that are inspired, considered and forward thinking. ", "requirements": "Requirements\n Diploma with relevant experience or Bachelor’s Degree in Computer Science or equivalent\n At least 4 years of relevant experience in all life-cycle of mobile ( iOS ) development in all areas such User Interface, Networking, Data storage and Performance Optimization.\n In depth knowledge and experience with iOS device capability such as various APIs for camera and video steaming. \n Excellent verbal and written communications in English and demonstrated experience in presenting details and resolving differences across a variety of tasks.\n Excellent writing, analytical and organizational skills for documentation and reporting. \n\nCompetencies Or Skills\n Extensive experience developing or have published at least one or more iOS applications.\n Strong foundation in computer science, with strong competencies in data structures, algorithms and software design.\n Fluency with Objective-C and with at least one of more of the following Swift, Java, Kotlin.\n In depth knowledge and experience with various APIs such as Rest and GraphQL\n Knowledge and experience with Computer Vision frameworks such as OpenCV, Tensorflow Lite, Caffe2, etc.", "required_skills": ["rest", "structure", "algorithm", "data structure", "graphql", "user interface", "tensorflow", "performance optimization", "data storage", "written communication", "io", "networking", "swift", "kotlin", "computer vision", "objective c", "java"]}