{"title": "Future Chief Technology Officer (Project Manager, Production Manager, CTO ...)", "description": "Chương trình Tuyển dụng Giám đốc Công nghệ tương lai - FCTO ( Future Chief Technology officer). Chương trình FCTO nhằm tìm kiếm và bồi dưỡng ứng viên đam mê công nghệ, có tố chất lãnh đạo để đảm đương vị trí quản lý cấp cao cho các dự án phần mềm trọng điểm của tổ hợp TOPICA.\n\nTrong thời gian làm việc tại Topica, từ ngay ngày đầu, ứng viên đã có thể lựa chọn tham gia ngay các dự án trọng điểm cấp tổ hợp như dự án Ecosystem xây dựng hệ sinh thái giáo dục trên nền tảng công nghệ mà core value là AI, machine learning - ứng dụng công nghệ 4.0 tiên tiến nhất cùng nhiều platform con để xoáy dữ liệu người dùng.\n\nỨng viên có thể thoả sức chinh phục các dự án tập trung những chuyên gia, quản lý hàng đầu Tổ hợp cũng như lựa chọn core team với nhiều chuyên gia, quản lý IT khủng để đầu quân.\n\nTHÁCH THỨC\n\n- Định hướng roadmap cho sản phẩm để đảm bảo dẫn đầu công nghệ giáo dục trong 10 năm tới ở Đông Nam Á\n- Quản lý đội quân lập trình viên tinh nhuệ đông đảo \"cao thủ\", \"quái nhân\"\n- Xây dựng hệ thống đào tạo có trên 50,000+ CCU, chạy 24h/7 với người dùng tại 40+ nước\n- Phát triển hệ sinh thái giáo dục trực tuyến đầu tiên trên thế giới. Phục vụ lên đến 10M+ học viên Elearning\n- Định hướng công nghệ sản phẩm, quy trình theo hướng Global Platform", "requirements": "- Từ 28 - 40 tuổi, có từ 3 năm kinh nghiệm Quản lý  IT ( Project Manager, Production Manager, CTO...)\n- Có đam mê công nghệ thông tin, định hướng dự án và nâng tầm Process\n- Tư duy tốt, kỹ năng đa chiều. Dám thay đổi, không ngại thách thức\n", "required_skills": []}