{"title": "Wholesales Manager", "description": "Acquire and manage merchants: 60%\n•\tMaintain relationship with available merchants to push sales\n•\tSet plan to acquire new merchants\n•\tMaximizing customer service to satisfy customer’s problem\nWholesales Business Development: 30%\n•\tCoordinates business development and project management initiatives\n•\tEffectively develops sales, marketing and revenue plans\n•\tDrives incremental revenue\n•\tDevelops & executes a coherent business strategy\n•\tRecommends short – and long – range business development objectives\n•\tSuccessfully assesses trends, problems, and revenue opportunities\n•\tSkillfully articulates the value of our products & service to customers\n•\tResponds to question in real time\n•\tAggressively implements marketing strategies\n•\tForecasts & develops annual sales quotas\n•\tConsistently projects expected sales volume & profitability\n•\tDevelops strategies and tactics for new business generation\nLeadership: 10%\t\n•\tLead, coach and train for employees\n•\tMake sure the team work effectively and have good performance \n", "requirements": "•\tIt is very essential to have good leadership skills to be a wholesale manager.\n•\tThey should have completed knowledge about the products stocked by the wholesaler.\n•\tThe managers who deal with the client should have good negotiating skill.\n•\tIt is also important to have training skills, in case training is required to be given.\n•\tThe wholesale manager should have good motivation skills.\n•\tWholesale experience \n•\tExcellent communication skills \n•\tMust have a Fashion/Luxury Goods retail background \n•\tAbility to communicate in local languages & English\n•\tEducation and Qualifications:\n•\tIn order to be a wholesale manager, an individual must possess a management degree. Any specialized course or degree in management will also prove to be beneficial.\n", "required_skills": ["communication skill", "leadership skill", "management"]}