{"title": "Marketing Manager", "description": "- Cùng CEO xây dựng & quản lý team marketing từ đầu\n– Tổ chức thực hiện theo các chương trình kế hoạch\nmarketing, kế hoạch quảng cáo online - offline, chương trình khuyến mãi. Theo dõi việc thực hiện và báo cáo kết quả.\n– Thực hiện các chiến dịch thông tin và quảng cáo.\n– Cập nhật kiến thức ngành nghề bằng cách tham dự các buổi hội thảo đào tạo; xem các ấn phẩm chuyên ngành; thiết lập mạng lưới quan hệ cá nhân, gia nhập vào tổ chức chuyên nghiệp của ngành\nnghề.\n– Đạt được các mục tiêu kinh doanh và Marketing bằng cách\nđóng góp các thông tin và các đề xuất về hoạt động kinh doanh và Marketing cho các tổng kết và kế hoạch chiến lược.\n– Duy trì mối quan hệ với các khách hàng lớn bằng cách\nthường xuyên có cuộc thăm viếng khách hàng; khám phá các nhu\ncầu đặc thù, dự đoán các cơ hội mới.\n- Quản lý 5-10 người của team Marketing.", "requirements": "Ưu tiên người trẻ dưới 30 tuổi, có kiến thức digital marketing. Không yêu cầu quá nhiều kinh nghiệm nhưng cần thái độ, tháo vát và có khả năng triển khai tốt.\n\n- Tốt nghiệp Đại học các ngành có liên quan Sales, Marketing.\n- Am hiểu và đam mê về giày là 1 lợi thế rất lớn\n– Kinh nghiệm 2 năm marketing, ít nhất 1 năm ở vị trí tương\nđương. Đã từng làm trong môi trường bán lẻ là 1 lợi thế.\n- Yêu cầu ứng viên phải có kỹ năng Digital Marketing tốt, có thể tự chạy các chiến dịch digital trong thời gian đầu.\n- Có khả năng phân tích thị trường, nhạy bén với sự thay đổi\ncủa thị trường\n– Tiếng Anh giao tiếp lưu loát.\n– Thông thạo vi tính Văn phòng, đặc biệt Excel và PowerPoint.\n– Đề cao ý Tưởng Marketing, Định Vị thương hiệu.\n– Khả năng Lập Kế Hoạch Kinh Doanh, Phân Tích Cạnh\nTranh.", "required_skills": ["excel", "can", "market analysis", "digital marketing", "analysis", "marketing", "business analysis", "sales", "brand positioning"]}