{"title": "Master code (Senior Developer Java, PHP, .NET, Python, Ruby, NodeJS,...)", "description": "Master Code là chương trình tuyển dụng chuyên gia IT cao cấp của Tổ hợp Công nghệ Giáo dục Topica nhằm tìm kiếm các tài năng trẻ, có bản lĩnh, đảm đương được các vị trí software architect hoặc CTO trong tương lai và cùng Topica thực hiện sứ mệnh chiếm lĩnh thị trường công nghệ giáo dục trực tuyến tại Đông Nam Á.\n\nTrong thời gian làm việc tại Topica, từ ngay ngày đầu, ứng viên đã có thể lựa chọn tham gia ngay các dự án trọng điểm cấp tổ hợp như dự án Ecosystem xây dựng hệ sinh thái giáo dục trên nền tảng công nghệ mà core value là AI, machine learning - ứng dụng công nghệ 4.0 tiên tiến nhất cùng nhiều platform con để xoáy dữ liệu người dùng.\n\nỨng viên có thể thoả sức chinh phục các dự án tập trung những chuyên gia, quản lý hàng đầu Tổ hợp cũng như lựa chọn core team với nhiều chuyên gia, quản lý IT khủng để đầu quân.\n\nSẴN SÀNG TRẢI NGHIỆM NHỮNG THÁCH THỨC: \n- Tham gia phát triển hệ thống phần mềm lớn, trọng điểm cùng các software architect của tổ hợp.\n- Phát triển sản phẩm/module mới hoạt động ổn định \n- Chịu trách nhiệm về chất lượng sản phẩm và chất lượng code.\n- Tuân thủ quy trình phát triển sản phẩm theo mô hình Agile, Scrum\n- Đào tạo, hướng dẫn hoặc là techleader các thành viên khác trong team\n", "requirements": "- Độ tuổi từ 25-32 tuổi.\n- Thành thạo ít nhất 1 ngôn ngữ lập trình backend như Java, PHP, .NET, Python, Ruby, NodeJS,...\n- Có hiểu biết về 1 trong các hệ quản trị CSDL như MySQL, SQLserver, MongoDB...\n- Có kinh nghiệm với Javascript (Angular 2, TypeScript, jQuery), HTML và REST API-s là một lợi thế\n- Tư duy logic tốt\n- Từ 3 năm kinh nghiệm trở lên\n", "required_skills": ["php", "rest", "python", "typescript", "angular 2", "backend development", "mysql", "angular", "mongodb", "javascript", "jquery", "html", "ruby", "java"]}