{"title": "Senior Backend Developer (Golang)", "description": "We are looking for experienced backend engineers to join our team of talented engineers that share a common interest in distributed backend systems, their scalability and continued development. You will build the backend systems that power our application, scale highly distributed systems, and continuously improve our engineering practices. Our mission in our ad tech team is to build a modern marketing platform applying latest technologies such as big-data, cloud computing, ML…\nYou will be a key participant in answering some (or just few) of the following questions:\n\n    • Technologies: Which database technologies will be best for user profiling (i.e. Cassandra, PostgreSQL)\n    • Cluster modelling: How to break down the requests that come from publishers & group them into clusters (i.e. Female Clusters, High CTR Clusters, etc.).\n    • Campaign Matching: How to match users from specific clusters with the best campaigns.\n    • Optimisation algorithms: Which ones to use considering the needs the system will have in terms of accuracy & speed (i.e. Heuristic, Linear, Non-Linear Programs).\n    • Forecasting system: Best techniques to avoid campaign mis-deliveries.\n    • Programming language: Which ones are better when looking at highly concurrent systems (i.e. Scala, Clojure, Go).\n    • User profiling: Optimal cookie synching methods.\n    • Systems Architecture: How to best turn a complex monolithic application into microservices to solve scalability and growth challenges.\n\nYour roles :\n\n    • You have experience leading large projects across several teams\n    • Design, build, code and own our marketing platform product for speeding up marketing.\n    • Collaborate with engineers, product managers, designers and data engineer, scientists to evolve these services to provide new features as well as meet our ever-growing scale.\n    • Do fun tasks like reviewing code, writing design docs and closing JIRA tickets.", "requirements": "    • At least 1-year experience with Golang and solid software development mindset \n    • Hunger for learning, passion for building impactful products.\n    • Self-motivated, independent, committed.\n    • Have experience in scalable system and hight load.\n", "required_skills": ["software development", "golang"]}