{"title": "Senior Back-end Developer (PHP, Nodejs, Java)", "description": "We are looking for Talented Senior Back-end Developer to join our growing Tech team and build biggest & smartest influencer platform for Southeast Asia. \n\nIts scalable data-driven platform includes an influencer marketplace, management tools and real-time communication systems to help brands optimize the effectiveness of cross-country marketing campaigns.\n\nTalents that we looking for must have strong, firsthand technical expertise in a variety of configuration management, back-end technologies and the proven ability to fashion robust scalable solutions. They must be at ease working in an agile environment with little supervision. Talents should embody a passion for continuous improvement and test-driven development.\n\nRESPONSIBILITY\n\n•\tWork with other teams – product, sales, operation – to determine needs for platform\n•\tDesign optimal, scalable architecture and database based on Hiip’s software stacks: Laravel, Node.js, MySQL, MongoDB, AWS and new others cool technologies\n•\tImplement services follow modular programming and clean code principles\n•\tWork with others member of Product & Tech team to develop solutions that optimize product development process with Scrum\n\n", "requirements": "•\tOutstanding knowledge of data structures, algorithm, software design and architecture\n•\tAt least 3 years of experience coding in one or more languages PHP-Laravel / Node.js / Java and developing Rest API\n•\tExperience with architectural patterns for high availability, performance, scale-out architecture knowledge of cloud-based architectures. Deployment and operational aspects of Amazon Web Services cloud is a plus.\n•\tStrong knowledge of databases (SQL, NoSQL), and the ability to make choices among available technology based on requirements.\n•\tExperience with product development. Knowledge of Scrum is a plus.\n•\tExcellent technical problem-solving skills, critical thinker, aptitude to learn new technologies and methodologies quickly\n•\tLow tolerance for inefficiency and the burning desire to automate anything that can be automated\n•\tWant to step out of comfort zones, work on super-hard problems to learn new things and eager to get things done\n•\tExcellent interpersonal communication skills\n•\tBorn 9X\n•\tWorked in a product company because the company wants to find you with product thinking, product development\n", "required_skills": ["php", "structure", "algorithm", "data structure", "rest", "laravel", "cloud service", "sql", "cloud", "problem solving", "communication skill", "nosql", "high availability", "java", "database", "sql database", "problem solving skill"]}