{"title": "Back-end Lead (Ruby or NodeJS) ", "description": "As a Tech Lead for HighFi, you are responsible for the development of the platform to fulfill business and companies/users requirement. You have to decide and pick the right technologies to implement and then lead the development team with both good process and vision.\n\n•\tDesign the systems with careful technologies decision\n•\tTranslate from business requirement to technical requirement efficiently and clearly to bridge the gap for the development team to deliver business value.\n•\tOversee the development process and technical implementation\n•\tQuality control of new release and gradually automate all the testing\n•\tLead and grow the development team on both quality and size.\n•\tProvide estimations and coordinate with Product Managers to deliver the Product Roadmap and Timeline. \n•\tWorking closely with Customer Success and Merchant Operation team to understand users’ feedbacks, business requirement and most importantly how to build the product users love.", "requirements": "•\tAbility to write / review a clean / scalable codebase.\n•\tExperience in designing scalable system, from simple to complex\n•\tGood estimation skills\n•\tAn experienced team leader with good ability to define the project's vision and keep the team follow that vision\n•\tHaving the idea of various software development processes (agile, waterfall)\n•\tExperience in full software development life cycle, from the beginning (setup project, estimation, choosing tech stack…) to set up infrastructure, rolling out, production debugging and monitoring.\n•\tPositive can-do attitude with infectiously high energy levels\n•\tPrior to startup exposure strongly preferable\n•\tStrong communication skills in Vietnamese and preferably English\n•\tStrong team player with the ability to form effective working relationships with a large variety of stakeholders", "required_skills": ["project estimation", "process development", "agile", "stack", "communication skill", "software development"]}