{"title": "Operations Manager", "description": "- Build & manage an operations team responsible for growing a product line\n- Develop & Optimize Processes. Scale new and existing processes to allow the business to\nefficiently operate and grow\n- Analytics. Heavy analysis of agent and user metrics to properly allocate supply, guide agent\nincentive programs, and ensure high-quality experiences on the VRED system\n- Strategy. Decide which projects the team should focus on and set an aggressive timeline to\nreach those goals\n- Product Improvement. Proactively search for new features which could improve a seamless\nagent and user experience\n- Partner Relations. Manage agent development, identify & attack problem areas for agents, and\nnegotiate with businesses for agent perks\n- Expansion Planning / Recruiting. Evaluate the economic and strategic costs and benefits of agent\nincentive programs and work with management to execute those strategies\n- Agent Support. Manage the day-to-day issues of thousands of agents on our system\n- Hustle. Take ownership of VRED's growth and do whatever it takes to get the job done\n- Mobilize & Grow. Take on new opportunities like launching a new market, spinning off a new\nproduct line, experimenting with new business models", "requirements": "- Recruit men only (under 30 years old)\n- Operations experience in the payment sector (Such as Momo)\n- 2+ years of experience building & managing a team\n- Can communicate in English, good reading skills\n- Extremely detail-oriented\n- Strategy and data-driven decision-making mentality and sound business judgment through strong analytical thinking\n- Solid understanding of a variety of business models\n- Ability to take initiative in a constantly changing work environment\n- Startup (all-hands-on-deck) \"I bust my ass because I love it\" approach\n- A willingness to be “in the trenches” working with our agents-partners\n- Bachelor's degree in business, economics, finance or similar field\n- Stellar Excel skills\n- Willingness to travel to rural areas\n\nEXAMPLE BACKGROUNDS:\n- Consulting background with strategic and analytics decision instincts (i.e. McKinsey, BCG, Deloitte, PwC, KPMG)\n- Operations experience in the following sectors: on-demand transportation & delivery, large scale platform (Grab, DeliverNow, Shopee, Lazada, VNG, GHTK, GHN)\n- Corporate strategy background with a willingness to roll up your sleeves", "required_skills": ["excel", "analytics", "analytical thinking", "stellar", "finance", "making decision", "payment"]}