{"title": "Marketing Team Lead", "description": "●\tProactively identify and develop longer-term marketing and communications strategies and initiatives that will result in increased visibility and profitable growth.\n●\tBuild, execute and maintain a scalable demand generation model to drive sales growth.\n●\tArticulate compelling value propositions and drive adoption for Uiza offerings in various market segments and geographical areas.\n●\tDrive strategy and execution for demand generation and brand awareness campaigns across all digital and offline channels.\n●\tDesign and implement high-impact programs that are optimized to deliver results across the marketing and sales funnel, while hitting target metrics, Objectives and Key Results (OKR’s) and marketing ROI.\n●\tManage our marketing budget and forecast.\n●\tManage content development and position Uiza as the universal Streaming OS through thought leadership, white papers, infographics, blog posts, social media, webinars and by being an evangelist for our software and company.\n●\tContribute to the creation of a comprehensive global marketing plan, digital marketing (web, SEO/SEM), social media-focused marketing, analyst relations, demand generation, events, and branding.", "requirements": "●\tKnowledge on how to guide a brand's reputation and expand demand generation.\n●\tExperience in building, executing and measuring data-driven marketing programs across online and traditional channels.\n●\tTechnical background or clear understanding of developer products.\n●\tExperience in data-driven marketing strategy, planning, budget allocation and organizational alignment.\n●\tExperience in the use of analytics tools and ROI metrics.\n●\tExcellent strategic and analytical skills combined with the creativity to produce innovative breakthrough value propositions and businesses for the company.\n●\tAbility to handle a fast-paced environment and challenging workload.\n●\tExceptional written, verbal, and in person presentation skills.\n●\tDemonstrate high levels of integrity, initiative, honesty and leadership.", "required_skills": ["marketing strategy", "analytics", "marketing", "roi", "value proposition"]}