{"title": "Mobile Lead", "description": "•\tBe part of the growing development team to build a B2B SaaS solution for HR.\n•\tOversee the development process and technical implementation to build mobile application (android, ios) using React Native.\n•\tEnsure UI/UX of developed pages with near pixel-perfect design\n•\tDesign the systems with careful technologies decision\n•\tQuality control of new release and gradually automate all the testing\n•\tLead and grow the development team on both quality and size.\n•\tProvide estimations and coordinate with Product Managers to deliver the Product Roadmap and Timeline. \n•\tWorking closely with Customer Success and Merchant Operation team to understand users’ feedbacks, business requirement and most importantly how to build the product users love.", "requirements": "•\tAt least 3 years experience with mobile application with native (Android or iOS) with at least 1-year experience with React Native\n•\tExperience with a live app with high DAU/MAU\n•\tKnowledge about Animation in React Native.\n•\tExperience with scene navigation, redux and others.\n•\tExperience with building an app to play store, app store, and app version control.\n•\tExperience with caching, memory management, concurrency (thread, queue), Restful API, Push notification\n•\tGood understanding of data structures, algorithms, and design patterns.\n•\tGood command of source code management such as Git/SVN\n•\tAn experienced team leader with good ability to define the project's vision and keep the team follow that vision\n•\tHaving the idea of various software development processes (agile, waterfall)\n•\tExperience in full software development life cycle, from the beginning (setup project, estimation, choosing tech stack…) to set up infrastructure, rolling out, production debugging and monitoring.\n•\tPositive can-do attitude with infectiously high energy levels\n•\tStrong communication skills in Vietnamese and preferably English\n•\tStrong team player with the ability to form effective working relationships with a large variety of stakeholders", "required_skills": ["algorithm", "agile", "stack", "git", "memory management", "design pattern", "svn", "react native", "data structure", "project estimation", "io", "software development", "navigation", "structure", "concurrency", "management", "process development", "communication skill", "redux", "restful", "android"]}