{"title": "SENIOR QA CONSULTANT", "description": "This is Product Evangelist (Katalon Studio - Automation Testing). We are the creator of Katalon Studio - one of the best automation testing tool reported by Gartner. We've acquired hundreds of thousands globally within 2 years after launch and being rated as a loveable tool by the tester community. \n\nKatalon team is looking for a member with the excellent automated testing skill and possess the passion to share the knowledge as our Product evangelist. \n\nJob summary\n\n- Play SME role providing feedback to the product development team, join UAT process for new features.  \n- Work with marketing team to demonstrate product highlights, best practices and automation testing tutorials. \n- Host Katalon webinars and participate in International testing conferences introducing the products and demonstrate its capabilities. \n- Support the Sales team to address clients'  inquiries about Katalon Studio. \n", "requirements": "- Possess a broad experience with different automation testing tools and methodologies. \n- Capable to define a test automation framework and CI/CD process. \n- Up-to-date with the latest testing trends, industry's influencers and new automated testing solutions.\n- Excellent English communication, you will be Katalon Studio representative at International events. \n\nAdditional information.\n- Work with one of the Best Employers in Vietnam. \n- Be part of a young, talented and success Product development team.\n- Opportunity to learn and create innovative Automated testing solution from Vietnam for the international market. \n- Experience the whole lifecycle of a software product from engineering to marketing and sales. \n- Opportunity to speak at international testing conferences and collaborate with domain thought leadership. ", "required_skills": ["sales and marketing", "katalon", "testing", "marketing", "lifecycle", "automation", "sales", "studio", "automation testing tool", "automation testing", "automation test"]}