{"title": "Junior .Net developer", "description": "Reporting to the Product Owner, you will be the key person for the development of the solution. Your expertise will be at the service of the team to ensure the best choice in technology. You will ensure that the development environment has the best resources and provides the best guarantees for the success of the project. You will be responsible for the quality of the development and its compliance with the specifications and architecture decided by the project team. \n\nAs a junior/middle developer, your main duties depend on the project phase and will fall broadly into the following categories: \n\n• Work with Product Owner and development team to provide optimal IT solutions for business problems. \n• Participate in our entire product lifecycle, implement server-side logic and data structure following Technical Design document. \n• Perform designing, implementing, writing unit test. \n• Write clean code to build reusable code and libraries for future use \n• Troubleshoot and debug applications \n• Responsible for development, enhancement and maintenance of the application. As a contributor, you will: \n• Consult and listen to internal staff for feedback, understand requirements and develop appropriate solutions \n• Remove all technological obstacles from business operations \n• Conduct respectful and friendly communication with other contributors", "requirements": "Must have :\n- 1 – 3 years of experience in developing integrated business systems\n- Working knowledge of hardware, software and programming as well as analytical skills, including:\no Experience or strong at OOP, on-hands experience of best practices\no Highly experienced with at least one backend programming language (.Net is preferred).\no Can work on both back end and front end\no Experience with developing websites to run on multiple devices\no Experience in developing web application / web api\no Experience with MVC, ORM\n\nBased on experience:\n- Experience at design patterns and SOLID principles (based on candidate’s exp)\n- Experience in database: designing, optimizing\n- Experience in implementing microservices\n\nCommon :\n- A logical approach to problem-solving together with a methodical, investigative and inquisitive mind\n- Self-starter and fast learning, good teamwork and reliable\n- Appetite for startup environment (130 employees disseminated in Asia and Africa, 5 to 20 teammates per country): autonomous, proactive, can-do mindset, capacity to work with teams across different offices and from different cultures\n- Ability to communicate in English", "required_skills": ["design pattern", "teamwork", "oop", "backend development", "microservices", "problem solving", "database", "mvc", "orm"]}