{"title": "Marketing Manager", "description": "General Management, Strategic Planning and Cost Management (50%)\n•\tPartnering with the Brand Managers\n•\tProvide constant leadership in managing internal and external brand team and projects day-to-day under the supervision and direction of line manager\n•\tProvide reports as assigned by line manager/brand\n•\tManage marketing schedule on a weekly basis\n•\tStrategic marketing planning & presentation, and implementation of all marketing activities\n•\tIn-depth familiarization of brand guidelines and company policies\n•\tConstantly find new ways/channels to promote/market and effectively reach out the target market\n•\tManage the cost within the budget approved by line managers, cost-efficiency is reinforced at all times but without sacrificing quality of output\n•\tEnsure accuracy, completeness, and timeliness of report based on ACFC standard template sent internally or externally, including Marketing Plans, Calendar, Budget, Weekly report, Value proposition, Post mortem report and other pertinent reports as requested by line manager/principal\n\nBrand Activation (30%)\n•\tCreate/execute all programs to achieve channel KPIs (sales volume, market share, OD share, market coverage)\n•\tReview market developments and customer needs on regular basis\n•\tWork closely with Marketing team and related departments to develop an effective trade promotion strategy and its activities based on market situation\n•\tEnsure team members understand and align on the strategy and key objectives\n•\tMonitor the effectiveness of each trade investment and ensure maximum returns\n•\tEvaluate all campaigns for further improvement\n•\tHandle other tasks assigned by manager\n\nMedia Relations and PR (20%)\n•\tMaintain and build relationship with media and lead in deepening the relationship between brand and the media\n\nPosition Objectives\n-\tThe Marketing Manager will manage the planning and execution of the seasonal and annual Marketing strategies for Brand within the market. \n-\tThe Marketing Manager will be responsible for championing Brand in Vietnam while maintaining its integrity and strictly adhering to the tenets of the brand. He or she will also be responsible for staying on top of local competitors, gaining in-depth market understanding – consumer and media landscape, building strategic buzz in the marketplace. \n\n\n", "requirements": "•\tMinimum 5 years’ experience in same level position, prefer candidates have experience in Retail industry.\n•\tMinimum 1 year experience in Fashion or Cosmetic\n•\tStrong reporting skills.\n•\tPro-active, adaptive and good follow-through\n•\tPositive attitude, result oriented, resourceful, innovative\n•\tGood command of English in writing & speaking\n•\tHas experience in opening new stores activities and activation\n•\tCompetent in office computer skills\n•\tHighly committed, passion, well organized, pro-active, honest, integrity, detailed, persevere and diligent\n", "required_skills": ["positive attitude"]}