{"title": "Video Engineer", "description": "Are you passionate about the experience of watching video content, such as TV Show, movies or social media ? Do you care about the quality and how efficiency it is to stream video to customers? Are you a video nerd with deep knowledge about AV1, VR , CMAF, WEBRTC and so on? \nWith us, you can use your video knowledge and experience at fullest and helping millions of developers who struggle to develop their video applications.\n\nResponsibilities\n- Improve our video processing service, make it produce lightweight and beautiful video streams, while cost effective, stable and fast!\n- Bring the best video encoding technology, Netflix-quality to our video service\n- Allocate the perfect fit compute resources to process videos base on theirs specs\n- Minimize error rate (below 0,01%).\n- Make it fast! Our customer would love to be able to see their videos available in a short time . The ½ relative between processing time / video duration is a start but we want it faster.\n- Continuously expand our video processing service across all major platforms!\n- Whether it's a powerful GPU instance or a low cost IoT chip , make our service run smoothly on them....\n- AWS, Google Cloud ,OpenStack or a bare metal server ...there's no limitation on which platform you can deploy.\n- Video or live stream delivery is costly , make it affordable for our customer while keeping the best playback experience.\n- Collaborate with our DevOps group and CDN vendors to put in place methods and tools for state-of-the-art content delivery\n- Guide the infrastructure team to develop a cost effective CDN\n- Develop a low latency live stream service", "requirements": "- Encoding experience using ffmpeg\n- Experience in coding with a programming language such as C++/Java/Python/JavaScript (Node)\n- Understands the impact of delivering great non-buffering playback experiences to users across a wide range of networks and devices.\n- Experience with cloud services such as AWS, GCP, Azure.", "required_skills": ["python", "aws", "javascript", "cloud", "encoding", "java", "c++", "azure", "cloud service"]}