{"title": "Site Reliability Engineer", "description": "As Site Reliability Engineer (SRE), you will take responsibility to ensure that all Uiza’s applications & services is running with desired SLA. You will contribute into design and develop solutions that help scaling the Uiza’s video platform with high availability, scalability and fault-tolerance. \n\nResponsibilities:\n●\tManaging multiple Kubernetes clusters in many regions/cloud provider. Ensure all the clusters are operating normally. Detects and resolve any problems arise. \n●\tDesign and operate cluster autoscaling strategies to leverage cloud provider elasticity (AWS, GCP, etc…). Monitor and adjusting the strategies accordingly.\n●\tManaging all the Content Delivery systems, ensure that all the videos from Uiza’s Platform is being delivers to customers with the least time. \n●\tManaging all the storage systems, ensuring high availability and able to detect and mitigate problems within SLAs.\n●\tDesign and develop the Uiza’s Fabric Controller, and system that connects all the computing resources and able to make decisions about which resources should be allocates for handling Uiza’s workload, from API, Video to Content Delivery.\n●\tDevelop & managing the CI/CD system, ensure that it can adapt with complex deployments such as Canary, Blue/Green.", "requirements": "●\tStrong knowledge about Linux Networking. When it comes to speed, each packet counts.\n●\tGood experience with popular Linux distributions, such as Ubuntu, CentOS, FreeBSD.\n●\tGood understanding about DNS, RTMP, HTTP1/2, QUIC protocol.\n●\tGood experience with Kubernetes and container networking interface.\n●\tHave experience working with major Cloud Provider such as AWS, GCP, Azure, Aliyun, etc ….\n●\tGood in developing system & network program by one of these language: Python, Golang, Rust or Java.\n●\tHave worked with orchestration language such as Ansible, Terraform.\n", "required_skills": ["kubernetes", "dns", "python", "golang", "orchestration", "centos", "ubuntu", "cloud provider", "cloud", "freebsd", "rtmp", "terraform", "protocol", "linux", "ansible", "rust", "java", "aws", "networking", "azure"]}