{"title": "BUSINESS DEVELOPMENT DIRECTOR", "description": "You will be joining the LOGIVAN sales team in either Ho Chi Minh City or Hanoi. As a Business Development Director, you will lead a sales team and be responsible for their performance. Specifically, you will be responsible for the following tasks:\n● Working with your team and with leaders on large accounts to secure critical contracts\n● Meeting potential clients at conferences and events\n● Conducting client meetings as necessary to build the relationship\n● Working with your current contracts to sign their accounts with LOGIVAN\n● Signing contracts with clients\n● Keeping warm relationships with your clients to encourage repeat orders\n● Building relationships with Trucking Partners to extend LOGIVAN’s supplier network\n● Completing team performance reviews on a regular basis\n● Organising and leading regular team meetings and training sessions\n● Building and maintaining a strong culture of great morale, cohesiveness and high-\nperformance in your team\n● Supporting the growth and development of your team members\n● Ensuring team performance targets are met\n● Collaborating with Operation Directors to improve LOGIVAN’s trucking service quality\n● Working with Leaders of other department (Finance, Accounting, Product, Operations) to improve LOGIVAN's products and services\n● Job Hours: Normal office hours, with flexibility for client visits", "requirements": "To be successful in this role, we are looking for relevant skills and at least 5 years of previous sales experience including 2 years of management experience with a proven track record.\n● Great people skills and capability to lead an ambitious team\n● Previous experience selling freight transportation\n● Experience of managing a high-performing team\n● Good organisational skills to keep lots of clients “on the go” at the same time\n● A can do attitude to problem solving\n● Being motivated by targets and always striving to perform higher\n● English language to a high standard", "required_skills": ["management", "people skill", "problem solving", "sales"]}