{"title": "Data Engineer", "description": "inOS is the definitive platform for financial services that powers digital financial products & services across Southeast Asia. We pave the way to provide financial support to the unbanked through simple, affordable and tech-enabled financial products & services. \n\nFinOS’ Data Science (DS) team is responsible for ensuring the company is well equip with the skills and technology needed to improve, change and solve engineering problem involving system, integration, deployment and development. DS runs multiple environment using continuous integration and deployment practice. We work side-by-side with the business to define the technical requirements and with the data science team to implement scalable, production- ready API and infrastructure using best practices.\n\nWe are seeking a customer-focused, passionate and driven Data Science Engineer with experience in developing Python-based API and cloud-based infrastructure. With the large volume of data which we will be leveraging, our job is to build and maintain proper data processing solution to bring reliable experiences for our customers. If you’re interested in being a part of a team that’s constantly learning and problem-solving, we’d love to talk with you. \n\nAs a Data Science Engineer, you work closely as part of a small setup in FinOS to lead the design and implementation of systems and tools to support the effort of FinOS. You will be:\n• Developing and implementing production backend system to serve data science prediction.\n• Designing system and data architecture.\n• Working with partners to integrate systems.\n• Problem-solve and develop solution at the intersection of data and systems.\n• Innovating by recognizing opportunities for automation and tools improvements.\n• Providing technical leadership for a team of data scientists.\n", "requirements": "• Mastery of one of Python, or similar language.\n• Experience with Relational databases or NoSQL databases.\n• Proven understanding of the full software development lifecycle including testing, continuous integration, and deployment.\n• Excellent problem solving, critical thinking, and communication skills.\n• Solid grasp of computer science fundamentals including data structures and algorithms.\n• Understanding on machine learning techniques.\n• Proven ability to evaluate and apply new technologies in a short time.\n• Self-motivated, proactive, and solution-oriented.\n• Experience with cloud platform services desired.", "required_skills": ["structure", "python", "data structure", "algorithm", "relational database", "testing", "critical thinking", "lifecycle", "software development", "cloud", "continuous integration", "problem solving", "nosql", "machine learning", "communication skill", "database"]}