{"title": "QC WITH BA SKILLS", "description": "Reporting to the Product Owner, you will be the key person for the development of the solution. Your expertise will be at the service of the team to ensure the best choice in technology. You will ensure that the development environment has the best resources and provides the best guarantees for the success of the project. You will be responsible for the quality of the development and its compliance with the specifications and architecture decided by the project team. \n\nAs a QC with BA skills, your main duties depend on the project phase and will fall broadly into the following categories:\n• Gather and clarify requirement from PO, support create wireframe for complex UCs\n• Clarify requirement with development team and verify all requirements of the system are fulfilled by the implementation.\n• Develop simple test plans, test cases and test reports.\n• Executes testing independently.\n• Contributes to the resolution of common system problems.\n• Participates and contributes during studies and/or gap analysis in order to identify\nfunctional gaps between the user’s current processes and current company systems’ functionality.\n• Analyzes data to determine solutions to system processing according to the business requirements.\n\nAs a contributor, you will:\n• Consult and listen to internal staff for feedback\n• Remove all technological obstacles from business operations\n• Conduct respectful and friendly communication with other contributors", "requirements": "Must have :\n- Must have 2 skills QC and BA: at least 70% QC + 30% BA, or 50/50\n- 5+ years of experience in software testing with 2 years in requirement analysis.\n- Experience with cross-browser and cross-platform testing (PC, mobile and tablet).\n- Experience identifying and separating defects between front-end and back-end, as well as managing and monitoring defects and familiar with bug tracking tools in Azure DevOps (previously TFS)\n- Strong experience in estimation, creating test plans, test cases, test reports.\n- Experience in testing API, performance using Postman/SOAPUI\n- Understand single page applications\n- Good English skills, especially in technical writing and able to communicate in English.\n- Ability to effectively manage time, and individually prioritize multiple tasks of\ncompeting priority\n- Experience in working with Agile Scrum process.\n- General understanding and experience of business processes as well as an interest to\nunderstand a broad range of business models and needs\n\nCommon :\n- A logical approach to problem solving together with a methodical, investigative and inquisitive mind\n- Can-do-attitude\n- Self-starter and fast learning, good teamwork and reliable\n- Appetite for startup environment (130 employees disseminated in Asia and Africa, 5 to 20 teammates per country): autonomous, proactive, can-do mindset, capacity to work with teams across different offices and from different cultures\n- Good at logical thinking and problem solving.\n- Passion, proactive with high responsibility.\n- Good in teamwork and independent working.", "required_skills": ["devops", "azure devops", "api testing", "teamwork", "analysis", "testing", "agile", "problem solving", "soapui", "azure", "postman"]}