{"title": "Product Manager cum Business Development", "description": "We are looking for the core team member/co-founder as the Product Manager cum Business Development to build the product and technology for the running operations, manage systems and its maintenance regularly.\n- Be a good-tempered, optimistic, traditional yet visionary hard-worker (like the Rapbank founder).\n\n(Product Management)\n- Responsible for full product development tasks such as analyzing, conceptualizing, prototyping\n- Drive data collection (define and own metrics), user feedback and market research to shape the product direction. Collect data is necessary to inform product idea, might be in the form of competitive intelligence, merchant behavior, business metrics or merchant's feedback.\n- Own the creation and documentation of product requirements and specifications.\n- Define vision and be responsible for strategy, roadmap and feature definition of your product.\n- Build-up & incharge end-to-end one of the key features of Rapbank product (ex: billing, top-up, ...) from ideas, development, rollout, and optimization of the product.\n- Coordinate and interface with other teams in the organization to implement the product design.\n- Work closely with BI team to formulate strategic insights and propose action plans to achieve business objectives.\n- Work closely with Technical team to implement the product ideas. Join with Marketing & BD team to launch & grow-hack the feature.\n- Work closely alongside different parts of the organization partnering with design, engineering, marketing, editorial, and partnerships teams to create extraordinary products\n- Own the Quality Assurance process as new products and features are released\n\n(Business Development)\n- Serve as a key member of the Business Development team to define the current payment landscape, strategize and execute top business development, partnership opportunities;\n- Leverage Rapbank’s business development network and generate new leads as required;\n- Develop a business development plan focused on growing the business through partnerships;\n- Actively identify prospects/partners across various industries to engage by effectively developing and communicating a clear Rapbank value proposition to the partner’s business;\n- Drive deals end-to-end from closure to execution and maintain key relationships at senior levels of small/medium/large banks;\n- Support the partnership process from building relationships to developing, negotiating and securing contracts.\n", "requirements": "- Passion and/or significant interest in financial inclusion/banking.\n- Experienced working on internet technology product company, from E-commerce or Fintech or Banking.\n- Experience working at startups, demonstrated success navigating fast pace and rapidly changing environments.\n- Strong communication skills you should be able to articulate your opinions confidently and with support\n- Excellent leadership skills and ability to build strong relationships across distinct stakeholders\n\n(Product Management)\n- 2+ years of experience in product building, and strong foundations and understanding of technology.\n- Keen product intuition and UX design sensibilities, with a strong desire to discover and fulfill the needs of users\n- Strong balance of both analytical and creative thinking\n- Great taste and aesthetic sensibility\n- Passionate about iterative development with an interest in honing product instincts through feedback, user, and A/B testing\n- Launched at least one successful product\n\n(Business Development)\n- Understanding of lending and payments space\n- Have experience in Business development or developing strategic partnerships for payment, card or e-banking operations, in banks or e-payment firms.\n- Experience in driving and implementing the business project;\n", "required_skills": ["product management", "management", "creative thinking", "banking", "testing", "communication skill", "internet", "leadership skill", "payment"]}