{"title": "Automation QA/QC/Tester - Open remotely 100% (Saigon suburbs or other provinces)", "description": "Automation Tester/QA will be a part of a fast growing team of developers to support a range of front end and back end projects for a large Australian client. You will be working with a large team of senior developers and Tech Lead. \n\n-Help support automation/ manual testers with mentoring.\n-Help lead the development of the Automation Test Strategy with good understanding of the development life cycle and areas of testing and methods.\n-Automation testing capabilities and the ability to create frameworks where there is none\n-Familiarity with CypressIO is essential and further experience with other automated frameworks such as Selenium, Cucumber / BDD highly regarded.\n-Test management tools such as JIRA, Xray\n- Ability in working across multiple projects simultaneously and an ability to meet time frames.\n- Develop test plans, test cases and automated test scripts using automated test tools.\n- Interpret, execute, record and evidencing test cases in accordance with project test plans.\n- Analyze and report test activities and results.\n- Work closely with the stakeholders to create functional and non-functional test cases and test data.\n- Hands on automation testing and manual testing where required.\n- Use industry best practices while creating test cases to ensure reliability and reusability.\n- Contributing to the QA practice involving document writing and the regression suite.\n- Design and manage effective, reusable and maintainable test automation frameworks and test suites.\n- Work with product and engineering teams to plan, develop and execute test cases and suites.\n- Work with business analysts, developers, and quality analysts to integrate test scripts (Unit, sanity, system, regression, integration).\n", "requirements": "- Knowledge in JavaScript is essential\n- Experience with Cypress and SQL Server", "required_skills": ["sql", "javascript", "cypress"]}