{"title": "Solution Architect", "description": "●\tPrimarily engaged in a technical consultancy role, providing technical assistance and guidance specific to enterprise level implementations, during the pre-sales process by identifying customers technical and business requirements in order to design a custom Uiza solution.\n●\tIn partnership with the sales team, formulate and execute a sales strategy to exceed revenue objectives through the adoption of Uiza.\n●\tEducate customers of all sizes on the value proposition of Uiza, and participate in all levels of discussions throughout the organization to ensure our solution is set up for successful deployment.\n●\tWork on­site with strategic, enterprise­ class customers, delivering solutions architecture consulting, technical guidance, knowledge transfer and establish “trusted advisor status”.\n●\tCapture and share best-practice knowledge amongst the Uiza community.\n●\tAuthor or otherwise contribute to Uiza customer-facing publications such as whitepapers, blogs, diagrams or the Uiza’s Handbook.\n●\tBuild deep relationships with senior technical individuals within customers to enable them to be Uiza advocates.\n●\tServe as the customer advocate to other Uiza teams including Product Development, Sales and Marketing.\n●\tPresent Uiza platform strategy, concepts and roadmap to technical leaders within customer organizations.", "requirements": "●\tExperience in a client-facing, technical role.\n●\tAbility to diplomatically address customer concerns and provide feedback.\n●\tPresentation skills with a high degree of comfort speaking with executives, IT Management, and developers.\n●\tStrong written communication skills.\n●\tHigh level of comfort communicating effectively across internal and external organizations.\n●\tSignificant experience with executive presence and a proven ability to lead and facilitate executive meetings and workshops.\n●\tDeep knowledge of software development lifecycle and development pipeline (planning to monitoring).\n●\tBachelors or Masters, ideally in Computer Science, Engineering or related field. Advanced degree would be considered an added asset.", "required_skills": ["written communication skill", "management", "written communication", "lifecycle", "communication skill", "software development"]}