{"title": "HR Manager ", "description": "We are currently the newest face in this innovative video technology, and are seeking HRM who are excel in:\n\n- Overall responsibility for management of HR Department.\n- Responsible HR’s Objectives, Policies are well developed and implemented in accordance with the organization’s vision, mission and strategies as well as local labor law.\n- Responsible that Job Description/ Work Flow are regularly updated.\n- Conducts wage survey within labor market to determine and make recommendations relating to competitive compensation and benefits packaging.\n- Manage all matters related Recruitment & Selection, Manpower Planning,\n- Compensation & Benefits, Training & Development, Employee Relations, Employee\n- Communications, Payroll & Productivity Management & People Management.\n- Apprehension of Labor law, corporate policies, focusing on HR Polices, C&B,\n- Performance Appraisal System and Corporate Social Responsibility, salary review, promotion or replacement.\n- Produces monthly HR Report and adjust the organization structure in accordance with company budget and payroll objectives.\n- Ensure development programs are in place and vibrant to support the growth of human capital.\n- Provides timely guidance and advice to business management to develop\n- resolution in managing employees issue and concerns effectively.\n- Provides direction amidst changing business priorities to ensure comprehensive and legally sound HR solutions.\n- Develops implementations plans to ensure successful execution of HR initiatives.\n- Facilitates affirmative action plan to ensure compliance, performance management, career development, workforce planning and succession planning.\n- Manages workforce planning, compensation and benefits and employees service.\n- Strategic partner to align HR policies and objective with Corporate and Business\n- Strategies to achieve business goals.\n- Open to learn, adaptable and flexible to a start-up environment.\n- Possesses excellent verbal and written English skills.\n- Versatile, assertive and able to work independently with minimum supervision.", "requirements": "We are looking for a skilled HRM to oversee all aspects of Human Resource practices and processes. HRM will support business needs and ensure the proper implementation of company strategy and objectives.\n\nThe goal is to promote company values and enable business success through human resources management, including job design, recruitment, performance management, training & development, employment cycle changes and talent management.\n\n- This position is mainly for Culture Building and Labor Law because there's another headcount in charge of recruiting  \n- University degree in law, business administration or related disciplines.\n- Minimum Bachelor’s Degree qualification in Business Management/Business\n- Administration with a concentration in Human Resource Management or any relevant disciplines.\n- Minimum 5 years’ of relevant experience as performing as a Professional HR Practitioner with at least 3 years’ of managerial experience\n- Have experience in Culture Building and Labor Law \n- Must fluent in English \n- Have a growth mindset ", "required_skills": ["recruiting", "human resources", "management", "administration", "recruitment", "talent management", "performance management", "implementation"]}