{"title": "CHUYÊN VIÊN TUYỂN DỤNG", "description": "Công việc chủ yếu gồm 2 phần chính: Tuyển dụng cho Up & Quản lý hồ sơ nhân sự\n\n- Quản lý công tác tuyển dụng công ty theo quy trình tuyển dụng;\n- Lập kế hoạch tuyển dụng;\n- Tham gia các công việc trong quy trình tuyển dụng: tiếp nhận yêu cầu tuyển dụng từ các phòng ban, trình duyệt yêu cầu tuyển dụng, thông báo tuyển dụng, tìm kiếm hồ sơ ứng viên, sàng lọc hồ sơ, liên lạc với ứng viên, sắp xếp phỏng vấn...và các công tác liên quan đến quy trình;\n- Lập nguồn dữ liệu hồ sơ ứng viên, đảm bảo cung ứng nguồn nhân lực kịp thời;\n- Cập nhật & báo cáo tình hình tuyển dụng cho Trưởng phòng Nhân sự;\n- Làm việc và duy trì mối quan hệ tốt với các kênh tuyển dụng khác nhau;\n- Thực hiện những công tác khác liên quan đến tuyển dụng do Trưởng phòng Nhân sự yêu cầu.", "requirements": "- Kiến thức chuyên môn: ĐH các ngành Quản trị nhân lực, Quản trị kinh doanh, Xã hội nhân văn,\n- Có ít nhất 03 năm kinh nghiệm về tuyển dụng. Lưu ý: Sinh năm 92 trở về trước. Cần bạn cứng tuổi để có thể phỏng vấn, lọc CV, thoả thuận với nhân sự một số thông tin cơ bản. \n- Kỹ năng: Kỹ năng giảng dạy, truyền đạt, phân tích, tổng hợp; thuyết phục.\n- Tổ chức công việc tốt.\n- Có khả năng quản lý và bao quát công việc.\n- Có tư duy sáng tạo, khả năng đề xuất và triển khai ý tưởng .\n- Tự tin, tham vọng và mong muốn được thử thách bản thân trong một lĩnh vực mới.", "required_skills": ["analysis", "can"]}