{"title": "Mid - Senior QA Automation Engineer", "description": "QA Automation Engineer builds and maintains a Test Automation Framework. We create, we maintain, and we execute automated scripts to ensure the highest quality.\n\nWe are currently the newest face in this innovative video technology, and are welcome QA Automation Engineer who are excel in:\n- Participate in the design of automation covering functional areas of the product\n- Plan and build automation tests and tools as required\n- Develop and maintain test scripts, write and maintain test automation scripts where applicable\n- Assist project teams on identifying the needs for appropriate test environments and coordinate the establishment of appropriate test environments\n- Perform regression testing using existing scripts\n- Find, track and prioritize bugs and work toward their resolution\n- Define and track quality assurance metrics such as defect densities and open defect counts\n- Participate in the testing of production emergency bug fixes\n- Be a part of our development, be a part of our success.  ", "requirements": "- Have at least 2+ years of experience in Test Automation, API automation, cross-browser automation and have worked in an agile environment.\n- Expertise test scripts not using UI.\n- Have good expertise in Selenium, Appium.\n- Expertise in creating and executing automated test scripts.\n- Expertise in Software Testing Life Cycle and Defect Life Cycle.\n- Experience in preparing the Automation flow scenario and test cases for the different modules using Selenium.\n- Experience in API test automation, Web and Mobile based test automation on different environments.\n- Ability to Create, debug and handle exceptions\n- Expertise in Creating and Implementing Test Automation Data / Hybrid Driven Frameworks.\n- Experience with testing software at the API level and using automation tools.\n- To have good experience in Test Plan Creation, Test Estimation, Test Case Creation and Script Review\n- Have experience in tools like JIRA, QC tools, etc.\n- Experience in Managing, analyzing, and maintaining Automation test cases in QA tools.", "required_skills": ["agile", "testing", "appium", "automation", "jira", "selenium", "automation test"]}