{"title": "Product Manager", "description": "The Product Manager’s role is to manage a team of Product to differentiate Mytour’s presence in the domestic market of Vietnam, and to deliver a fast, easy, light and interactive experience and interface to customer.\nWe look for people with desire and passion in building products and shares the same values and common goals to grow Mytour’s Product team.\n* Responsibilities:     \n-\tLead the team consisting of product owner, UI/UX designer, and product Front-End, to bring out the uniqueness of Mytour’s product in the domestic market of Vietnam that attracts customer;\n-\tAct as a driver to deliver brand awareness to customer;\n-\tLeading the research and analysis of competitive landscape, customers, product metrics, and latest internet trends to identify and fill product gaps and generate new ideas that grow market share, improve customer experience and drive growth and conversion;\n-\tCreate product roadmap and translate product strategy into detailed requirements and prototypes;\n-\tScope and prioritize activities based on business and customer impact;\n-\tWork with internal data to understand customer behavior and identify problems and opportunities;\n-\tWorking closely and manage engagement with internal stakeholders, i.e. engineering, marketing, market and partnership, data team, operations, and external stakeholders to implement new features and enhancement;\n-\tSet individual KPIs in alignment with the Country Manager;\n-\tTrack KPI metrics and escalate/resolve issues accordingly, together with the team;\n-\tReport and analyze – plan with line manager and/or top management, implement, and monitor agreed KPIs and be able to analyze, and discuss trends, issues and opportunities with team and manager;\n-\tMeasure improvements and impact of changes and set-up mechanisms to audit impact and perform necessary course corrections where needed to meet business objectives.\n", "requirements": "Professional Qualifications\n-\t4+ years of relevant work experience;\n-\tExcellent analytical and problem-solving skills and strong intuitions of user behaviors;\n-\tA strong drive to make things happen, structured, and effective communication skills with ability to influence;\n-\tAn idea generator. Comfortable with challenging status quo, creative, and possess grit to drive idea to fruition;\n-\tGood working usage of English;\n-\tAbility to meet rigorous deadlines and work effectively with others;\n-\tPassion in internet products and e-commerce landscape.\n-\tAccustomed to drive results in a collaborative, cross-functional environment with little instruction or oversight.\n\nPersonal qualification:\n-\tAbility to work independently and in teamwork; exhibit problem-solving ability;\n-\tProactive and good communication skill with other departments;\n-\tAbility to handle multiple tasks concurrently with ease and take ownership of assigned tasks or projects\n", "required_skills": ["teamwork", "ease", "communication skill", "problem solving", "internet", "problem solving skill"]}