{"title": "BD / Content writer (blockchain)", "description": "WeTrust is hiring for a full time, business associate role that will assist the team with blockchain research, marketing, product development, copywriting, customer service and more. The role is a full time position from Monday to Friday at the HCMC office in 384 Hoang Dieu, District 4, Ho Chi Minh City.\n\nWeTrust đang tuyển 1 vị trí full time có thể cùng team nghiên cứu blockchain, marketing, phát triển sản phẩm, copywriting, chăm sóc khách hàng và hơn thế nữa. Vị trí full time này làm việc từ thứ 2 đến thứ 6 tại văn phòng ở TP.HCM, địa chỉ 384 Hoàng Diệu, Phường 6, Quận 4.   \n\n\nResponsibilities Include:\n- Research about blockchain and cryptocurrency\n- Writing weekly newsletters (In English) about the company’s products and development\n- Make social media posts (Twitter, Facebook, Linkedin, Telegram) and respond to customers and community members\n- Online community outreach to blockchain and crypto community channels\n\n\nMô tả công việc:\n- Nghiên cứu về công nghệ blockchain và tiền mã hoá\n- Viết newsletter hàng tuần (bằng tiếng Anh) về sản phẩm và tiến độ của công ty\n- Quản lý các kênh mạng xã hội (Twitter, Facebook, LinkedIn, Telegram) và trả lời câu hỏi của cộng đồng/ khách hàng.\n", "requirements": "Required:\n- Fluent / Advanced in English and Vietnamese. Content is all in English and team communicates in English (half the team can speak Vietnamese, but the US team communicates via English).\n- Marketing experience. Knowledgeable about marketing channels such as Facebook, Twitter, Linkedin\n- Interest and background in technology, startups, blockchain and cryptocurrency\n\nYêu cầu công việc:\n- Thành thạo trong giao tiếp (và viết) tiếng Anh và tiếng Việt. Nội dung tất cả bằng tiếng Anh và team giao tiếp bằng tiếng Anh. (team ở Việt Nam có thể nói tiếng Việt, team bên Mỹ giao tiếp hoàn toàn bằng tiếng Anh)\n- Kinh nghiệm marketing. Có kinh nghiệm trong marketing Facebook, Twitter, LinkedIn.\n- Có hứng thú và trải nghiệm trong công nghệ, startups, blockchain và tiền mã hoá. \n", "required_skills": ["blockchain", "can", "cryptocurrency", "marketing", "twitter"]}