{"title": "Community and Event Manager", "description": "Community Manager:\n- Create a collaborative working environment amongst members in all sites through community events and personal introduction. \n- Manage all activties and liason with Community Lead to ensure highest level of member satisfaction. \n- Communicate with CA to proactively gather data on members’ business to develop program/events/activities that help members achieve their objectives. \n- Recommend best practices, including but not limited to: community management, sales, events, training, and member experience on a company wide level. \n- Seek opportunties to engagement members through on-site events, personal introduction or other programs. \n\nEvent Manager: \n- Taking inquiries from differents channels  (Sales, on-site, members), giving quotation and conduct contracts. \n- Prepare budgets and conduct contracts with clients/ vendors, assigned by Head of Community. \n- Source and negotiate with vendors and suppliers. \n- Coordinate with Marketing team to promote & PR for the event. \n- Manage and execute events marketing/ partnerships event from start to finish (including hiring personnel. supervise staffs and operations). \n- Propose ideas, suggestion and action plan to achieve KPIs and improve effectiveness. \n- Oversee events to ensure there is a good balance of events topics that align with Community building strategy. \n\nPartnerships manager: \n- Manage and execute partnerships-related activities, assigned by Head of Community. \n- Discover and propose partnerships opportunties with UP’s members that benefits both UP and member’s business objectives. \n- Personnel Management. \n- Manage Community &amp; Event team to achieve KPIs and support personal growth. \n- Hiring and traning volunteer team to support on-site events. \n- Oversee team’s performance and advise Head of Community on individual assessments.", "requirements": "- At least 2-year related working experience \n- The ability to work in communication and organizing, especially in management.\n- One who is willing to work under high pressure and be hands-on as needed and proactively assume responsibilities and ownership.\n- Able to identify problems, articulate what needs to be done, assign tasks to team members, and regularly check in on them to measure results.\n- Strong analytical and writing skills; proficient in using Microsoft products such as Excel, PowerPoint, Word.\n- Fluent in English is the advantage.\n- The ability to change and to lead change in time to meet the needs of the business change. Effective communication.\n- Skills and knowledge of operational procedures.", "required_skills": ["microsoft", "communication skill", "excel", "management"]}