{"title": "Merchandising Director", "description": "The Anti-Fragility Health Clinic (AFHC) delivers progressive strategies that enable patients to identify, treat and resolve the root cause of their physical ailments. Grounded in the science of Functional and Anti-Fragility Medicine, AFHC utilizes proprietary algorithms to gain an objective assessment of current health status and prescribes scientifically based targeted treatments to promote healing, alleviation of symptoms and disease and ultimately, health quality of high performance and resilience. \n\nAFHC is looking for a Merchandising Director to design, develop, deliver and deploy strategies of promoting the sale of AFHC products and services. This position will collaborate across marketing channels and departments to drive profitable sales, maintain optimal performance metrics, and analyze competitive data to find new innovations within the customer marketplace channels and undercover new market share opportunities. \n\nThis is an opportunity to participate and develop an area of growth for the business. Strong communication and analytical skills as well as relationship building are key for success in this position.\n\n● Design, develop, deliver, and deploy merchandising strategies that incorporate the business objectives. \n● Identify growth opportunities and ensure the financial success of the business by meeting and exceeding sales and inventory goals. \n● Identify, surface and size potential business opportunities and risks analyzing sales and web performance metrics, configuration management data and competitive benchmarking; provide appropriate and timely direction to business partners and team in order to react quickly to customer and business trends considering all levers such as site changes, inventory levels and marketing opportunities and goals. \n● Partner with merchant, planning and brand marketing teams to create a compelling marketing campaigns to drive brand awareness, acquire new customers and retain existing customers. \n● Develop key metrics to improve and enhance the customer experience. \n● Responsible for overall site content management including merchandising, setting up SKUs, updating product pages and building category and brand pages within Shopify. \n● Oversee merchandise selection, pagination, and updates for the business sites, featured shops and trend pages based on new arrivals, inventory availability and business pushes. \n● Run and analyze web and KPI selling reports on a weekly & monthly basis, understanding when and where to react and address business needs to be in line with the financial plan for each season. \n● Creation and analysis of trade reporting of key statistics, trends and sales on a weekly & monthly basis. \n● Create or develop product descriptions and general text for website. \n● Maximize sales and increase profit across the site and marketplaces. Identify and develop new business opportunities. \n● Weekly and monthly reporting – analyze all site data and provide reporting. \n● Lead in resolving any site and marketplace issues. Responsible for timely resolution of issues and status communication.\n\n", "requirements": "● At least 4 years of related working experience \n● A high level of integrity, accuracy, dependability, enthusiasm, and confidentiality.\n● Strong computer skills and in depth knowledge with Microsoft Excel, Word, Power Point, and Shopify.\n● Excellent verbal and written communication skills.\n● Ability to work in a multi-tasking, fast paced environment.\n", "required_skills": ["microsoft", "written communication skill", "excel", "written communication", "dependability", "communication skill", "microsoft excel"]}