{"title": "BUSINESS OWNER (ZALOPAY)", "description": "A Business Owner is someone who owns a business scenario (or a Payment scenario) of ZaloPay. He/she is expected to take fully responsibilities for biz PnL of the assigned scenario. \n\nThe Business owner will manage and allocate the proper resources (both capital & people) to each of functions in order to run the business as plan.\n\nBusiness owners perform various duties, tasks, and responsibilities geared towards making a success of their businesses, including:\n- Lead the business scenarios from definition to execution, against product go-to-market plan from the early stage to marketing & operation.\n- Make the business & resource plan for the project.\n- Cooperate and leverage the resource of functional team to implement project activities.\n- Make a viable feasibility assessment of the business to check its chances of success.\n- Make tradeoff decisions based on business insights and experimentation.\n- Monitor the progress, measure the project performance, and feed insights back into product development & operation team to drive growth and achieve the biz goal.\n- Clearly communicate the plans, progress, benefits and results, as appropriate, to a spectrum of audiences: product team, cross-functional team, VNG, and users/merchants.", "requirements": "- Minimum 3-5 years experience in management/ operation the business (scaled business to consumer). * Do NOT prefer candidates with background focus on BD & Sales\n- Degrees from top schools abroad, background of Economics, Finance or Business Administration.\n- Customer obsession. The ability to take on complex product challenges and find elegant, simplifying solutions to avoid making them our users and partner’s problems.\n- Finger-tipsiness with data. Know how to leverage this data to make decisions without getting stuck in analysis paralysis\n- Ability to organize a small scope of team, allocate and leverage the limited resource. Ability to create partnerships both inside and outside of the Product organization\n- Thrives in a startup environment: loves dealing with fast pace, changing needs, and limited resources.\n- Excellent organizational and communication skills\n- Experience working directly with software engineers and other multidisciplinary teams.", "required_skills": ["management", "make decision", "analysis", "administration", "communication skill", "finger", "finance", "operations management"]}