{"title": "Senior Front-End Developer", "description": "For the development of a new software\nReporting to the Product Owner, you will be the key person for the development of the solution. Your expertise will be at the service of the team to ensure the best choice in technology. You will ensure that the development environment has the best resources and provides the best guarantees for the success of the project. You will be responsible for the quality of the development and its compliance with the specifications and architecture decided by the project team. \n\nAs a Senior Front-End Developer, your main duties depend on the project phase and will fall broadly into the following categories:\n• Work with Product Owner and development team to provide optimal IT solutions for business problems.\n• Participate in our entire product lifecycle, implement front end logic following Technical Design document.\n• Analyze and setup advanced features of the company's app.\n• Customize layout based on requirement from PO.\n• Build UI components to increase more utilities and usability of the application.\n• Contact and integrate with the third-party apps.\n• Collaborate with the product team to raise and resolve the frontend issue.\n• Analyze requirements and maintain technical documentation on front end.\n• Suggest idea to build user-friendly layout\n\nAs a contributor, you will:\n• Consult and listen to internal staff for feedback, understand requirements and develop appropriate solutions\n• Remove all technological obstacles from business operations\n• Conduct respectful and friendly communication with other contributors", "requirements": "Must have :\n- 4+ years of working experience in working intensively with web applications.\n- Highly experience with Javascript/HTML/CSS (Ajax, JSON, jQuery) is a must.\n- Highly experience with many CSS frameworks, Bootstrap is a must. Vue Bootstrap are preferred.\n- Highly experience with SPA design.\n- Strong understanding on UI/UX, able to cut layout efficiently.\n- Experienced with PWA, Web API.\n- Highly experienced with many frontend frameworks (VueJs is preferred).\n- Be familiar with web dev tools (Gulp / WebPack / Less / Sass, ...).\n- Be proficient in Git and know how to resolve issues.\n- Have good knowledge and understanding on Object Oriented Programming and Functional Programming\n\nCommon :\n- Good English communication.\n- A logical approach to problem solving together with a methodical, investigative and inquisitive mind\n- Self-starter and fast learning, good teamwork and reliable\n- Appetite for startup environment (130 employees disseminated in Asia and Africa, 5 to 20 teammates per country): autonomous, proactive, can-do mindset, capacity to work with teams across different offices and from different cultures", "required_skills": ["le", "json", "gulp", "teamwork", "pwa", "object oriented", "ajax", "javascript", "bootstrap", "vuejs", "git", "problem solving", "html", "jquery", "css framework", "css"]}