{"title": "Business Development + Account Executive", "description": "Recruitery is Vietnam’s leading talent referral-based platform for companies that are proactive about approaching the best talent, and don’t just rely on applications. \n\nOver 200 companies use Recruitery to assist their talent acquisition efforts. Over 2,000 headhunters have registered on the platform. \n\nWe're looking for a successful Business Development Account Executive to drive growth in key existing customers:\n\n• Establish and develop relationships with potential clients, partners (headhunters), key decision-makers, and industry leaders to promote Recruitery’s products, services and human capital solutions. \n• Drive deals end-to-end from closure to execution and maintain key relationships with customers;\n• Support the cooperation process from building relationships to developing, negotiating and securing contracts.\n• Keep clients (employers) and users (headhunters) informed at all times and provide answers to any questions regarding projects. Helping collaboration between clients and users to achieve placements. \n• Manage and track clients, users and candidates on Recruitery system.\n• Support the development of work plans for the business department, monitor the progress of the plan and urge the members to complete.\n• Prepare and manage administrative documents related to business activities such as making quotes, contracts, invoice, etc.\n• Ready to take on new tasks when requested from Recruitery as long as it is not outside the scope of Recruitery's work", "requirements": "• At least 1 year of working experience in sales/business development/customer service \n• Ability to work in a fast-paced, result-oriented environment.\n• Having a strong teamwork style and high commitment\n• Open to feedback and quick to learn \n• Good in English\n• Ability to call (and telesales) on the highest levels of decision-makers in the organization.", "required_skills": ["sales", "teamwork"]}