{"title": "Senior BI Analyst ", "description": "FinOS is the definitive platform for financial services that powers digital financial products & services across Southeast Asia. We pave the way to provide financial support to the unbanked through simple, affordable and tech-enabled financial products & services. \n\nIn this role, the Business Intelligence (BI) Analyst serves as the primary bridge through the business to communicate high value information to support data-driven decision making demands. He/she will continuously evolve management reporting, conduct complex data analysis and deliver business insights in an environment of rapid growth and increasing complexity.\n\nThe successful candidate must be able to roll-up his/her sleeves and work directly with very large datasets and BI tools. He/she will be passionate about their work, detail-oriented, highly analytical and have excellent problem-solving skills. \n\nResponsibilities\n• Create, develop and own the APAC BI reporting and analytical environment\n• Collaborate with Data Engineers on the design, development and maintenance of data models\n• Lead the development and provision of BI reporting through the deployment of self-service reports and dashboards\n• Lead the development and provision of advanced analysis through the use of classical statistical and machine driven techniques\n• Maintain thorough knowledge of existing and emerging open source and proprietary BI and advanced analysis tools", "requirements": "• Bachelor’s degree in Business Administration, Finance, Economics, Computer Science, Data Science, Engineering or other related fields \n• Significant experience in a senior role in Finance, Operations, or other related fields \n• Expert working knowledge on SQL and/or similar tools to perform data querying, building data models and conducting data analysis. \n• Exceptional visualization skills using Tableau, Qlikview or other relevant visualization tools \n• Exhibits sound business judgment, a proven ability to influence others, strong analytical skills, and a proven track record of taking ownership, leading data-driven analyses, and influencing results \n• Strong written and verbal communication skills, with a track record of presenting to senior management\n• Effective self-starter who excels in a lean and fast-paced organisation", "required_skills": ["visualization", "verbal communication skill", "senior management", "lean", "management", "analysis", "qlikview", "administration", "sql", "communication skill", "tableau", "verbal communication", "data analysis", "finance"]}