{"title": "Senior Frontend React.js Engineer (Silicon Valley Startup)", "description": "Everfit is on a mission to bring personalized fitness to the millions! We believe in the power of personalized fitness education and the life-changing effects it can have on our health and wellness. We help fitness coaches to share their expertise with more people — faster, cheaper, and more professionally. We are in a super fast-growing mode and 2021 is going to be an explosive year! 💪\n\nOur core product enables personal trainers and gyms to rapidly build, deliver, and monitor client training programs and helps increase client retention, engagement, and drive acquisition. Trainers can access our suite of training tools — workouts, nutrition, Habit coaching, messaging, and automation — all in one place!\nOur founders are from San Francisco, but we have a distributed team of advisors, engineers, designers, and interns working together from Boston, Indonesia, Vietnam, UK, and Silicon Valley. Our core engineering team is based in the beautiful beach city of Da Nang!\n\nWe are looking for people who are passionate about fitness and excited about building products that could touch millions of people to join us on this meaningful journey.\n\nEVERFIT’S CORE VALUES:\nDedication: With devotion to our craft, we put our heart into our work and take responsibility for our contributions. We always make sure this is the best work we present.\nCollaboration: A startup is like a relay, each leg is as important as another. We achieve success together as a team: sharing new ideas, being responsible to others, and helping each other out always.\nWinner Spirit: We have our eyes set on the prize. We are willing to buckle down, stay driven, and put in more effort to outwork the competition. But we don’t just work hard; we also work smart. We find solutions and learn new skills. Because we aim to be the winner, the #1.\nJoy every day: There will be tough days. But we remember to have fun and enjoy our friendship with each other. We bring positivity to the team, remembering to cheer on each other and celebrate our wins - no matter how large or small.\n\nYOUR RESPONSIBILITIES:\n- Build new features and improve current features on our web platform\n- Follow the product roadmap and product specs guideline\n- Operate effectively on Jira\n- Operate effectively on Bitbucket\n- Collaborate closely with the Product team and Engineering team Members to ship great products\n", "requirements": "- 2+ years experience with React.js\n- Must have strong JavaScript skills and JavaScript ES6\n- Knowledge of modern javascript frameworks and build tools\n- Experience with REST,  web development, test-driven development, and writing tests with testing frameworks (Jest, chai, mocha, etc.).\n- JavaScript ES6UX\n- Git\n- Basic communication in English and middle at reading and writing skill.", "required_skills": ["javascript framework", "rest", "mocha", "website development", "test driven development", "testing", "reactjs", "javascript", "git", "chai", "jest", "es6"]}