{"title": "Operations Manager ", "description": "- Quản lý vận hành tất cả chi nhánh của Up co-working space ở HCM\n- Làm việc chính ở chi nhánh Lê Duẩn, Quận 1 của Up-coworking space\n- Lead các quản lý cơ sở ở HCM & làm việc trực tiếp với COO;\n- Đề xuất và hiện thực hóa các dự án, kế hoạch phát triển, cải tiến quy trình hoạt động của công ty, nhằm tăng năng suất; \n- Đề xuất và hiện thực hóa các quy chuẩn chất lượng cho các site đang và chuẩn bị đi vào vận hành của UP Co-working Space; \n- Chịu trách nhiệm điều phối và giám sát việc sử dụng các trang thiết bị cung ứng, cơ sở vật chất cho các site đang và chuẩn bị đi vào vận hành của UP Co-working Space; \n- Quản lý đội ngũ kỹ thuật đảm bảo yêu cầu về hạ tầng kỹ thuật tốt và hiệu quả nhất; \n- Làm việc với các đối tác cung cấp dịch vụ khác nhau, duy trì và đảm bảo việc hoạt động của UP Co-working Space;\n- Các công việc theo yêu cầu của cấp trên.", "requirements": "Trình độ: Đại học trở lên\nCó kinh nghiệm với môi trường startup, nhất là startup global\nNgoại hình Nam/nữ, khuôn mặt ưa nhìn, tác phong chuyên nghiệp\nĐộ tuổi: sinh năm 1990 trở lên (cần độ đằm nhất định, quản lý nhân sự và đánh giá được con người)\nChuyên ngành: Không phân biệt chuyên ngành, ưu tiên ứng viên chuyên ngành quản trị kinh doanh, thương mại, ngoại giao ..\nChứng chỉ: Không yêu cầu\nKinh nghiệm: Có ít nhất 03 năm kinh nghiệm quản lý vận hành trong lĩnh vực kinh doanh dịch vụ: F&B, Hospitality, Khách sạn, Cà phê, Quản lý toà nhà, ....\n\nKiến thức: \n- Có kiến thức về tin học văn phòng\n- Có kiến thức trong lĩnh vực co-working space,bất động sản hoặc thị trường cho thuê văn phòng.\n\nKỹ năng/Khả năng: \n- Có khả năng giao tiếp tiếng Anh.\n- Có kỹ năng tìm kiếm khách hàng và chốt deal với khách hàng.\n- Nhanh nhẹn, tự tin trong giao tiếp.\n- Tính cách hòa đồng, nhiệt tình, vui vẻ.\n- Thái độ tích cực &amp; khả năng làm việc dưới áp lực cao, hướng tới mục tiêu\n- Không nói ngọng, nói lắp, nói giọng địa phương.\n- Có khả năng tiếp thu, nắm bắt nhanh công việc nhanh.\n- Tự tin, tham vọng và mong muốn được thử thách bản thân trong một lĩnh vực mới", "required_skills": ["leasing", "coffee", "positive attitude", "operation management", "amp"]}