{"title": "Nhân viên kinh doanh", "description": "TÓM TẮT CÔNG VIỆC:\n- Đảm bảo số lượng ký kết hợp đồng luôn đạt target được giao.\n- Phát triển hệ thống khách hàng theo khu vực phụ trách.\n- Sử dụng telesale, marketing, viết bài content ... tiếp cận với khách hàng tiềm năng trong lĩnh vực co-working space. Thực hiện công tác bán hàng.\n- Các công việc khác theo sự chỉ đạo của Ban Lãnh đạo.\n\nMÔ TẢ CÔNG VIỆC CHÍNH:\n1 Thực hiện công việc bán hàng:\n- Phụ trách doanh số theo site dưới sự phân công của Trưởng bộ phận.\n- Tìm kiếm khách hàng, mời khách hàng lên trên site trải nghiệm và thực hiện việc thuyết trình & ký kết các hợp đồng cho khách hàng mới.\n- Chăm sóc khách hàng cũ để luôn đảm bảo khách hàng muốn tái ký hợp đồng.\n- Hỗ trợ các workshop do UP tổ chức để tìm kiếm khách hàng tiềm năng và bán hàng trực tiếp tại sự kiện.\n- Chăm sóc khách hàng và hỗ trợ khách trong quá trình làm việc tại UP\n2 Phát triển hệ thống khách hàng\n- Làm việc với Marketing để cùng xây dựng hệ thống khách hàng tiềm năng.\n- Sử dụng các kênh cá nhân: facebook, social media.. xây dựng hệ thống khách hàng tiềm năng tại khu vực mình phụ trách\n3 Thực hiện công việc báo cáo\n- Cập nhật hệ thống dữ liệu đảm bảo việc báo cáo được đúng theo từng ngày, từng tuần, từng tháng..\n- Căn cứ trên số liệu báo cáo có những điều chỉnh và biện pháp để tăng số lượng khách hàng thuê.\n4 Các công việc khác:\n- Hỗ trợ các công việc khác theo sự phân công của Trưởng bộ phận", "requirements": "Trình độ: Đại học trở lên\n\nCó kinh nghiệm với môi trường startup, nhất là startup global\n\nNgoại hình Nam/nữ, khuôn mặt ưa nhìn, tác phong chuyên nghiệp\n\nChuyên ngành: Không phân biệt chuyên ngành, ưu tiên ứng viên chuyên ngành quản trị kinh doanh, thương mại, ngoại giao ..\n\nChứng chỉ: Không yêu cầu\n\nKinh nghiệm: Có ít nhất 1 năm kinh nghiệm trong lĩnh vực kinh doanh, bán hàng\n\nKiến thức: \n- Có kiến thức về tin học văn phòng \n- Có kiến thức trong lĩnh vực co-working space,bất động sản hoặc thị trường cho thuê văn phòng.\n\nKỹ năng/Khả năng: \n- Có khả năng giao tiếp tiếng Anh.\n- Có kỹ năng tìm kiếm khách hàng và chốt deal với khách hàng.\n- Nhanh nhẹn, tự tin trong giao tiếp.\n- Tính cách hòa đồng, nhiệt tình, vui vẻ.\n- Thái độ tích cực &amp; khả năng làm việc dưới áp lực cao, hướng tới mục tiêu\n- Không nói ngọng, nói lắp, nói giọng địa phương.\n- Có khả năng tiếp thu, nắm bắt nhanh công việc nhanh.\n- Tự tin, tham vọng và mong muốn được thử thách bản thân trong một lĩnh vực mới", "required_skills": ["leasing", "positive attitude", "sales", "sell", "amp"]}