{"title": "Recruitment Executive (Mobile apps company) (SIGNING BONUS) ", "description": "Internal activities:\n- Align with Hiring Manager to define recruitment demands & candidate requirement.\n- Develop and update job descriptions\n- Prepare recruitment materials and post jobs to appropriate job listing agency\n- Source and recruit candidates by using databases, social media etc\n- Assist Hiring Manager in Hiring process (hiring rounds and related affairs)\n\n External activites:\n- Cooperate and manage job listing agencies, headhunt agencies depending on recruitment demands\n- Conduct interviews/phone interviews using various reliable recruiting and selection tools/methods to filter candidates within schedule\n- Firstly assess applicants matching to basic requirements of JD.\n- Transfer information to People Ops Team to prepare new hire packet (onboard date, new hire information…)\n- Act as a point of contact and build influential candidate relationships during the selection process\n- Manage and increase the candidate experiences\n- Promote company’s reputation as “best place to work”\n- Align and cooperate to Community Team / Employer Branding Team to conduct PR Event to potential candidates (collect prospect data at touching points…)\n- Support to manage the recruitment activities on social channels (Facebook page, groups, Linkedin..)\n\nOther duties:\n- Monitor and apply HR recruiting best practices\n- Assist Talent Acquisition Manager to research data in specific labour market.\n- Provide analytical and well documented recruiting reports to the rest of the team\n- Other relevant tasks in recruiting & talent acquisition.", "requirements": "- Over 2 years of working experience in recruitment field, preferably in IT companies with solid knowledge in IT recruitment.\n- PC literacy (MS Office, Internet, in particular)\n- Excellent organizational skills, verbal and written communication skills and strong at building relationships with others;\n- Ability to work independently with minimal supervision and a team player\n- Good time management, organizational, inter-personal & multi-tasking skills\n- Must have key characteristics: careful, accountable, strongly empathy, passionate, enthusiastic, sociable and proactive\n- Positive thinking & supportive\n- Fluent English", "required_skills": ["written communication skill", "management", "written communication", "recruitment", "communication skill", "internet"]}