{"title": "SEO and Content Team Leader", "description": "We are looking for the potential candidate for the position SEO & Content Team Lead. In this position, you will actively improve brand search engine rankings. And of course, you should be result-oriented by reviewing the performance clearly and keep optimizing the strategy and plan continuously to get ideal result. On top of SEO, you also have responsibility to oversee the social media and after sales team that actively engage with our customers.\n\n- Oversee Mytour site performance and implement best practices in both on\n- and off-page optimization to increase SERP visibility, CTR and conversions. \n- Performing ongoing keyword research including discovery and expansion of keyword opportunities. \n- Build scalable content and link building processes aligned with Mytour brand and product focus, utilizing in house editorial resources, outside agencies, freelancers, social media as needed. \n- Integrate and leverage search, analytics and reporting insights to develop strategic content recommendations for Mytour. \n- Passionately study and implement new, unique and creative SEO techniques, including finding outside opportunities for additional SEO training. \n- Stay up-to-date on emerging industry trends, search algorithms, indexing and data modeling. \n- Monitor competitors and analyze the effectiveness of strategies and tactics they employ. \n- Assist in formalizing company SEO standards and procedures. \n- Monitor and analyze performance data to develop actionable insights that can be measured and reported", "requirements": "- Good command of Vietnamese and English language both written and spoken.\n- Strong experience in SEO and ASO.\n- Comfortable retrieving and analysing data from Google Webmaster Tools and Google Analytics.\n- Advanced Excel skills (pivot tables, look-up function and conditional functions)\n- At least 3-4 years of relevant work experience\n- Good critical and analytical thinking\n- Must have experience in managing freelancers/Content Writers\n- Excellent in execution and possess growth mindset\n- Strong sense of ownership and accountability and has keen and attention to details\n- Good interpersonal skills and ability to work well in a team environment\n- Strong leadership and team management", "required_skills": ["excel", "team management", "analytics", "management", "google analytics", "analytical thinking", "interpersonal skill"]}