{"title": "Business Development Manager", "description": "We’re looking for Business Launchers to operationalize PostCo across Vietnam in a matter of weeks while building and growing our three-sided partnerships with the retail network, online stores, and logistics partnerships.\n\nYou are a critical piece of PostCo's success in this market. You’ll be handling all partnership across our retail partners, online stores and logistics. This is an intense, business-side startup role. There's no such thing as a typical day, and to excel, you can't just be smart – you have to be self-motivated, have exceptional interpersonal & relationship-building skills, and be highly analytical. You will handle everything from identifying geographic expansion opportunities and defining partner strategy to acquiring new customers and leading a team for years to come.\n\nYou will be the leader of our launch team, as the people directly responsible for the development and growth of our parcels. You must have a natural aptitude for blending creativity and analytics to devise innovative solutions to complex logistical problems, the capacity to lead and influence teams, and the operational prowess to get stuff done. If this sounds like you – read on!\n\nABOUT THE ROLE\n• Consistently innovate and execute on unique strategies to acquire and partner the biggest retail stores network, online stores, and logistic companies.\n• Generate new business by exploring growth opportunities with new and current partners and other verticals.\n• You will target, identify, and approach the best online stores, local retail chain to integrate with PostCo as well as negotiating larger enterprise sales deals\n• Create and execute the strategy that introduces tens of millions of consumers to collect, send or return their parcels through our locations\n• Find the best channels for recruiting thousands of retail stores\n• Hit aggressive consumer and driver acquisition targets on time and on budget\n• Execute integrated marketing programs from strategy and concept through to production and delivery\n• Work closely with our local teams to run experiments, surface insights and develop a strategy to grow their markets\n• Hire, coach and mentor a team; while rolling-up your sleeves to contribute wherever necessary", "requirements": "• You crave responsibility and want to shape the vision and direction of the company.\n• You lead through vision, and by example\n• You love winning and love the hard work required to win in a competitive space just as much\n• You build great teams by recruiting and mentoring talent\n• You earn the trust of leaders inside and outside your org\n• Servant Leader - you pride yourself on leading by example\n• You’re an owner - driven, focused, and quick to take ownership of your work\n\nQualifications\n• Minimum 2 - 3 years in a management position\n• Excellent communication and interpersonal skills\n• Have a startup background (From Grab, Sendo, Tiki, Goviet, etc. - e-commerce platform)\n• Experience \bin partnerships with the retail network, online stores, and logistics.", "required_skills": ["interpersonal skill", "recruiting", "management"]}