{"title": "Frontend ReactJS Developer", "description": "One of the keys to staying competitive in the global app market is our prized developers. They are not just coders. They are also thinkers and solution architects. In order for us to continue providing the best experience for our ever-growing user base, we are looking for a Front-end ReactJS Developer to work with our team to maintain and further develop our products.\n\n- Be part of the growing development team in building innovative platforms in FinTech, HRTech, PropTech, IoT, and blockchain technologies.\n- Translate our visual & interaction designs into high-quality codes\n- Develop administrative web applications using ReactJs.\n- Work with API endpoints for dynamic content updating.\n- Ensure UI/UX of developed pages have near pixel-perfect design.\n- Develop and optimize front-end UI to ensure the application is rendered consistently in cross-browser environments.\n- Build & optimize reusable UI components so that they can be reused across our products.\n- Eager to learn new technologies with self-effort.\n\nOur goal has always been to create a seamless experience between human and computer. And because of that, we continuously incorporate the latest advancement in web technologies and expand the scope of user interface. Some of the latest additions are conversational UI, Progressive Web App, and Accelerated Mobile Page. As the system is growing rapidly while accommodating new scalable technologies, the position is best suitable for people who want to operate at the next level in their career.", "requirements": "- Experience with React.Js with Redux/Flux for at least 1 years.\n- Working experience at least 1.5 year\n- Have strong HTML5 skills. Should be able to use appropriate hooks in XHTML to limit the amount of classes and ID’s required on a page.\n- Have strong basics of Javascript. \n- Have good understanding of CSS/CSS3 inheritance and how to use it to your advantage.\n- Have expertise in at least one CSS Preprocessors (LESS/SASS). \n- Have good understanding of responsive principles and have done at least 2 excellent responsive solutions with mobile-to-desktop approach from single codebase. \n- Have knowledge of JS module system. \n- Good in Git version control system. \n- You have familiarity with RESTful APIs \n- You have knowledge of modern authorization mechanisms, such as JSON Web Token.\n- Bonus skills: Redux, React Native.\n- Passionate about building products with high quality and rich front-end experiences for our users.\n- Willing to learn and research new technology or jump out of your comfort zone.\n- Passionate about quality and the design of the code, productivity of the work and maintainability of the end result.", "required_skills": ["le", "json", "responsive", "css3", "html5", "css", "flux", "css preprocessors", "class", "xhtml", "javascript", "git", "redux", "restful", "desktop", "react native"]}