{"title": "Social Media Director", "description": "The Anti-Fragility Health Clinic (AFHC) delivers progressive strategies that enable patients to identify, treat and resolve the root cause of their physical ailments. Grounded in the science of Functional and Anti-Fragility Medicine, AFHC utilizes proprietary algorithms to gain an objective assessment of current health status and prescribes scientifically based targeted treatments to promote healing, alleviation of symptoms and disease and ultimately, health quality of high performance and resilience. \n\nAFHC is looking for a Social Media Director to design, develop, deliver and deploy multi-channeled social media marketing strategies to drive explosive awareness of AFHC brand. This position will collaborate across marketing channels and departments to produce exciting and engaging campaign media (stories, graphics, images and video) content for use across all AFHC platforms. \n\nThis is an opportunity to participate and develop an area of growth for the business. Strong communication, computer skills and analytical skills as well as relationship building are key for success in this position.\n\n● Design, develop, deliver, and deploy merchandising strategies multi-channeled social media marketing strategies to drive brand awareness and online reputation. \n● Develop a pipeline of consistently social engaging content that reflects the business brand voice, resonates with target audiences, and reinforce key messages. \n● Manage and grow all social media properties, including social media sites, websites, email lists, streaming platforms, and more. \n● Identify and target key demographic groups, stay abreast of trends and new media opportunities. \n● Plan, create captivating social media posts and calendars. \n● Plan, create and manage social media ads, boosted posts, budget and track results \n● Monitor online activities and conversations. \n● Grow followers, page likes, engagement, conversion rates. \n● Collect and monitor digital growth data and digital highlights to create weekly or monthly reports. \n● Research and evaluate new and emerging platforms to determine best use. \n● Lead in resolving any social media issues. Responsible for timely resolution of issues and status communication. \n● Manage or oversee all social advertising campaigns", "requirements": "● At least 4 years of related working experience \n● A high level of integrity, accuracy, dependability, enthusiasm, and confidentiality.\n● Strong computer skills and in depth knowledge with Microsoft Excel, Word, Power Point, and Shopify.\n● Excellent verbal and written communication skills.\n● Ability to work in a multi-tasking, fast paced environment.\n● Knowledge of current media advertising landscape and marketing environment", "required_skills": ["microsoft", "written communication skill", "excel", "marketing", "written communication", "dependability", "communication skill", "microsoft excel", "medium"]}