{"title": "Backend NodeJS Developer", "description": "One of the keys to staying competitive in the global app market is our prized developers. They are not just coders. They are also thinkers and solution architects. In order for us to continue providing the best experience for our ever-growing user base, we are looking for a Back-end Node.JS Developer to work with our team to maintain and further develop our products.\n\n- Be part of the growing development team in building innovative platforms in FinTech, HRTech, PropTech, IoT, and blockchain technologies.\n- Analyze product requirements with the team to help design system architecture.\n- Build REST APIs using PHP, NodeJS.\n- Write and perform unit tests for your work.\n- Develop low-latency, high-availability, scalability and security for web services.\n- Participate in our entire product life cycle, implement server-side logic and data structure following Specification document.\n- Collaborate effectively with other technology teams to solve complex issues spanning their respective areas.\n- Take part in system architecture and database design.\n- Gather and address technical and design requirements.\n- Write clean code to develop functional Restful APIs.\n", "requirements": "- 2+ years of experience in building web back-end solutions.\n- Working knowledge in MongoDB, mySQL or other databases.\n- Working knowledge of REST API design.\n- Experienced in designing patterns and OOP.\n- Experienced in backend NodeJS framework and PHP\n- Working experience in Linux environment.\n- Experienced in using Amazon Web Service or Google Cloud Platform.\n- Good command of source code management such as Git/SVN.\n- Experienced in Docker.\n- Knowledge or hand-on experience in any JavaScript frameworks (Jquery, ReactJS, VueJS, AngularJS, Angular 2+) would be an advantage.\n- Startup mentality: self-starter, proactive, flexible.\n- Customer centric mindset and lean approach will be highly valuable.\n\n", "required_skills": ["lean", "git", "javascript", "javascript framework", "google cloud", "angularjs", "cloud", "reactjs", "angular", "google cloud platform", "svn", "php", "rest", "mysql", "linux", "jquery", "database", "management", "oop", "docker", "vuejs", "mongodb"]}