{"title": "HR Consultant & Operation", "description": "Recruitery is Vietnam’s leading talent referral-based platform for employers that are proactive about approaching the best talent through referrals. Recruitery allows companies to unleash the power of networks through one single platform.\n\nIn just 7 months, over 200 companies use Recruitery to assist their talent acquisition efforts. Over 2,000 headhunters have registered on the platform.\n\nIn order for us to continue providing the best experience for our ever-growing user and customer base, we are looking for an HR Consultant who helps us take good care of companies and recruiters/headhunters. \n\n- Keep employers and recruiters informed at all times and provide answers to any questions regarding Recruitery. Helping collaboration between companies and recruiters to achieve placements.\n- Build sustainable relationships of trust with employers and recruiters through open and interactive communication\n- Handle complaints, provide appropriate solutions and alternatives within the time limits and follow up to ensure resolution\n- Keep records of customer interactions, process customer accounts, and file legal documents\n- Go the extra mile to engage customers during the use of Recruitery platform \n- Remind employers of updating interview results and consult them to help attract more referrals\n- Receive and resolve inquiries from recruiters/headhunters\n- Support candidates referred from Recruitery during the interview process until the end of their probation\n- Support in screening and assessing candidates’ capacity (especially for IT candidates)", "requirements": "- At least 1.5 years of related working experience (having recruitment background is a good).\n- Not hiring the candidate who has solid experience with traditional companies.\n- Technology mindset.\n- Must have a friendly voice as you will be answering calls\n- Proficient with Microsoft Office Suite and G-Suite\n- Back-office experience.\n- Able to communicate with clients in English (speaking & writing)\n- Able to keep track of the Customer Service requests.\n- Great communication and documentation skills required.\n\n\nPERSONAL QUALITIES:\n- Teamwork eagerness.\n- Good communication both inside and outside the team.\n- Responsibility, self-motivation, independence.\n- Ability to meet goals on time with less supervision\n- Ability to work under pressure\n- Be comfortable wearing many hats as we adapt to meet our audience’s needs\n- Startup mentality: self-starter, proactive, flexible.\n- Customer-centric mindset and lean approach will be highly valuable.\n- \"Can-do\" attitude.", "required_skills": ["le", "microsoft", "lean", "teamwork", "recruitment"]}