{"title": "Content Marketer", "description": "Recruitery is Vietnam’s leading talent referral-based platform for employers that are proactive about approaching the best talent through referrals. Recruitery allows companies to unleash the power of networks through one single platform.\n\nIn just 7 months, over 200 companies use Recruitery to assist their talent acquisition efforts. Over 2,000 headhunters have registered on the platform.\n\nIn order for us to continue providing the best experience for our ever-growing user and customer base, we are looking for a Content Writer who helps us build loyalty with employers/recruiters through creative social engagement.\n\n1. Content Planning (20%):\n-\tWork with the team to survey recruiters, learn the preferences of our existing audience, and help develop new audiences\n-\tUse insights gleaned from studying our audience to take a leading role in strategizing how we shape the thought leadership to energize existing tribe and attract new recruiters\n-\tPlan content timeline & frequency of posting content on different channels (Facebook, Linkedin)\n-\tPlan keywords that target the goals you want to achieve (e.g., a visitor clicks a link; an audience engages; a visitor opens an email, etc.)\n-\tCollaborate with the team to effectively promote Recruitery’s other products, including its service and its events,...\n\n2. Execution (80%):\n-\tGenerate distinctive story ideas by developing a deep network of sources and knowing where to look for data that identifies future of workplace\n-\tSocial Digital: write content for forum seeding, Facebook, Linkedin (Linkedin is the key channel)\n-\tRunning post ads (Facebook: boost post; Google: backlink for SEO)\n-\tWrite PR articles\n-\tOversee weekday email editorial operations, including experimenting with new content, editing stories, engaging and communicating with recruiters, and maintaining a stable of freelancers\n-\tProduce a mix of fast-turning and longer, more deeply reported pieces that help our recruiters/headhunters understand market changes and make smarter decisions\n", "requirements": "** Please submit a resume and at least 2 samples of your best written or edited work.  **\n-\tBorn from 1996-1990\n-\tAt least 1.5 years of content writing experience\n-\tMust have a personal blog \n-\tA creative and data-driven approach to storytelling\n-\tA demonstrated ability to identify shifts in business and technology and write stories that inform and delight a highly educated audience\n-\tAbility to deliver clean copy under daily deadline pressure\n-\tExperience writing short- and long-form content\n-\tExperience gathering and interpreting data from a variety of sources\n-\tEnglish writing well\n-\tAbility to use Microsoft Office and G-Suite \n-\tExperience using image editing software (Photoshop, Illustrator)\n-\tExperience using video editing software, making WEB, other management software\n-\tBe comfortable wearing many hats as we adapt to meet our audience’s needs\n-\tBe willing to work at weekends, to meet our production schedule\n-\tStartup mentality: self-starter, proactive, flexible.\n-\tCustomer-centric mindset and lean approach will be highly valuable.\n\n", "required_skills": ["microsoft", "management", "lean"]}