{"title": "Senior Cloud Devops Engineer", "description": "We are searching for a Cloud Engineer with DevOps responsibility to our global Tech team. You’ll be part of a Tech team, that are growing into supporting business all over the world and thinking globally. Primary responsibilities include monitoring that operations run smooth and ensure our technical architecture is sound, solid and safe. Our infrastructure, that is already global and build to auto scale via cloud services, is running on +100 servers and storing more than 100 TB of live data, mainly pictures and video.\nYou’ll be working in an international environment as we have development teams in Denmark and Vietnam, with developers from several countries. Your primary work place will be in Hanoi, Vietnam, but a few trips to our offices around the world must be expected. The primary working language is English. You have several years of experience as a DevOps and possibly also experience of dealing with the challenges of software development.", "requirements": "- You are structured, responsible and have a good understanding of when the systems you run, delivers the needed service to the business requirements.\n- We expect you to focus on quality, keeping it simple and scalable. You are the type of person who likes planning and implementing new technologies/services/microservices and you put pride in keeping a high service level.\n* TECHNOLOGIES:\nWe work with a wide range of exciting technologies and expect you to have worked with some of these in the past.\n** Most important technologies:\n- Advanced Linux Administration (Ubuntu)\n- Amazon Web Services (primarily EC2, S3, Cloudformation, Cloudfront, ECS, Lamda, RDS, CloudWatch)\n- Configuration management tools: Ansible, Puppet, Chef (prefer: Ansible)\n- Infrastructure as Code: AWS Cloudformation, Packer (prefer: AWS Cloudformation)\n- CI/CD Tools: Jenkins, TeamCity, Bamboo (prefer: Jenkins)\n- Experienced with at least one of RDBMS (prefer: MySQL, Microsoft SQL Server)\n- Experienced with at least one of monitoring tools (prefer: Zabbix, CloudWatch)\n\n* Less important/nice to know technologies:\n- Virtualization: VMware, KVM\n- ERP System: Dynamics AX 2012\n- Window Admin skill", "required_skills": ["virtualizations", "microsoft sql server", "cloudwatch", "cloudformation", "microsoft", "ecs", "bamboo", "ubuntu", "administration", "chef", "management tool", "puppet", "kvm", "aws cloudformation", "linux administration", "jenkins", "virtualization technology", "mysql", "linux", "sql", "virtualization", "ansible", "erp system", "configuration management tool", "business requirement", "le", "zabbix", "management", "configuration management", "microservices", "aws", "teamcity"]}