{"title": "Coffee Trader and Sales South East Asia", "description": "- Coffee Trader & Sales South East Asia\n\nThis includes amongst others: \n-\tUnderstand pricing of different coffees (origins & qualities) around the world\n-\tMaintain excellent relationship with our customers in SAE, understand their needs and find sales opportunities.\n-\tUnderstand and apply correct cost calculations and convergence between different qualities for each customer.\n-\tFind new customers and double our sales in the SAE region\n-\tCoordinate daily prices of Vietnam and Indonesia with our sales offices in Amsterdam and NYC. \n-\tContribute and execute trading strategy\n-\tEnsure proper risk management with customers, forex and market exposures\n-\tDeliver on local Sales & Marketing targets (client coverage, profitability, volume, services etc)\n", "requirements": "Qualifications\n- Good understanding of Asian Culture, and besides English speaking Vietnamese and/or Chinese\n- Coffee or Commodity background \n\nEducation & Experience \n- University (degree) \n- Min 5 years in Trading or Commercial role in Coffee or Commodities\n- Proven record of independent building of business and relationships\n- Experience in dealing with international logistics and related costings and risks \n\nPersonal skills\n- Global understanding and mindset\n- Independency \n- Advance leadership skills, excellent communication and ability to clarify/put across a point, relationship management-internal as well as external\n- Impeccable sense of Ethics\n- Entrepreneurial spirit and good commercial sense\n- Strong organizational skills in structure, account, risk management and control\n- Good motivational and conflict resolution skills across the cultural spectrum\n- Disciplined approach to adhering to guidelines, objectives and changes assumptions\n- Quantitatively and analytically motivated and astute\n\n", "required_skills": ["structure", "relationship management", "commodities", "management", "risks", "clarify", "conflict resolution", "risk management", "leadership skill"]}