{"title": "Senior Research/Data Analyst", "description": "This position requires analytical and agronomical skills in driving the business by providing adequate and timely support to commercial / trading team in coordination with field / agronomist team. You will be responsible for building BS (Balance Sheet) based on Supply, Demand and Stock analyses. Today data is obtained both in house as from third parties, but the company wants to have more in house and consistency of data and its analyses.\n\n*Responsibilities in Agronomical Research\n- Implementation of agreed Research Methodology for coffee crop estimation.\n- Contribution to the development of the research methodology and strategy. Continuous review of the methodology being applied in view of observations made during crop tours.\n- Plan, participate and travel extensively across provinces or to other countries for carrying out surveys with farmers, stock holders, Government offices to collect primary and secondary data, soil and plant samples, knowledge enhancement and for any other requirements as and when required by the Company.\n- Surveys:\n• Crop surveys: 4 times a year in January, March/April, June/July and September/October in Vietnam, 1 in Indonesia and 1 in India. To be carried out by ensuring a) high quality farmer interviews and b) visual yield estimation. Also, need based telephonic and mini surveys to be carried out.\n• Stock surveys: Telephonic surveys to be done during the last week of every month. Physical verification of stocks by visiting the stock holders to be carried out 3 times a year during February/March, April/May and September and as per the requirement.\n- During such surveys, diligently collect high quality information from the sources and evaluate the accuracy of all the data that will enable accurate crop estimation.\n- Be updated on the happenings and changes in weather, crop development (weather impact, sudden spurt pests and diseases, impact of input costs, price impact on crop, etc.), market situations, market rumors etc.\n\n*Responsibilities in Analytical part\n- Coordinating the coffee R&A desk in HCMC with as focus the global coffee market: production, consumption, trade flows, stocks, market trends etc.\n- Lead the collecting, compiling, storing, analyzing, comparing of coffee market data within Sucden Coffee.\n- Responsible for R&A communication, a.o. monthly global supply & demand, stocks & inventories updates, crop forecasts, weather developments, etc.\n- Close collaboration with Sucden's global network: commercial desks, geographical teams, representatives, customers etc.\n- Participating actively in statistics and trade meetings, i.e. contributing to the teams thought process and decision making.\n- Execution of special / specific research projects\n- Periodical evaluation of the quality of data providers and explore alternatives\n- Support the development of (coffee) data systems and architecture, developing SQL system fed with (coffee) supply & demand, trade stats and market data.\n- Contributing to Sucden publications, client presentations, speeches at seminars etc.\n- Some short and medium terms desk objectives:\n- Building up a solid in-house database on (green) coffee, approaching or even exceeding the quality supplied by TRS or CCS\n- Create a uniform approach to crop forecasting across all our origins in terms of methodology\n- In house forecasting of trends, coffee flows, market developments etc that help shaping our strategy, plans etc for Amsterdam/New York", "requirements": "*Qualifications\n- Preferably Vietnamese, but fluent in English\n- Analyst background\n- Willing to travel upcountry and abroad extensively\n\n*Education & Experience\n- University (degree)\n- Min 5 years working as Analyst\n- Experience in agronomy and farmer areas\n\n*Personal skills\n- Global understanding and mindset\n- Highly quantitatively and analytically motivated and astute\n- Strong organizational skills in structure\n- Independent and able to work and deliver on your own\n- Impeccable sense of Ethics", "required_skills": ["structure", "analyst"]}