{"title": "Senior Technical Product Manager", "description": "As Senior Technical Product Manager, you will oversee the design and deployment of a world-class, global infrastructure to support site growth and promote a highly available and resilient application environment.\n\n- Manage a broad portfolio of technologies, platforms, and services.\n- Assess, drive and support performant, secure, and resilient global infrastructure.\n- Define and manage the technical product roadmap and associated requirements for feature implementations, upgrades, and enhancements.\n- Champion efforts to standardize processes, technologies, and automate routine tasks.\n- Help drive engineering priorities which ensure continued responsiveness and operational stability of the application environment.\n- Develop key relationships with third-party vendors, track product development roadmaps, and influence technical direction to support internal objectives.\n- Communicate project status, track milestones, and gather stakeholder feedback.\n- Ensure meaningful KPIs are in place and deliver on them.\n- Monitor system performance, conduct capacity planning, and proactively assess and recommend improvements.\n- Actively participate in emerging technology research and evaluation to support the Company business goals\n- Participate in knowledge transfer sessions and process improvement discussions to disseminate current information regarding strategies and business needs.", "requirements": "- Analytical approach to problem-solving with a focus on efficient and timely solutions.\n- Experience negotiating technical scope and dependencies.\n- Solid understanding of system integrations and workflow dependencies.\n- Understanding of cloud infrastructure technologies and platforms (AWS, Azure).\n- Knowledge of application/infrastructure performance monitoring tools (CloudWatch, Nagios, Jmeter, JProfiler).\n- Extensive background in agile development methodologies and scrum planning tools.\n- Basic knowledge of SQL.\n- A good communicator, presenter, and collaborator with both internal and external stakeholders.\n- Proven ability to operate successfully across multiple functions, influence colleagues at all levels, and mediate among multiple stakeholder groups with varying priorities and needs.\n- 4-5 years of product management, consulting, or development experience.\n- Proficiency in English (Listening, Speaking, Writing, Reading).", "required_skills": ["product management", "cloudwatch", "management", "agile", "scrum planning", "aws", "agile development methodology", "nagios", "sql", "cloud", "problem solving", "cloud infrastructure", "management consulting", "workflow", "azure"]}