{"title": "Product Analyst (Middle)", "description": "- Be the owner of an end-to-end product development cycle (Build, Measure, Learn)\n- Research: Understand and lead user/market/competitive analysis to scope out the right features to build\n- Ship: Work with Engineering, Design, & Marketing team to ship the final features and products, clearly communicate product benefits to users and internal stakeholders\n- Monitor: Manage product backlog and prioritize important features, define and measure product success metrics\n- Engage: Gather customer/prospect/market feedback\n- Strategy: Understand the market landscape and able to define the team's roadmap\n- Leadership: own the products/features you build, become a decision-maker, eager to learn and inspire other team members", "requirements": "- Strong Product / Problem Solving / Analytical / Marketing / UX / Insight-driven mindset\n- Strong research skill, have basic knowledge about Database, BI and Programming\n- Have background/skills on one of the following fields: Engineering, UX, Data, Marketing or Product\n- Experience in building/running web products is a plus\n- Eager to learn and grow\n- Like to work in Global Tech Product Company environment\n- Good English writing and communication skills\n\n---------------\n[MUST HAVE] Please attach your answer sheet for below questions when you send us your resume\n1.  Why do you choose this role and what make you fit it?\n2. What do you like about Holistics?\n3. What have you achieved last year?\n4. What is your plan in the next few years?\n5. What are the products you built or participated in? (Please also give links to your products and describe it)\n6. Do you write? If yes, please list your blog posts here\n7. What are the top 5 favorite books you read about product or startup? \n8. What do you expect from a new environment like Holistisc?\n9.  Pitch the best idea that your ever have (optional)", "required_skills": ["marketing", "communication skill", "problem solving", "holistics", "database"]}