{"title": "Data Scientist - Managers and Directors", "description": "- Build, validate, and maintain Operations Research (OR) and/or AI( Machine Learning (ML) /Deep learning), models using our in-house solution - H2O AI.\n- Provide quantitative research and analysis for identifying new business opportunities\n- Provide thought leadership in analytics and modeling\n- Synthesize findings, prepare presentations and assist in presenting findings to all levels of management \n- Provide framework/methodology for measurement and feedback mechanism for models\n- Manage analytical projects/initiatives of complex scale \n- Provide thought the leadership on methodologies and analytical roadmaps\n- Ability to mentor data scientists and interns\n- Collaborate within the team and outside the team to solve complex problems", "requirements": "Who you are generally\n- Proven experience in areas of optimization, statistics, machine learning, and big data technologies\n- Proven ability to develop and apply analytic solutions to solve business problems\n- Ability to work both at a detail level as well as to summarize findings and extrapolate knowledge to make strong recommendations for change\n- Experience developing short and long term visions for solutions that have significant business impact\n- Demonstrated examples of working with business partners to deliver a solution that met objectives\n- Knowledge of inventory management, merchandising, pricing, supply chain management, and optimization principles and concepts\n- Experience developing and working with inventory optimization and/or forecasting approaches for retail software or the retail industry \n- Ability to collaborate with cross-functional teams and influence product and analytics roadmap\n- Masters in Operations Research, Statistics, Math, Computer Science, Industrial Engineering or related field. PhD is a plus. \n- 3+ yrs. of professional experience w/PhD, 5+ yrs. without PhD\n- Hands-on experience with data analysis, statistical, optimization and simulation packages (SQL, Python, Tensorflow, etc) \n- Experience working for retailers, consulting to retailers is highly desirable \n- Ability to communicate effectively with cross-functional teams \n- Experienced at working with business process owners to understand the process impact \n\n\nThe Ideal Candidate - Who you are and what you need to have \n- MSc or Ph.D. in a quantitative discipline: Computer Science, Statistics, Applied Mathematics, Operations Research, Engineering, Analytics;\n- Data Science, Analytics, Business Intelligence and/or Data Engineering background with 7+ years experience;\n- A strong leader, coach and manager, with a proven track record in attracting, recruiting, managing and developing outstanding talent\n- Proven experience in building business value through the strategic and innovative use of data\n- Experience with identifying the best metrics (both business and technical) for monitoring live machine learning services.\n- Ability to develop experimental and analytic plans for data modeling processes, use of strong baselines, ability to accurately determine cause and effect relations;\n- Ability to review production level code in Python;\n- Passion for big data technologies (e.g. Spark, Kafka, Presto, Snowflake, BigQuery, Hadoop, Hive, Azure/GCP, Looker, Tableau);\n- Practical understanding and hands-on experience with machine learning, supervised learning methods (linear and logistic regression, decision trees, random forests, boosting methods, graphical models, neural networks/deep learning, etc), NLP and Computer Vision methods (word embeddings, BERT, ResNet, etc), Mathematical optimization (mixed integer programming, linear programming, stochastic programming/optimization, etc.), Modelling and simulation (Monte Carlo methods, Markov Chains, Markov Decision Processes, etc.);\n- Conversant across the latest approaches, best practices and technologies, and how they can be used to drive commercial value\n- Combination of deep technical skills and business savvy enough to interface with all levels and disciplines within our organization;\n- You thrive and have demonstrated success in an environment which offers ambiguously defined problems, big challenges, and quick changes.\n- An expert in balancing detailed execution with speed and possess solid collaborative skills across all levels.\n- Proven in building business value through the strategic and innovative use of data ", "required_skills": ["analytics", "data science analytics", "tensorflow", "data modeling", "analysis", "deep learning", "supervised learning", "azure", "markov chain", "resnet", "monte carlo methods", "regression", "snowflake", "inventory management", "industrial engineering", "python", "supply chain", "markov", "data analytics", "tableau", "supply chain management", "machine learning", "business intelligence", "boosting", "applied mathematics", "process modeling", "recruiting", "kafka", "sql", "decision tree", "neural network", "random forest", "data analysis", "math", "computer vision", "management", "hadoop", "bigquery"]}