{"skills": ["docker", "cryptocurrency", "javascript", "ams", "management", "redux", "banking", "security", "kubernetes", "frontend development", "git", "svn", "structure", "analysis", "firebase", "react native", "ionic", "redux thunk", "css", "jira", "github", "bug fixing", "reactjs", "networking", "bitbucket", "html"], "fulltext": "Nguyen Duy Khanh\nHanoi, Vietnam\n (+84)363642295  duykhanh1310@gmail.com  Skype: silvercoe_oct13\nNanyang Technology University\nMay 2014 - May 2016\nHanoi University of Business and Technology\nSep 2010 - Apr 2014\nEDUCATION\nMajor: Computer Science\nMajor: Business English\nMiyatsu\nSept 2018 - Nov 2018\nEvolable Asia Solutions\nMar 2018 - Sept 2018\nEuroland Investor Asia\nSept 2016 - Mar 2018\nWORK EXPERIENCE\nReact-native developer\n- I currently fix existing bugs, recommend solutions for team, adding new features and researching new\ntechnology.\n- This is my first time approaching with block-chain technology and I am really impressed by the benefits and\npotential it brings to our world. Additionally, applying it to the React-native app is not so complex than I\nthought.\nReact-native developer\n- Growth from Euroland Asia, I was trained tough to be responsible for higher responsibilities. At Evolable\nAsia Solutions, I lead a react-native team and work directly with Japanese customers. My mission is to\ncommunicate with customer, offer the best solution for their project, reading and writing spec documents,\nbuilding project structure, assign task to team member and work closely together to deliver the product on time\nwith minimum effort and bugs.\nReact-native developer\n- In Euroland Investor, we provide software solutions for investors. As a front-end developer, I contributed to\nthe development of myIRapp which is react-native mobile application allowing investors understand\nthoroughly about the company's performance and help them don't miss important information.\n- I was lucky to work with a smart mobile team in which I learned a lot of things from them from coding clean,\nanalyze spec, applying base programming skill to solving any problems. We initially developed myIRapp with\nthe ionic framework, then my leader decided to transfer to react-native due to the performance differences\nbetween the 2 frameworks. Our 5 people learned fast to apply react-native to our current ionic application. It\nhad been a tough time for us because react-native is totally different, especially Redux part. Ultimately, we\ncontrolled the React ecosystem and re-organized, developed the myIRApp successfully.\nIELTS Certificate with score 7.5 issued by British Council\n2014\nCERTIFICATIONS\nPROJECTS\nInvestor Relations app\n(2016 - 2018)\nCustomer\nVarious, mainly in Europe, China\nDescription\nWe initially developed myIRapp with the ionic framework, then my leader decided\nto transfer to react-native due to the performance differences between the 2\nframeworks. Our 5 people learned fast to apply react-native to our current ionic\napplication. It had been a tough time for us because react-native is totally different,\nespecially Redux part. Ultimately, we controlled the React ecosystem and re-\norganized, developed the myIRApp successfully.\nTeam size\n6\nMy position\nDeveloper\nMy responsibilities\n- Analysis and design\n- Development\n- Review code\n- Optimize code\n- Bug Fixing\nTechnologies used\n- React-native\n- Redux\n- SVN\nMY BODY MAKE\n(3-2018 - 5-2018)\nCustomer Japanese\nDescription\n- Complete solution for woman gaining their ideal body. Beautiful body, beautiful\nlife- My body make is an existed app, I joined to project to re-construct app's folder\nstructure, re-constructed redux structure, refactored code, built new modules and\nleaded team.\nTeam size\n3\nMy position\nDeveloper\nMy responsibilities\nTeam lead, React-native developer, Communication with customer\nTechnologies used\n- React-native, \n- Redux, \n- Redux-Observable\n- Redux-thunk\n- Git, Bitbucket\nBEESTAR WAREHOUSE APP\n(5-2018 - 6-2018)\nCustomer Japanese\nDescription\n- Cooperated with starX team from Japan, we helped them to build a warehouse\nmanagement application. I read and analyzed specs then built everything from the\nbeginning. Besides that, I lead my team to finish the project in minimum time and\neffort.\nTeam size\n3\nMy position\nDeveloper, Leader\nMy responsibilities\nTeam lead, React-native developer, Communication with customer\nTechnologies used\n- React-native, \n- Redux, \n- Redux-immutable\n- Git, Bitbucket\nMOREME\n(6-2018 - 8-2018)\nCustomer Japanese\nDescription\n- It is a mobile magazine for women who tell the selected \"best information\" every\nday in both Japanese and Korean languages.\nTeam size\n3\nMy position\nDeveloper, Leader\nMy responsibilities\nTeam lead, React-native developer, Communication with customer\nTechnologies used\n- React-native, \n- Redux, \n- Redux-immutable\n- Git, Bitbucket\nCAREER LADDER\n(6-2018 - 7-2018)\nCustomer\nFacebook Hackathon\nDescription\nA professional networking platform about career path in various fields\nTeam size\n10\nMy position\nDeveloper, Leader\nMy responsibilities\nI am the team leader working on the project as BA and front-end developer. I\ncooperated closely with other members, especially with video and back-end team\nto build the product. They are my best people, I've learned a lot of things from\nthem.\nTechnologies used\n- React-native, \n- Redux, \n- Redux-immutable\n- Git, Bitbuket\nSovereign Wallet\n(9-2018 - not done yet)\nCustomer Korean\nDescription\nMessenger-style cryptocurrency wallet with banking grade security.\nTeam size\n> 10\nMy position\nDeveloper\nMy responsibilities\n- Take advantage of block-chain technology to the React-native app. Fix existing\nbugs, improve performance and add more features. \n- Research block-chain world.\nTechnologies used\n- React-native, \n- Redux, \n- Redux-observable\n- Git, Github\n- Jira\n- Block-chain\n- Firebase\nSKILLS\nLanguage\nFluent English, conversational German, basic Japanese\nIT\nHTML, CSS, Javascript, React, Reactjs, React-native,  Redux, CI, CD,\nDocker, Kubernetes.\n© topcv.vn\nPowered by TCPDF (www.tcpdf.org)", "educations": [{"id": 4470, "gpa": null, "major": "Business English", "school": "Hanoi University of Business and Technology", "diploma": "Bachelors", "end_time": "2014-04-01T00:00:00Z", "conf_score": 0.8855279524477552, "start_time": "2010-09-01T00:00:00Z", "picklist_major": "Other", "major_categories": "", "major_categories_detail": ""}, {"id": 4469, "gpa": null, "major": "Khoa học máy tính", "school": "Nanyang Technology University", "diploma": "Bachelors", "end_time": "2016-05-01T00:00:00Z", "conf_score": 0.8855279524477552, "start_time": "2014-05-01T00:00:00Z", "picklist_major": "IT - Hardware/Networking", "major_categories": "Máy tính và công nghệ thông tin", "major_categories_detail": "Máy tính"}], "experiences": [{"id": 14890, "detail": "I currently fix existing bugs, recommend solutions for team, adding new features and researching new technology.\n- This is my first time approaching with block-chain technology and I am really impressed by the benefits and potential it brings to our world. Additionally, applying it to the React-native app is not so complex than I thought.", "company": "Miyatsu", "end_time": "2018-11-30T00:00:00Z", "industry": "Other", "position": "React - native developer", "conf_score": 0.8935398791813937, "start_time": "2018-09-01T00:00:00Z"}, {"id": 14891, "detail": "I lead a react-native team and work directly with Japanese customers. My mission is to communicate with customer, offer the best solution for their project, reading and writing spec documents, building project structure, assign task to team member and work closely together to deliver the product on time with minimum effort and bugs.", "company": "Evolable Asia Solutions", "end_time": "2018-09-30T00:00:00Z", "industry": "High Technology", "position": "React - native developer", "conf_score": 0.9078959845065918, "start_time": "2018-03-01T00:00:00Z"}, {"id": 14892, "detail": "In Euroland Investor, we provide software solutions for investors. As a front-end developer, I contributed to the development of myIRapp which is react-native mobile application allowing investors understand thoroughly about the company's performance and help them don't miss important information.\n- I was lucky to work with a smart mobile team in which I learned a lot of things from them from coding clean, analyze spec, applying base programming skill to solving any problems. We initially developed myIRapp with the ionic framework, then my leader decided to transfer to react-native due to the performance differences between the 2 frameworks. Our 5 people learned fast to apply react-native to our current ionic application. It had been a tough time for us because react-native is totally different, especially Redux part. Ultimately, we controlled the React ecosystem and re-organized, developed the myIRApp successfully.", "company": "Euroland Investor Asia", "end_time": "2018-03-31T00:00:00Z", "industry": "Real Estate", "position": "React - native developer", "conf_score": 0.9174119757898835, "start_time": "2016-09-01T00:00:00Z"}], "address": "Hanoi, Vietnam"}