{"skills": ["postman", "regression", "lead others", "payment", "task management", "automation", "development testing", "automation testing", "solution design", "selenium", "management", "rally", "studio", "gitlab", "project planning", "postgresql", "io", "critical thinking", "selenium ide", "basecamp", "scrum master", "git", "svn", "regression testing", "structure", "tester", "project management", "rail", "project execution", "ruby", "mysql", "medium", "functional testing", "android", "trello", "maintenance", "system testing", "sql", "integration testing", "jira", "github", "regression test", "lateral thinking", "software development", "making decision", "testing", "microsoft", "quality assurance", "mysql workbench", "clarify", "window phone", "process development", "sql query", "teamwork", "redmine", "problem solving", "process management", "workbench", "google map"], "fulltext": "HANG HOANG THI \nAddress: 22 Truc Street, Ward 13th, Binh Thanh Dist. HCMC \nSUMMARY \nI work in IT industry with 5 years of experience as a quality assurance and quality control \nengineer. Excellent at quickly identifying \nhigh level test strategies and problems. Excellent at teamwork; effective communicator and \nproblem solver. \nI always love to get new challenges, learn new technologies. I also love working with different \npeople style. \nACCOMPLISHMENTS  \n● Joined more than 30 projects as main QA/QC role. \n● Have knowledge about: e-commerce, management system, task management, school \nmanagement, media, ... \nSKILLS \n● Good at using management and reporting tools, like Jira, Gitlab, Github, Git, Redmine, Trello, \nBasecamp, Pivotal Tracker, SVN. \n● Good at using development tools, like Firebug, Chrome Development Tools, Postman. \n● Good at communication, problem-solving, decision making \n● Strong research skill. \n● Strong creative skill. \n● Able to prioritize tasks and workloads in order of importance. \n● Able to track record of delivering results with deadlines. \n● Able to work under high pressure and tight deadlines, in a team or independently. \n● Able to train and lead others in a team environment. \n● Expert about software development & testing process. \n● Expert at using Microsoft Office, Open office, Google Drive. \nEXTRA INFORMATION \n● Automation Testing beginner with Selenium, Selenium IDE \n● Basic SQL Queries for PostgreSQL (using pgAdmin), MySQL (using MySQL Workbench). \nWORK EXPERIENCES \nCHO TOT \nQA Specialist \n03/2016 - 08/2018 \nThe largest Online Classified site in Viet Nam. \nPlatforms: Website, Mobile web, Android Application, iOS Application, Window Phone Application. \nAssisted with the development of Quality Assurance Department. \nResearched and applied new tools and technologies that could be used by the quality assurance \nteam. \nCoordinated with systems partners to finalize designs and confirm requirements. \nProvided continued maintenance and development of bug fixes and patch sets for existing \napplications. \nConsistently meet deadlines and requirements for all production work orders. \nAligned office departments and increased inter-department communication and data sharing. \nRecommended architectural improvements, design solutions and integration solutions. \nTraining and mentor other QA staff members of the software Quality Assurance organisation. \nProject \nCho Tot -- Chotot.com \nDescription - The largest C2C online marketplace in Vietnam with the mission to help everyone \nfind a way to any of their wants. \nHDViet JSC - FIM Plus \nDigital JSC \nQA Specialist \n07/2015 - 02/2016 \nThe first project in Viet Nam provide internationally movies. \nPlatforms: Website, Mobile web, Android Application, iOS Application, Box Applications, TV \nApplications. \nPlan and execute testing efforts on assigned projects working closely with test team, stakeholders, \nprogrammers, project managers \nand/or Scrum Masters. \nProvide critical feedback to QA Project Leads and Managers after QA Audit to improve on QA \nprocesses. \nPro-actively identify and drive quality improvement through process development and \nimprovement, and other quality \nmethodology. \nExecute functional testing, integration testing, system testing, and regression testing… on relevant \nprojects. \nDevelops a list of items to include on the regression test, execute the test and analyze the results. \nProvided training to new team member that enhanced overall productivity. \nProjects \nHDViet -- http://movies.hdviet.com \nDescription: Free online movies Full HD \nmHDViet -- http://mhdviet.vn \nDescription: Mobifone Application – Online movies Full HD – free 3G Mobifone \nCAS -- http://id.hdviet.com \nDescription: HDViet’s one port for payment \nFIM+ -- https://movies.fimplus.vn \nDescription: Hollywood of you. Copyright online movies Full HD \nAnd more … \nNUS Technology \nQA Specialist \n08/2013 - 06//2015 \nSoftware outsourcing service for US and Europe markets. \nPlatforms: Website, Mobile web, Android Application, iOS Application. \nPlan, help to develop, and execute the overall Quality Control strategy. \nCreate and execute test cases whilst adhering to established software quality standards, in \ngeneral, for measuring software quality. \nEvaluated quality of assigned projects and products that will be delivered \nCommunicated major status of projects, QA personnel, and customer concerns, to the QA Manager \nin a timely manner \nHelp to develop some documents: Work Breakdown Structure (WBS), Feature List, Question List, \nStandard Specification Documents \nfor tester, Common Sense Rules... \nProjects \nI Live Yoga -- http://iliveyoga.com \nDescription: I Live Yoga is an online platform for the yoga community providing free tools to \nstudents, instructors, and studios. \nTechnologies: Ruby on Rails, PostgreSQL \nRally Navigator -- https://www.rallynavigator.com \nDescription: Rally Navigator streamlines the process of creating a route, printing a roadbook, and \ngetting you back to riding. Using \nthe power of Google Maps and your GPS, you can create, print, and share a Dakar-style roadbook. \n(also available in Enduro style). \nTechnologies: Ruby on Rails, PostgreSQL, Google Maps, GPS \nTubeTnr Music -- http://tubetnr.com \nDescription: TubeTnr is an online venue to share your talent with people from around the world. \nTechnologies: Ruby on Rails, PostgreSQL \nAmb3r -- http://www.amb3r.com \nDescription: AMB3R works with you to create the perfect garment that fits your budget, deadline, \nmessage and audience. \nTechnologies: Ruby on Rails, MySQL \nAnd more ... \nEDUCATION \nHanoi Open University \nVTC Academy. Learned Game 2D programing. June 2013 \nCERTIFICATION \nProject Management Professional Certification \n● Nature of projects and organization models for project management \n● Project Planning \n● Project Execution and Controlling \nCertified Critical Thinking and Problem Solving \n1. Critical Thinking \n● Understanding Critical Thinking \n● The Critical Thinking Process \n● A Critical Thinker's Skill Set \n● Critical and Creative Thought Systems \n2. The Systematic Problem Solving \nDefinitions, Principles and Overview: \n● Psychological type and Lateral Thinking for Problem Solving \n● Practice \n3. Leadership Development \nHelps leaders / potential leaders clarify challenges and strengthen their leadership abilities. \nINTERESTS \nEnjoy learning English to become a professional. \nDoing yoga, traveling to new places, learning new technologies about automation and reading \nbooks about management, process, \nscience. \nREFERENCES \nDANG NGUYEN HAI \nQA Lead at Cho Tot \ndangnh3287@gmail.com - 0935357942 \nKELVIN VUONG \nCTO at Cho Tot \nkelvinvuong@chotot.vn - 01227179976 \nPowered by TCPDF (www.tcpdf.org)", "educations": [{"id": 4472, "gpa": null, "major": "Game 2D programing", "school": "Hanoi Open University", "diploma": "Bachelors", "end_time": "2013-06-01T00:00:00Z", "conf_score": 0.7676631509437234, "start_time": null, "picklist_major": "Other", "major_categories": "", "major_categories_detail": ""}], "experiences": [{"id": 14893, "detail": "The largest Online Classified site in Viet Nam. Platforms: Website, Mobile web, Android Application, iOS Application, Window Phone Application. Assisted with the development of Quality Assurance Department. Researched and applied new tools and technologies that could be used by the quality assurance team.\nCoordinated with systems partners to finalize designs and confirm requirements.\nProvided continued maintenance and development of bug fixes and patch sets for existing applications.\nConsistently meet deadlines and requirements for all production work orders.\nAligned office departments and increased inter-department communication and data sharing.\nRecommended architectural improvements, design solutions and integration solutions.\nTraining and mentor other QA staff members of the software Quality Assurance organisation.\nProject Cho Tot -- Chotot.com Description - The largest C2C online marketplace in Vietnam with the mission to help everyone find a way to any of their wants.", "company": "CHO TOT", "end_time": "2018-08-31T00:00:00Z", "industry": "Other", "position": "QA Specialist", "conf_score": 0.8986425279419377, "start_time": "2016-03-01T00:00:00Z"}, {"id": 14898, "detail": "The first project in Viet Nam provide internationally movies.\nPlatforms: Website, Mobile web, Android Application, iOS Application, Box Applications, TV Applications. Plan and execute testing efforts on assigned projects working closely with test team, stakeholders, programmers, project managers and/or Scrum Masters. Provide critical feedback to QA Project Leads and Managers after QA Audit to improve on QA processes.\nPro-actively identify and drive quality improvement through process development and improvement, and other quality methodology.\nExecute functional testing, integration testing, system testing, and regression testing... on relevant projects.\nDevelops a list of items to include on the regression test, execute the test and analyze the results.\nProvided training to new team member that enhanced overall productivity.\nProjects Projects HDViet -- http://movies.hdviet.com\nDescription: Free online movies Full HD mHDViet -- http://mhdviet.vn\nDescription: Mobifone Application - Online movies Full HD - free 3G Mobifone CAS -- http://id.hdviet.com\nDescription: HDViet’s one port for payment", "company": "HDViet JSC - FIM Plus Digital JSC", "end_time": "2016-02-29T00:00:00Z", "industry": "High Technology", "position": "QA Specialist", "conf_score": 0.9082618729166169, "start_time": "2015-07-01T00:00:00Z"}, {"id": 14901, "detail": "Software outsourcing service for US and Europe markets.\nPlatforms: Website, Mobile web, Android Application, iOS Application. Plan, help to develop, and execute the overall Quality Control strategy.\nCreate and execute test cases whilst adhering to established software quality standards, in general, for measuring software quality.\nEvaluated quality of assigned projects and products that will be delivered\nCommunicated major status of projects, QA personnel, and customer concerns, to the QA Manager in a timely manner\nHelp to develop some documents: Work Breakdown Structure (WBS), Feature List, Question List, Standard Specification Documents for tester, Common Sense Rules... Projects I Live Yoga -- http://iliveyoga.com\nDescription: I Live Yoga is an online platform for the yoga community providing free tools to students, instructors, and studios.\nTechnologies: Ruby on Rails, PostgreSQL", "company": "NUS Technology", "end_time": "2015-06-30T00:00:00Z", "industry": "High Technology", "position": "QA Specialist", "conf_score": 0.8986425279419377, "start_time": "2013-08-01T00:00:00Z"}], "address": "22 Truc Street, Ward 13th, Binh Thanh Dist. Hcmc"}