{"skills": ["credential", "stack", "human machine interface", "system on chip", "java", "automation", "c++", "automation testing", "c#", "database management", "rational", "management", "studio", "ipc", "security", "administration", "automation test", "microcontroller", "git", "microsoft sql server", "ease", "database management system", "maintenance", "sql", "lifecycle", "integration testing", "nunit", "visual studio", "microsoft visual studio", "unit testing", "ibm", "software development", "testing", "microsoft", "senior management", "soc", "database", "jenkins", "hmi", "embedded application", "python", "perforce", "sqlite", "management information system", "full stack development"], "fulltext": "…Continued… \nThang Giang Nguyen \nSenior C/C++ Software Developer \nFull stack IT professional with extensive knowledge of C/C++ Software development \nSenior C/C++ Software Developer, with a proven ability to plan, administer, coordinate and execute full \nlifecycle Windows-based/ Embedded application design and development projects. Broad experience in \nC/C++ software programming and development, management, installation, maintenance, administration, \nsecurity, troubleshooting and technical support. Knowledge of diverse programming languages, \narchitectures, and platforms, with the ability to apply expertise in the successful completion of IT projects. \nOutstanding ability to gather and translate complex client requirements into practical, reliable, cost-\neffective software and system solutions. Proactive problem solver, developing software solutions with \ncareful consideration to bottom-line, long-range goals, quality, feasibility and ease of use. \nFull Lifecycle C/C++Development • Programming • Troubleshooting & Issue Resolution \n Application Development • Automotive Development • Global Team Player \nPROFESSIONAL EXPERIENCE \nLed full lifecycle development of automotive applications/ services at Vehicle Microcontroller (VuC) and \nSystem On Chip (SOC) for Continental Automotive Singapore, spreading on various modules: Audio, \nCommunication Box, Record of Behavior, Vehicle Probe, IPC, Diagnostic, CAN… Analyzed requirements, \ndesigned at black-box/ white-box level, coded in C language and conducted testing for all working \nmodules. \nKey Achievements: \n• \nServed as part of 30-members team located across Germany, India, Singapore, Malaysia and \nVietnam in VuC/ SOC development for diverse automotive applications/ services development \nprojects. \n• \nSuccessfully delivered development product with high commitment and quality, got high credit \nfrom customer, expanded Vietnam team from 3 developers to 10 developers. \n• \nAchieved exemplary customer satisfaction survey scores of up to 92/ 100. \nPlayed key role in 20-members global team tasked with development and testing of Connectivity/ Audio/ \nMedia modules for Continental Automotive Singapore. Participated in development of automotive \napplications at System On Chip (SOC). Served as Software Integrator/ Test Lead, responsible for full \nlifecycle of software delivery, testing and integration. Reported to senior management and project \nstakeholders. Led five-members team in Vietnam in Audio manual and automation testing. \nKey Achievements: \n• \nSuccessfully deployed the Software Integration process from Singapore to Vietnam which no one \nbelieved it could, thus reduced the cost for project. \n• \nOpened a new team at Vietnam with 6 members to handle the entire integration and automation \ntesting of Audio domain. \n• \nReceived top 100 superior performance award (over 10,000 employees) for FPT-Software in \n2016. \nSenior C  Developer (August 2016 – Present) \nFPT Software HCM, Vietnam \nSoftware Pre-Integrator/ Test Lead (August 2015 – August 2016) \nContinental Automotive, Singapore \nSenior C++ Developer (May 2014 – August 2015) \nLUXOFT, Vietnam \nThang Giang Nguyen \nPage Two \nCoordinated with 30-members global team in development of Human Machine Interface (HMI) for the \nAutomotive industry. Developed HMI components based on HMCDIS2 Core with production quality \naccording to automotive industry standard, while adding new features required by customer. Optimized, \ntroubleshot and resolved issues with existing modules. \nKey Achievements: \n• \nQuickly learning and exploring project technical, one of the most helpful person in team. \n• \nSuccessfully developed HMI Module Tuner (Weather/ Traffic/ Sport/ Safe View) in C++. \nAssisted in development of medical information system in C#/ C++ (front-end and back-end applications \nfor MRI machine). Created new and additional functionality of existing source code in accordance with \ncustomer requirements, in addition to improving performance by refactoring source code. Led project \nteams and supported team members to ensure successful completions. Played key role in coding, unit \ntesting and integration testing. \nKey Achievements: \n• \nGot very high credit from customer for pilot period, thus got the contract to expand team from 2 \nmembers to 7 members. \n• \nIncreased the performance up to 23%, help to reduce the time of body scanning and hospital \ncould serve more patients. \n• \nConsistently achieved exemplary customer satisfaction survey scores of up to 99/ 100. \nC#/ C++ Developer (August 2011 – May2014) \nFPT Software HCM, Vietnam \nEDUCATION & CREDENTIALS \nHUFLIT (HO CHI MINH CITY UNIVERSITY OF FOREIGN LANGUAGES – INFORMATION TECHNOLOGY) \nBachelor of Information Technology, 2011 \nFPT APTECH \nDiploma in Information System Management, Higher Diploma in Software Engineering, 2010 \nTECHNICAL PROFICIENCIES \nLanguages/ Programming: C, C++, C#, python, .net, Java \nIDE: Microsoft Visual Studio 2003/ 2005/ 2008, Intel Parallel Composer 2011/ 2013, QT Creator, \nEclipse, E2 Studio \nDesign: IBM Rhapsody, Visual Paradigm, Astah Community \nTesting: Vector Cast, NUnit, CPPUnit, Test Complete, Automation Test Platform, IBM Rational Change, \nJenkins, TEMPPO, DOOR \nDatabase Management System: Microsoft SQL Server 2005/ 2008, SQLite \nSubversion: IBM Rational Synergy, GIT, TortoiseSVN, Perforce, Visual SourceSafe ", "educations": [{"id": 4487, "gpa": null, "major": "Quản lý thông tin", "school": "FPT APTECH", "diploma": "Other", "end_time": "2010-01-01T00:00:00Z", "conf_score": 0.9104963430749222, "start_time": null, "picklist_major": "Administrative/Clerical", "major_categories": "Báo chí và thông tin", "major_categories_detail": "Thông tin – Thư viện"}, {"id": 4486, "gpa": null, "major": "Công nghệ thông tin", "school": "HUFLIT (HO CHI MINH CITY UNIVERSITY OF FOREIGN LANGUAGES - INFORMATION TECHNOLOGY)", "diploma": "Bachelors", "end_time": "2011-01-01T00:00:00Z", "conf_score": 0.7897513794629749, "start_time": null, "picklist_major": "IT - Hardware/Networking", "major_categories": "Máy tính và công nghệ thông tin", "major_categories_detail": "Công nghệ thông tin"}], "experiences": [{"id": 14944, "detail": "Led full lifecycle development of automotive applications/ services at Vehicle Microcontroller (VuC) and\nSystem On Chip (SOC) for Continental Automotive Singapore, spreading on various modules: Audio, Communication Box, Record of Behavior, Vehicle Probe, IPC, Diagnostic, CAN... Analyzed requirements, designed at black-box/ white-box level, coded in C language and conducted testing for all working modules.\nKey Achievements: • Served as part of 30-members team located across Germany, India, Singapore, Malaysia and\nVietnam in VuC/ SOC development for diverse automotive applications/ services development projects.\n• Successfully delivered development product with high commitment and quality, got high credit from customer, expanded Vietnam team from 3 developers to 10 developers.\n• Achieved exemplary customer satisfaction survey scores of up to 92/ 100. Senior", "company": "FPT Software HCM, Vietnam", "end_time": "2023-04-13T00:00:00Z", "industry": "High Technology", "position": "Senior C Developer", "conf_score": 0.8189360019687867, "start_time": "2016-08-01T00:00:00Z"}, {"id": 14947, "detail": "responsible for full lifecycle of software delivery, testing and integration. Reported to senior management and project stakeholders. Led five-members team in Vietnam in Audio manual and automation testing.\nKey Achievements: • Successfully deployed the Software Integration process from Singapore to Vietnam which no one believed it could, thus reduced the cost for project.\n• Opened a new team at Vietnam with 6 members to handle the entire integration and automation testing of Audio domain.\n• Received top 100 superior performance award (over 10,000 employees) for FPT-Software in\n2016. Softwa", "company": "Continental Automotive", "end_time": "2016-08-31T00:00:00Z", "industry": "Other", "position": "Software Pre - Integrator/ Test Lead", "conf_score": 0.8556284773984834, "start_time": "2015-08-01T00:00:00Z"}, {"id": 14949, "detail": "LUXOFT, Vietnam Page Two Coordinated with 30-members global team in development of Human Machine Interface (HMI) for the\nAutomotive industry. Developed HMI components based on HMCDIS2 Core with production quality according to automotive industry standard, while adding new features required by customer. Optimized, troubleshot and resolved issues with existing modules.\nKey Achievements: • Quickly learning and exploring project technical, one of the most helpful person in team.\n• Successfully developed HMI Module Tuner (Weather/ Traffic/ Sport/ Safe View) in C++.", "company": "Continental Automotive", "end_time": "2015-08-31T00:00:00Z", "industry": "Other", "position": "Senior C++ Developer", "conf_score": 0.6925429707670153, "start_time": "2014-05-01T00:00:00Z"}, {"id": 14951, "detail": "Assisted in development of medical information system in C#/ C++ (front-end and back-end applications for MRI machine). Created new and additional functionality of existing source code in accordance with customer requirements, in addition to improving performance by refactoring source code. Led project teams and supported team members to ensure successful completions. Played key role in coding, unit testing and integration testing.\nKey Achievements: • Got very high credit from customer for pilot period, thus got the contract to expand team from 2 members to 7 members.\n• Increased the performance up to 23%, help to reduce the time of body scanning and hospital could serve more patients.\n• Consistently achieved exemplary customer satisfaction survey scores of up to 99/ 100. C#/", "company": "FPT Software", "end_time": "2014-05-31T00:00:00Z", "industry": "High Technology", "position": "C#/ C++ Developer", "conf_score": 0.8296249409035176, "start_time": "2011-08-01T00:00:00Z"}], "address": null}