{"skills": ["java", "oled technology", "javascript", "implementation", "c#", "mongodb", "xml", "management", "react native firebase", "redux", "unit test", "io", "postgresql", "elixir", "security", "enterprise", "object oriented", "analysis", "firebase", "project management", "rail", "redis", "typescript", "ruby", "mobile platform", "react native", "medium", "recruitment", "design pattern", "css", "restful", "oop", "le", "github", "software development", "testing", "socket io", "database", "mobile system", "map sdk", "html", "google map"], "fulltext": "THIEN LE HO HOANG\nPhone: +84 374708722\nEmail: thienlhh@outlook.com\nWebsite: koddi.me\nSUMMARY\nI’m an Software Engineer with more than 5 years in development, including 3 years in Enterprise Application\ndevelopment, about 2 years in Web and Cross-Platform Mobile App development, good understanding in Object-\nOriented Programming, Design Patterns.\nPassionate about learning new programming languages and researching technologies.\nI’m good in team working, communication clearly, time management, mentor and do code reviews for other team\nmembers.\nSKILLS\n Programming languages: JavaScript, C#/.Net and have knowledge of TypeScript, Elixir, HTML, CSS.\n Frameworks/Platforms: Node.js, React Native and have knowledge of React.js, Redux.js, Socket.io.\n Databases: MongoDB, and have knowledge of Redis, PostgreSQL.\n Others: Good understanding in OOP, Design Patterns, SOLID principles, ...\nEXPERIENCES\nGoodProducts Soft\nSoftware Engineer, April 2016 - Sep 2018\nThis company offers web and mobile development as well as project management with many technologies.\n Analyzing business needs and requirements.\n Design, develop and maintain web back-end applications using the RESTful web services.\n Design, develop and maintain mobile applications using cross-platform frameworks, connect with back-end\nweb services, provide smooth user experiences.\n Create, analysis and design documents and coordinated development, security, database services, testing,\ndeployment.\n Collaborate with clients to determine requirements and negotiate with stakeholders to resolve conflicting\nsystem needs and project issues.\nLendor - This is a mobile application with the vision of a world that fully embraces the sharing economy. This has a\nwide list of items for rent. The application gives consumers a choice before making a purchase.\n Responsibilities: Implement web back-end APIs and real-time chat system, mobile applications development\nand deployment, project management.\n Technologies used: Node.js/Express.js, Socket.io, MongoDB, React Native, One Signal.\nConnect Opp - This is a technology led Recruitment & Placement Company focusing on the short term employment\nneeds. This is the best way to find work in a flexibly manner that suits you.\n Responsibilities: Mobile applications development and deployment.\n Technologies used: React Native, Firebase, Google Maps SDK.\nWo1haitao - On this platform, buyers can post a want ad, and select target countries and other product details. After\npurchasing a want ad sellers see, you can bid for ad products. Buyers can choose the one best meet the mind of\npurchasing / sellers to trade in a number of bids.\n Responsibilities: Implement the web back-end APIs, collaborate with mobile development team.\n Technologies used: Ruby on Rails, PostgreSQL, Redis, Push Services.\nEmotive\n.Net Software Engineer, Aug 2013 - April 2016\nThis is an independent expert for automotive diagnostic systems company. The company goal is to offer the\ncustomers software at the highest level of quality, innovation and applicability as a technical leader in OTX\napplications based on international standards.\n Skills: C#/.Net, Java, XML, XAML, …\n Ensure the project quality by writing the unit tests, provide the user end to end tests.\n Improve the projects by analyzing and solve the issues that found in the implementation process or reported\nby QA/QC.\n Research and suggest to Leaders new solutions improve project features.\n Refactor and improve code quality.\n Provide the consulting and development for the company’s partners if needed.\n Implement a new version of core application core feature that improved about 20% loading time.\n Create a new DSL that makes the main product much more useful for the users.\n Projects:\n\nOpen Test Framework: Implement application’s UI, run-time system, installer packages.\n\nOpen Test Runtime: Implement the run-time system.\nEDUCATION\nUniversity of Information Technology\nSept 2009 - Dec 2013\nBachelor of Computer Science\n Awards: 3rd - Adventure of Finding Solutions 2012 academic competition, University of Science, HCMC.\nREFERENCES\n  GitHub   LinkedIn   Blog\nINTERESTS\n I’m keen on reading books, IT blogs like Medium, Quora, and Kipalog, …\n Having a coffee time and researching things at the weekend.\n Listening to music, travelling, and fishing.\nPowered by TCPDF (www.tcpdf.org)", "educations": [{"id": 4495, "gpa": null, "major": "Khoa học máy tính", "school": "University of Information Technology", "diploma": "Bachelors", "end_time": "2013-12-01T00:00:00Z", "conf_score": 0.8263227818945743, "start_time": "2009-09-01T00:00:00Z", "picklist_major": "IT - Hardware/Networking", "major_categories": "Máy tính và công nghệ thông tin", "major_categories_detail": "Máy tính"}], "experiences": [{"id": 14982, "detail": "This company offers web and mobile development as well as project management with many technologies.\nAnalyzing business needs and requirements.\nDesign, develop and maintain web back-end applications using the RESTful web services.\nDesign, develop and maintain mobile applications using cross-platform frameworks, connect with back-end web services, provide smooth user experiences.\nCreate, analysis and design documents and coordinated development, security, database services, testing, deployment.\nCollaborate with clients to determine requirements and negotiate with stakeholders to resolve conflicting system needs and project issues.\nLendor - This is a mobile application with the vision of a world that fully embraces the sharing economy. This has a wide list of items for rent. The application gives consumers a choice before making a purchase.\nResponsibilities: Implement web back-end APIs and real-time chat system, mobile applications development and deployment, project management.\nTechnologies used: Node.js/Express.js, Socket.io, MongoDB, React Native, One Signal. Connect Opp - This is a technology led Recruitment & Placement Company focusing on the short term employment needs. This is the best way to find work in a flexibly manner that suits you.\nResponsibilities: Mobile applications development and deployment.\nTechnologies used: React Native, Firebase, Google Maps SDK. Wo1haitao - On this platform, buyers can post a want ad, and select target countries and other product details. After purchasing a want ad sellers see, you can bid for ad products. Buyers can choose the one best meet the mind of purchasing / sellers to trade in a number of bids.\nResponsibilities: Implement the web back-end APIs, collaborate with mobile development team.\nTechnologies used: Ruby on Rails, PostgreSQL, Redis, Push Services.", "company": "GoodProducts Soft", "end_time": "2018-09-30T00:00:00Z", "industry": "Other", "position": "Software Engineer", "conf_score": 0.9171087048027518, "start_time": "2016-04-01T00:00:00Z"}, {"id": 14985, "detail": "This is an independent expert for automotive diagnostic systems company. The company goal is to offer the customers software at the highest level of quality, innovation and applicability as a technical leader in OTX applications based on international standards.\nSkills: C#/.Net, Java, XML, XAML, ... Ensure the project quality by writing the unit tests, provide the user end to end tests.\nImprove the projects by analyzing and solve the issues that found in the implementation process or reported by QA/QC. Research and suggest to Leaders new solutions improve project features.\nRefactor and improve code quality.\nProvide the consulting and development for the company’s partners if needed.\nImplement a new version of core application core feature that improved about 20% loading time.\nCreate a new DSL that makes the main product much more useful for the users.\nProjects: Open Test Framework: Implement application’s UI, run-time system, installer packages.\nOpen Test Runtime: Implement the run-time system.", "company": "Emotive", "end_time": "2016-04-30T00:00:00Z", "industry": "Other", "position": ".Net Software Engineer", "conf_score": 0.8280054682797672, "start_time": "2013-08-01T00:00:00Z"}], "address": null}