{"skills": ["streaming", "analysis", "algorithm", "e learning", "iot", "delphi", "mysql", "cloud function", "product management", "san", "elasticsearch", "system testing", "social graph", "implementation", "mvc", "ams", "angularjs", "search", "manage data", "studio", "c++", "agile", "testing", "python", "spring mvc", "mvp", "visual studio", "e learning system", "strut", "payment", "ibm", "database", "text to speech", "bigquery", "cloud", "hibernate", "heroku", "identity", "firestore", "xcode", "management", "google cloud", "java language", "management tool", "machine learning", "investments", "java", "administration", "jira", "data warehouse", "twitter", "product review", "forex", "data mining", "c#", "swift", "website development", "amazon ec2", "jsp", "google map", "hadoop", "mongodb", "mapreduce", "google cloud platform", "postgresql", "trello", "restful", "office administration", "github", "svn", "firebase", "tomcat", "structure", "rss", "position control", "angular", "class", "sql", "cassandra", "javascript", "xml", "enterprise", "jenkins", "spring", "medium", "aws", "asp"], "fulltext": "Hiep Nguyen \nVu Tong Phan, Ward 12 \nDistrict 2, HCMC, Vietnam \nContact: \n- Email: \nnguyenthehiep3012@gmail.com \n- Mobile: +84 97 778 0627 \n- Skype: hiepnt1 \n- https://linkedin.com/in/hiepnt3012 \nSUMMARY \nI have years of experience developing complex software projects for US-based \ntech startups and outsourcing agencies. \nSome of the tools, frameworks, and platforms that I am familiar with: \n- Platforms: Google Cloud, Amazon services. \n- Databases: Firebase Real-time, Firebase CloudStore, BigQuery, MySql, \nPostgres, MongoDB, Dynamo DB, Google Datastore, ElasticSearch, Cassandra \n- Programming languages: Java, Python, Swift, Delphi, Path script \n- IDEs: Jenkins, Eclipse, IntelliJ, Pycharm, Xcode \n- 3rd-party APIs: Google Maps/Places/Translates/Speeches, Facebook Graph \nApi, Twitter api, Forex exchange Api, TTS. \n- Management tools: Trello, Jira, Agile \nMy usual roles in past projects: \n- System architecting. \n- Creating Work-Break-Down structure, basic design, product design, and detail \ndesign. \n- Building backend APIs. \n- Developing front-ends (both mobile and web). \n- Analyzing user's behaviors. \n- SEO \nExperiences in building webapp system (scaling, backend, frontend, analytic\nlogs, ...) and building mobile app. \nResearch new technology quickly to give solutions for hard problems, not\ndepend on programming languages. \nEXPERIENCE \nCo-founder & Solo coder, Tale.city \nHo Chi Minh City — 11/2017 - 11/2018 \nWith Tale.city, you can explore a city at your own pace and listen to cultural and \nhistorical tales around you. Everything is in your pocket. You will not only travel \nwith your eyes, but also with your ears. You will be immersed the past history, \nand culture richness of wherever you go. \nResponsibilities: \n●\nDesigning architect for whole system. \n●\nBrainstorming, product design.  \n●\nDeveloping mobile app, website, seo. \n●\nBuilding whole backend including following features: Text to Speech, \nkaraoke feature, Google Offline map, Web Content Crawling. \nTechnologies used: Google TTS, Nuance TTS, Content Crawling, Cloud \nfunction, BigQuery, Real-time firebase, Firestore, In-app purchase, Google Map \nOffline. \nSolution Architect, FPT Software \nHo Chi Minh City — 10/2016 - 9/2017 \nInvestigate specification of ODX/OTX, MCD-3D D-server, MCD-2D D-API. \nCheck the feasibility of new developing new diagnostic/reprogramming systems \n(follow the investigated specs). Develop diagnostic/reprogram app to \ndemonstrate the investigation result. \nDevelop PoC for automotive platform that provide solutions to control, connect \ncar with other devices (like other car, traffic light station, home…) \nResponsibilities: \n●\nDesign architect for whole system  \n●\nAnalysis requirement from Japanese customers \n●\nCoaching team members \n●\nImplementing basic design, detail design  \n●\nReview products of team members (coding, documents) \n●\nSupporting for technical issues  \nTechnologies used: Java, PostgreSQL, Spring MVC, Axis 2, Restful API, \nEclipse, Amazon EC2, Amazon Web Services, AWS IoT, AWS SNS. \nSenior Software Engineer, Viglink \nHo Chi Minh City — 12/2013 - 1/2016 \nFounded in 2009, VigLink is located in heart of San Francisco and backed by \ntop investors including Google Ventures, Emergence Capital, and RRE. VigLink \ntechnology instantly and automatically captures the value of content that drives \ncommerce. We monetize ordinary links to over 40,000 retailers, whether they're \ncreated by you or us. Our technology works across sites, apps, and social \nnetworks so you can focus on your business, earn more, and avoid the hassle of \nmanaging countless affiliate programs. \nResponsibilities: \n●\nCreate and enhance VigLink services according to spec \n●\nCommunicate and collaborate with other members of the development \nteam (developers, product management, business users) \n●\nWrite software and tests according to company standards \n●\nWrite design/implementation documentation as needed \nTechnologies used: Spring, Hibernate, Oozie, Hadoop, Amazon services, \nJenkins, AngularJS, MySQL, Javascript, Java, ... \nSoftware Engineer, Adatao \nHo Chi Minh City — 3/2013 - 8/2013 \nAdatao is developing breakthrough technology for Data Scientists & enterprise \nusers to perform Data Mining and Modeling, interactively and directly on Big \nData. We add real-time Intelligence to your Hadoop investments. \nResponsibilities: \n●\nDevelop Web application \n●\nDevelop machine learning algorithm using Spark like Hadoop \n●\nBuild and manage testing system \nTechnologies used: MySQL, AngularJS, Playframework \nSoftware Engineer, Caterva \nHo Chi Minh City — 2010 - 2012 \nCaterva (http://caterva.com) is a US startup aiming to organize the world's social \ngraph by people and interests. The company main product, Mirror.me, reveals to \nindividuals the virtualized identities that they project across the social web \n(Facebook, Twitter, Linkedin, Google+). The company is acquired by Facebook \nin early 2013. \nResponsibilities: \n●\nProvide back-end APIs \n●\nImplement front-end & mobile features \n●\nBuild admin tools (statistic, chart, report) for internal uses. \nTechnologies used: Spring, Hibernate, Amazon Services, Jenkins, AngularJS, \nMySQL, Javascript, Java, MongoDB, Google Services, Social Apis \nEngineer, Global Cybersoft \nHo Chi Minh City, 2008-2010 \nVoice Assorting System: VSS is the system manage data warehouse. The \nowner can manage and control information of warehouse, assign tasks to \nemployee. Employee must use barcode scanner, LXE device to work. LXE \ndevice is a machine that can communicate with people through voice engine. \nThis logistics system is very popular in many countries. \nResponsibilities \n●\nDevelop the communication layer between Japanese with LXE device \n●\nRecognize voice \nDigital pickle: E-Commerce solution which allows user to access the websites \nto search and buy products. Product can be anything such as PC, Laptop, \ncamera, software... The system allows administrator to add, delete, modify \nproduct and manage customer’s information. \nResponsibilities \n●\nBuild XML action \n●\nIntegrate between actions and prototypes. \n●\nTechnologies used: Flex 3.0, MVP, Struts 2.0 \nCOFI: The COFI application will be used by bank advisers to manage those 3 \nproducts in the post office setting. The role of the bank adviser is only directed to \nselling IARD contract. The activities of claimed management and back office \nadministration activities are dedicated exclusively to the JV. \nResponsibilities \n●\nImplement web service simulator \n●\nTechnologies used: JDK 1.5 of IBM, Spring MVC, Spring Web Flow \nSpring 2.5.6, WebSphere Application Server Community Edition \ne-Learning System: The system allows each organization and their staff to \nplan, access training materials and other support services available to them. \nEach organization has a System Administrator to facilitate the support services, \nassigns roles and permissions to each user in the system. \nResponsibilities \n●\nImplement change requests of customer \n●\nTechnologies used: Java, Hibernate, Strut, Spring, SiteMesh \nframework, SQL Server 2005, Jasper report \nFlash Player: Flash Player is a player is embedded into a website to play video \nfiles which contain several commercials files (.flv) by using streaming \ntechnology. The functionalities of the player include: Play/Pause, Rewind, Play \nposition timeline indicators, Play position control via click in position timeline \nindicator, Volume control. Work within browsers: Firefox, IE, Safari, Mac.... Can \nseamlessly stitch together multiple flash .flv streamed from a web server. No \ndelays may occur at the transitions between .flv files. \nResponsibilities \n●\nResearch Media Rich, Flex 3, GWT \n●\nReview, analyze, design and improve Flash Player \n●\nTechnologies used: MediaRich, Flex 3, Google Web Toolkit \nInternship, ELCA Company \nHo Chi Minh City, 2007-2008 \nGraphical Theatre Seat Reservation: It’s a part of the system Secutix, a \nunique solution for electronic ticketing, from events organization to tickets \nreservation and printing, e-payment and tickets control during event \nperformance. Secutix can deal with several kinds of events (fairs in particular) \nbut also has to deal with performances in theatres. Dealing with theatres is quite \ncomplex because each theatre is different in terms of seats layout & seat \npricing. \nResponsibilities \n●\nResearch new technology Silverlight 2.0 \n●\nAnalyze, design and implement the system \n●\nTechnologies used: Silverlight 2.0, C#, ASP.NET, SQL Server \nEDUCATION \nHo Chi Minh City University of Science \nTalent class — 2004-2008 \nAwards \n●\n2005: 1st prize National Programming Contest for University Students \nLuong The Vinh High School for the Gifted \nInformatic Class — 2001-2004 \nAwards \n●\n2002: The 1st prize in the Competition’s County on Programming for \nhigh-school students \n●\n2003: The 3rd prize in the Competition’s County on Programming for \nhigh-school students \n●\n2004: The 3rd prize in the Competition’s County on Programming for \nhigh-school students \nSKILLS \n●\nBig Data: Hadoop, MapReduce, Pig, R, Spark, Shark, Hive, Oozie \n●\nDatabase: MongoDB, MySQL, PostgreSQL, SQL Server \n●\nLanguages: Java, C++, C#,... \n●\nIDEs: Eclipse, Visual Studio, Xcode, ... \n●\nVersion control: Github, SVN \n●\nWeb Development: Java, Spring, Hibernate, JSP, Flex, Silverlight, \nTomcat, Heroku, Angular JS, Javascript,... \n●\nMobile Development: iPhone, J2ME, Symbian, Brew \nREFERENCES \nAvailable upon request. \nPowered by TCPDF (www.tcpdf.org)", "educations": [{"id": 4524, "gpa": null, "major": null, "school": "Ho Chi Minh City University of Science", "diploma": "Bachelors", "end_time": "2008-01-01T00:00:00Z", "conf_score": 0.7372273116634995, "start_time": "2004-01-01T00:00:00Z", "picklist_major": "Other", "major_categories": "", "major_categories_detail": ""}, {"id": 4525, "gpa": null, "major": "Informatic", "school": "Luong The Vinh High School for the Gifted", "diploma": "Other", "end_time": "2004-01-01T00:00:00Z", "conf_score": 0.7779983516018747, "start_time": "2001-01-01T00:00:00Z", "picklist_major": "Other", "major_categories": "", "major_categories_detail": ""}], "experiences": [{"id": 15098, "detail": "ith Tale.city, you can explore a city at your own pace and listen to cultural and historical tales around you. Everything is in your pocket. You will not only travel with your eyes, but also with your ears. You will be immersed the past history, and culture richness of wherever you go.\nResponsibilities: ● Designing architect for whole system.\n● Brainstorming, product design.\n● Developing mobile app, website, seo.\n● Building whole backend including following features: Text to Speech, karaoke feature, Google Offline map, Web Content Crawling. Technologies used: Google TTS, Nuance TTS, Content Crawling, Cloud function, BigQuery, Real-time firebase, Firestore, In-app purchase, Google Map Offline.", "company": "Tale.city", "end_time": "2018-11-30T00:00:00Z", "industry": "Other", "position": "Co - founder & Solo coder", "conf_score": 0.9256873161459609, "start_time": "2017-11-01T00:00:00Z"}, {"id": 15100, "detail": "Investigate specification of ODX/OTX, MCD-3D D-server, MCD-2D D-API. Check the feasibility of new developing new diagnostic/reprogramming systems (follow the investigated specs). Develop diagnostic/reprogram app to demonstrate the investigation result.\nDevelop PoC for automotive platform that provide solutions to control, connect car with other devices (like other car, traffic light station, home...)\nResponsibilities: ● Design architect for whole system\n● Analysis requirement from Japanese customers\n● Coaching team members\n● Implementing basic design, detail design\n● Review products of team members (coding, documents)\n● Supporting for technical issues\nTechnologies used: Java, PostgreSQL, Spring MVC, Axis 2, Restful API, Eclipse, Amazon EC2, Amazon Web Services, AWS IoT, AWS SNS.", "company": "FPT Software", "end_time": "2017-09-30T00:00:00Z", "industry": "High Technology", "position": "Solution Architect", "conf_score": 0.9192821033440151, "start_time": "2016-10-01T00:00:00Z"}, {"id": 15101, "detail": "Founded in 2009, VigLink is located in heart of San Francisco and backed by top investors including Google Ventures, Emergence Capital, and RRE. VigLink technology instantly and automatically captures the value of content that drives commerce. We monetize ordinary links to over 40,000 retailers, whether they're created by you or us. Our technology works across sites, apps, and social networks so you can focus on your business, earn more, and avoid the hassle of managing countless affiliate programs.\nResponsibilities: ● Create and enhance VigLink services according to spec\n● Communicate and collaborate with other members of the development team (developers, product management, business users)\n● Write software and tests according to company standards\n● Write design/implementation documentation as needed\nTechnologies used: Spring, Hibernate, Oozie, Hadoop, Amazon services,\nJenkins, AngularJS, MySQL, Javascript, Java, ...", "company": "Viglink", "end_time": "2016-01-31T00:00:00Z", "industry": "Other", "position": "Senior Software Engineer", "conf_score": 0.9192821033440151, "start_time": "2013-12-01T00:00:00Z"}, {"id": 15102, "detail": "Adatao is developing breakthrough technology for Data Scientists & enterprise users to perform Data Mining and Modeling, interactively and directly on Big Data. We add real-time Intelligence to your Hadoop investments.\nResponsibilities: ● Develop Web application\n● Develop machine learning algorithm using Spark like Hadoop ● Build and manage testing system\nTechnologies used: MySQL, AngularJS, Playframework", "company": "Adatao", "end_time": "2013-08-31T00:00:00Z", "industry": "Other", "position": "Software Engineer", "conf_score": 0.9192821033440151, "start_time": "2013-03-01T00:00:00Z"}, {"id": 15103, "detail": "(http://caterva.com) is a US startup aiming to organize the world's social graph by people and interests. The company main product, Mirror.me, reveals to individuals the virtualized identities that they project across the social web\n(Facebook, Twitter, Linkedin, Google+). The company is acquired by Facebook in early 2013. Responsibilities: ● Provide back-end APIs ● Implement front-end & mobile features\n● Build admin tools (statistic, chart, report) for internal uses.\nTechnologies used: Spring, Hibernate, Amazon Services, Jenkins, AngularJS, MySQL, Javascript, Java, MongoDB, Google Services, Social Apis", "company": "Caterva", "end_time": "2012-01-31T00:00:00Z", "industry": "Other", "position": "Software Engineer", "conf_score": 0.7800434575764302, "start_time": "2010-01-01T00:00:00Z"}, {"id": 15104, "detail": "oice Assorting System: VSS is the system manage data warehouse. The owner can manage and control information of warehouse, assign tasks to employee. Employee must use barcode scanner, LXE device to work. LXE device is a machine that can communicate with people through voice engine.\nThis logistics system is very popular in many countries.\nResponsibilities ● Develop the communication layer between Japanese with LXE device\n● Recognize voice\nDigital pickle: E-Commerce solution which allows user to access the websites to search and buy products. Product can be anything such as PC, Laptop, camera, software... The system allows administrator to add, delete, modify product and manage customer’s information.\nResponsibilities ● Build XML action\n● Integrate between actions and prototypes.\n● Technologies used: Flex 3.0, MVP, Struts 2.0 COFI: The COFI application will be used by bank advisers to manage those 3 products in the post office setting. The role of the bank adviser is only directed to selling IARD contract. The activities of claimed management and back office administration activities are dedicated exclusively to the JV. Responsibilities ● Implement web service simulator\n● Technologies used: JDK 1.5 of IBM, Spring MVC, Spring Web Flow Spring 2.5.6, WebSphere Application Server Community Edition e-Learning System: The system allows each organization and their staff to plan, access training materials and other support services available to them.\nEach organization has a System Administrator to facilitate the support services, assigns roles and permissions to each user in the system.\nResponsibilities ● Implement change requests of customer\n● Technologies used: Java, Hibernate, Strut, Spring, SiteMesh framework, SQL Server 2005, Jasper report\nFlash Player: Flash Player is a player is embedded into a website to play video files which contain several commercials files (.flv) by using streaming technology. The functionalities of the player include: Play/Pause, Rewind, Play position timeline indicators, Play position control via click in position timeline indicator, Volume control. Work within browsers: Firefox, IE, Safari, Mac.... Can seamlessly stitch together multiple flash .flv streamed from a web server. No delays may occur at the transitions between .flv files.\nResponsibilities ● Research Media Rich, Flex 3, GWT ● Review, analyze, design and improve Flash Player ● Technologies used: MediaRich, Flex 3, Google Web Toolkit", "company": "Global Cybersoft", "end_time": "2010-01-31T00:00:00Z", "industry": "High Technology", "position": "Engineer", "conf_score": 0.9174966546159762, "start_time": "2008-01-01T00:00:00Z"}, {"id": 15105, "detail": "raphical Theatre Seat Reservation: It’s a part of the system Secutix, a unique solution for electronic ticketing, from events organization to tickets reservation and printing, e-payment and tickets control during event performance. Secutix can deal with several kinds of events (fairs in particular) but also has to deal with performances in theatres. Dealing with theatres is quite complex because each theatre is different in terms of seats layout & seat pricing.\nResponsibilities ● Research new technology Silverlight 2.0 ● Analyze, design and implement the system\n● Technologies used: Silverlight 2.0, C#, ASP.NET, SQL Server", "company": "ELCA Company", "end_time": "2008-01-31T00:00:00Z", "industry": "Other", "position": "Internship", "conf_score": 0.9380811630931256, "start_time": "2007-01-01T00:00:00Z"}], "address": "Vu Tong Phan, Ward 12 District 2, Hcmc, Vietnam"}