{"skills": ["ams", "mai", "customer marketing", "pvc", "general management", "marketing", "excel", "management", "medium", "sales", "email marketing"], "fulltext": "Phuong, Bui Thi Mai\nDate of birth:\n Sept 19,1988\nGender:  Female\nPhone:  0904808811\nEmail:  phuong.buithimai@gmail.com\nAddress:\n Vinhome Thang long, Nam An Khanh,Hanoi, Vietnam\nOBJECTIVE\nI love working in marketing and PR fields. After finishing BA of Marketing at RMIT Vietnam , I had 2 years of\nexperience at PVC Group which was a very succesful and powerful group at that moment. I had contributed for\nthe company with passion and youth enthusiasm. \nFor a while, i thought i needed a greater change on knowledge and career, i decided to go abroad and studied\nMaster of Marketing at University of Portsmouth, United Kingdom. Few years learning in professional and\ndeveloped countries, i found myseft confidence, bigger mind and better education.Finishing my master, i went\nback to Vietnam and worked both in advertising agency and corporate in F&B fields. I had made my execellence\nin applying knowledge to certain customer case. I am proud of being flexible and adaptable with changing\nenvironment, understanding customer requirement, leading member in team thoroughly.I want to challenge\nmyself in new area, gain more knowledge because of the fast changing marketing world. I try to expert my self\non using online, offline tools to create effective plan. Therefore, i hope to work and contribute for a organisation\nwhich give me chance to accellerate my abillity and passion.\nEDUCATION\nOct 2011 - March 2013\nUniversity of Portsmouth, UK\nMajor: MA Marketing\nGPA: Merit\nJan 2007 - Jan 2010\nRoyal Melbourne Institute of Technology, Australia- Campus Hanoi\nMajor: Bachelor of Commerce\nGPA: 2.2/4\nWORK EXPERIENCE\nApr 2017 - Present\nPetrolinks, JSC\nMarketing Manager\n- The company has established on 2011, mainly a Pr- Advertising\nagency.\n- Pitching and presenting ideas with clients.\n- Planning marketing master plan for company big clients such as\nViglacera, Domesco, Ha Long beer, Thang Long Cement, Loyal Spa\n- Directing activation plan for single PR Campagin which related to\nTVC, social investigation, online and offline media campagin for Canifa,\nRedsun, Viettel, Foreign Trade University...\n-  Expanding network, finding new client for company\n Expert on: team leader, director, consumer relationship,B2B, Planning\nand activation.\n Oct 2016 - Mar 2017\nRedsun Group\nBrand Manager\n- Redsun Group has more than 120 franchise restaurants over Vietnam\nManaged marketing activities for 3 F&B brands which are BUKBUK,\nCAPRICIOSA, DOLPANSAM. The company has 12 restaurants of\nthese brands.\n- Trade marketing plan in order to up sale quarterly and yearly, and\nspecial event for holiday or grand opening\n- Reported after launching based on KPI\n- Teamed work with designer, digital  and offline POSM manufacturer\n Expert on: team leader, KPI managerment, POSM activition\nAug 2015 - Oct 2016\nZaan, JSC\nOperation Manager\n- Managed drink chains which has two brands  MANGO MANIA và\nGREEN MANGO. They are franchised from Thailand.\n - Plan online marketing plan such as food online network ( foody, Lozi),\nFacebook marketing and online press website.\n- Team work with POS manager, inventory manager and accountant to\nrun the business\n- Product development for each location\n- Advisor for employee training department to increase service \nExpert on: general management, leadership, consumer insight\nMay 2013 - June 2015\nHaPhuong Crystal, JSC\nMarketing manager\n- Company imported crystal product from many countries such as vase,\nwine glasses.\n- Product sold for B2B and end consumers. \n- Entered many special holiday gifts for Mobifone, Viettel or annual\ncustomer care for SHB Bank and many other SME organizations.\n - Built website, email marketing, offline POSM, delivery system. \n Expert on: B2C consumer insight, internal relatives.\nAug 2012 - March 2013\nRiverorchid Indochina Marketing Angency\nAccount Manager\n- Built the client networks such as Ecopark, Holcim, Eximbank.\n- Planned and pitched ideas for customer marketing master plan. \n- Collaborated with designer team and copywriter team to develop ideas\nand plan.\n- Joined and managed TVC operation for HUDA beer, EXIMBANK,\nGAU DO noodles\n Expert on: Customer relationship manager, Agency media,\nApr 2010 - Aug 2011\nPetrovietnam Construction Group\nPR and Event Executive\n- Planned a Master plan for Group in year 2011 include TVC, Press\nRelation, Events ( grand opening, annual stock owner meeting) and\nMass Media (TV, Radios).\n- Built new organization culture which applied on daily working\nenvironment, how to deal with customer, client and colleague.\n- Managing advertisement of PVC on VOV 90 MHZ daily on 7.15am to\n5.30pm, Real estate show on  VCTV9 and some other Advs slot on\n InfoTV.\n- Participate on PVC film for company\n- Event execution in many ground breaking event, grand opening event\nin more than 12 big projects all over Vietnam.\n- Press relation before and after events.\n Expert on : high pressure job, national master event type, Press\nrelationship.\n2012\nIELTS Certificate with score 6.5\nCERTIFICATIONS\nLanguage\nEnglish, Vietnamese\nComputer\nWord, Excel, Powerpoint\nSKILLS\n© topcv.vn\nPowered by TCPDF (www.tcpdf.org)", "educations": [{"id": 4541, "gpa": null, "major": "Marketing", "school": "RMIT Vietnam", "diploma": "Other", "end_time": null, "conf_score": 0.8050302059821224, "start_time": null, "picklist_major": "Marketing", "major_categories": "Kinh doanh và quản lý", "major_categories_detail": "Kinh doanh"}, {"id": 4544, "gpa": "2.2", "major": "Commerce", "school": "Royal Melbourne Institute of Technology, Australia - Campus Hanoi", "diploma": "Bachelors", "end_time": "2010-01-01T00:00:00Z", "conf_score": 0.8963209441344201, "start_time": "2007-01-01T00:00:00Z", "picklist_major": "Other", "major_categories": "", "major_categories_detail": ""}, {"id": 4542, "gpa": null, "major": "Marketing", "school": "University of Portsmouth", "diploma": "Masters", "end_time": null, "conf_score": 0.800450097907721, "start_time": null, "picklist_major": "Marketing", "major_categories": "Kinh doanh và quản lý", "major_categories_detail": "Kinh doanh"}, {"id": 4543, "gpa": null, "major": "Marketing", "school": "University of Portsmouth, UK", "diploma": "Bachelors", "end_time": "2013-03-01T00:00:00Z", "conf_score": 0.9243558553099895, "start_time": "2011-10-01T00:00:00Z", "picklist_major": "Marketing", "major_categories": "Kinh doanh và quản lý", "major_categories_detail": "Kinh doanh"}], "experiences": [{"id": 15147, "detail": "- The company has established on 2011, mainly a Pr- Advertising agency.\n- Pitching and presenting ideas with clients.\n- Planning marketing master plan for company big clients such as\nViglacera, Domesco, Ha Long beer, Thang Long Cement, Loyal Spa - Directing activation plan for single PR Campagin which related to\nTVC, social investigation, online and offline media campagin for Canifa, Redsun, Viettel, Foreign Trade University... - Expanding network, finding new client for company\nExpert on: team leader, director, consumer relationship,B2B, Planning and activation.", "company": "Petrolinks, JSC", "end_time": "2023-04-13T00:00:00Z", "industry": "Petrolium", "position": "Marketing Manager", "conf_score": 0.9175172730272324, "start_time": "2017-04-01T00:00:00Z"}, {"id": 15149, "detail": "- Redsun Group has more than 120 franchise restaurants over Vietnam Managed marketing activities for 3 F&B brands which are BUKBUK, CAPRICIOSA, DOLPANSAM. The company has 12 restaurants of these brands.\n- Trade marketing plan in order to up sale quarterly and yearly, and special event for holiday or grand opening\n- Reported after launching based on KPI - Teamed work with designer, digital and offline POSM manufacturer\nExpert on: team leader, KPI managerment, POSM activition", "company": "Redsun Group", "end_time": "2017-03-31T00:00:00Z", "industry": "Other", "position": "Brand Manager", "conf_score": 0.9373000418704206, "start_time": "2016-10-01T00:00:00Z"}, {"id": 15151, "detail": "- Managed drink chains which has two brands MANGO MANIA và\nGREEN MANGO. They are franchised from Thailand. - Plan online marketing plan such as food online network ( foody, Lozi), Facebook marketing and online press website.\n- Team work with POS manager, inventory manager and accountant to run the business\n- Product development for each location\n- Advisor for employee training department to increase service\nExpert on: general management, leadership, consumer insight", "company": "Zaan, JSC", "end_time": "2016-10-31T00:00:00Z", "industry": "Other", "position": "Operation Manager", "conf_score": 0.9380974856686034, "start_time": "2015-08-01T00:00:00Z"}, {"id": 15152, "detail": "- Company imported crystal product from many countries such as vase, wine glasses.\n- Product sold for B2B and end consumers.\n- Entered many special holiday gifts for Mobifone, Viettel or annual customer care for SHB Bank and many other SME organizations.\n- Built website, email marketing, offline POSM, delivery system.\nExpert on: B2C consumer insight, internal relatives.", "company": "HaPhuong Crystal, JSC", "end_time": "2015-06-30T00:00:00Z", "industry": "Other", "position": "Marketing manager", "conf_score": 0.9352556774579368, "start_time": "2013-05-01T00:00:00Z"}, {"id": 15154, "detail": "- Built the client networks such as Ecopark, Holcim, Eximbank. - Planned and pitched ideas for customer marketing master plan.\n- Collaborated with designer team and copywriter team to develop ideas and plan.\n- Joined and managed TVC operation for HUDA beer, EXIMBANK, GAU DO noodles\nExpert on: Customer relationship manager, Agency media,", "company": "Riverorchid Indochina Marketing Angency", "end_time": "2013-03-31T00:00:00Z", "industry": "Other", "position": "Account Manager", "conf_score": 0.9380974856686034, "start_time": "2012-08-01T00:00:00Z"}, {"id": 15156, "detail": "- Planned a Master plan for Group in year 2011 include TVC, Press Relation, Events ( grand opening, annual stock owner meeting) and\nMass Media (TV, Radios). - Built new organization culture which applied on daily working environment, how to deal with customer, client and colleague.\n- Managing advertisement of PVC on VOV 90 MHZ daily on 7.15am to 5.30pm, Real estate show on VCTV9 and some other Advs slot on\nInfoTV. - Participate on PVC film for company\n- Event execution in many ground breaking event, grand opening event in more than 12 big projects all over Vietnam. - Press relation before and after events.\nExpert on : high pressure job, national master event type, Press relationship.", "company": "Petrovietnam Construction Group", "end_time": "2011-08-31T00:00:00Z", "industry": "Petrolium", "position": "PR and Event Executive", "conf_score": 0.9373000418704206, "start_time": "2010-04-01T00:00:00Z"}], "address": "Vinhome Thang long, Nam An Khanh,hanoi, Vietnam"}