{"skills": ["linux", "stack", "sc", "angular", "css3", "san", "payment", "java", "automation", "responsive", "javascript", "cloud", "c#", "mongodb", "risks", "management", "studio", "gitlab", "postgresql", "security", "frontend development", "sql database", "automation test", "git", "html5", "rail", "html", "ruby", "spring", "cyber security", "asp", "voip", "sql", "css", "visual studio", "cypress", "reactjs", "security solution", "cloud security", "system design", "backend development", "database", "database design", "window server", "angularjs", "bootstrap", "cisco", "jquery"], "fulltext": "NGUYEN MINH KHOI \nSENIOR FRONT-END DEVELOPER \nDATE OF BIRTH: \nMAY 15, 1984 \nEMAIL:  minhkhoi2020@gmail.com \nPHONE:  0982709515 \nADDRESS: \nHoc Mon District, Ho Chi Minh City, Vietnam \nINTRODUCTION \nI’m a front-end developer with 10 years of experience. I have strong \nexperience in AngularJS, JavaScript, HTML5, SCSS, CSS, Web Responsive. I also \nhave many years working as full stack and back-end developer with .NET \ntechnology, ASP.NET, C#, Windows form applications, SQL Server, Windows \nServer, database design and system design. \nWORKING EXPERIENCE \nRestaff - House Of Norway \nAntenor OTG Norway \nDec 2018 - Now \nPosition: Senior Front-End Developer \nDescription:  \nI work for Antenor OTG company which is located in Norway, joining in project \nnamed \"Antenor Business Management System (ABMS)\". \nABMS is the complete cloud-based system for quality, risk and business \nmanagement. With this you can replace a myriad of manual solutions, one solution \nfor everything. Thus, you have immediately saved costs in relation to license costs \nand internal administrative time. \nPlease go to company website at http://antenor.no for more information about \ncompany and ABMS. \nTechnologies used in project: Ruby on Rails, PostgreSQL, AngularJS, coffee script, \nSCSS, CSS, HTML,  Cypress for client automation test. \nMy Responsibilities: \nü Join weekly meeting with manager and technical leader from Norway and \nRomania to discuss about requirements, sprint planning, and sprint review. \nü Get requirements of client, break tasks and create neccessary tickets on \ngitlab.com then implement them one by one. \nü Propose my idea about new features or things need to be improved \nü Design UI/UX for the new requirements/features \nü Coding all features of front end side. \nü Find and fix bugs on the project \nMy Skills used: AngularJS, Angular UI bootstrap, bootstrap,  SCSS, D3js, design web \nresponsive, Adobe XD Adobe Photoshop for UI/UX design. \nPosition: Senior Front-End Developer \nDescription:  \nOPSWAT is a cyber-security software company, headquartered in San Francisco, \nUS. Joining in OPSWAT, I undertake front-end development in one of the most \nimportant project of Opswat named MetaAccess, this is a security cloud based \nsolution. MetaAccess is a security solution for your local network, it prevents risky \ndevices from accessing your local network. Refer \nhttps://www.opswat.com/products/metaaccess for more details. \nTechnologies used in project: Java, MongoDB, NodeJS, Linux server,  IDE for coding \nis Spring Tool Suite. \nMy Responsibilities:  \nü Build MetaAccess project from the beginning. \nü I’m responsible for all tasks about front end. \nü Get mockup file from designer, slice to HTML. \nü Write all client scripts, to handle user interaction with server. \nü Design UI/UX in some situations. \nMy Skills used: AngularJS, NodeJS,  Javascript, jQuery,  HTML5, SCSS, CSS3, D3JS for \ndrawing charts, Adobe XD for UI/UX design, Adobe Photoshop for images \nprocessing and another tasks relevant to UI. \nPosition: Full stack .NET Developer \nDescription:  \nSouth Telecom is a company providing telecommunication software and services. \nJoining South Telecom I undertake database design, developing main web portal of \ncompany, many internal websites for managing customers, services, managing \ncalling logs of VoIP Services. \nMy Responsibilities:  \nü Develop all web applications of company: main website, web application for \nmanaging agency, web application for customer support, web application \nfor selling international phone card. \nü Get mockup from UI designer, slice to HTML, implement JavaScript to \nprocess user’s actions. \nü Design system and database with SQL server, programming store \nprocedures, functions. \nü Implement web services to connect with partner, connecting with payment \ngate. \nü Design UI in some situations. \nü Manage and monitor servers \nOPSWAT Software \nDec 2012 – Nov 2018 \nSouth Telecom \nJun 2009 – Dec 2012 \nEDUCATION \nMekong Delta Aptech – Can Tho City \nFrom 2006 – 2009 \nHigh Diploma In Software Engineering \nOVERALL SKILLS \n70%\n78%\n50%\n85%\n80%\n70%\n50%\n60%\n40%\n85%\n90%\n85%\n90%\nGIT\nSQL Server\nJava\nWindows Forms\nASP.NET\nC#\nPhotoshop\nAdobe XD\nUI/UX\nReactJS\nNodeJS\nHTML\nSCSS, CSS3\nJavascript\nAngular\nTechnologies used: ASP.NET, C#, SQL Server, Windows server, IIS, Cisco, VoIP \ngateway, IDE Visual Studio. \nMy skills used: C#, ASP.NET, SQL Programming, SQL Database Design, Javascript, \njQuery, jQueryUI, HTML, CSS, Adobe Photoshop, management windows servers. ", "educations": [{"id": 4559, "gpa": null, "major": "Kỹ thuật phần mềm", "school": "Mekong Delta Aptech", "diploma": "Other", "end_time": "2009-01-01T00:00:00Z", "conf_score": 0.9257346457968602, "start_time": "2006-01-01T00:00:00Z", "picklist_major": "IT - Hardware/Networking", "major_categories": "Máy tính và công nghệ thông tin", "major_categories_detail": "Máy tính"}], "experiences": [{"id": 15190, "detail": "escription:\nI work for Antenor OTG company which is located in Norway, joining in project named \"Antenor Business Management System (ABMS)\". ABMS is the complete cloud-based system for quality, risk and business management. With this you can replace a myriad of manual solutions, one solution for everything. Thus, you have immediately saved costs in relation to license costs and internal administrative time.\nPlease go to company website at http://antenor.no for more information about company and ABMS. Technologies used in project: Ruby on Rails, PostgreSQL, AngularJS, coffee script,\nSCSS, CSS, HTML, Cypress for client automation test.\nMy Responsibilities: ü Join weekly meeting with manager and technical leader from Norway and\nRomania to discuss about requirements, sprint planning, and sprint review. ü Get requirements of client, break tasks and create neccessary tickets on gitlab.com then implement them one by one. ü Propose my idea about new features or things need to be improved ü Design UI/UX for the new requirements/features ü Coding all features of front end side. ü Find and fix bugs on the project\nMy Skills used: AngularJS, Angular UI bootstrap, bootstrap, SCSS, D3js, design web responsive, Adobe XD Adobe Photoshop for UI/UX design.", "company": "Restaff - House Of Norway\nAntenor OTG Norway", "end_time": "2023-04-13T00:00:00Z", "industry": "Other", "position": "Senior Front - End Developer", "conf_score": 0.892025666952456, "start_time": "2018-12-01T00:00:00Z"}, {"id": 15191, "detail": "s a cyber-security software company, headquartered in San Francisco, US. Joining in OPSWAT, I undertake front-end development in one of the most important project of Opswat named MetaAccess, this is a security cloud based solution. MetaAccess is a security solution for your local network, it prevents risky devices from accessing your local network. Refer https://www.opswat.com/products/metaaccess for more details.\nTechnologies used in project: Java, MongoDB, NodeJS, Linux server, IDE for coding is Spring Tool Suite. My Responsibilities: ü Build MetaAccess project from the beginning. ü I’m responsible for all tasks about front end. ü Get mockup file from designer, slice to HTML. ü Write all client scripts, to handle user interaction with server. ü Design UI/UX in some situations.\nMy Skills used: AngularJS, NodeJS, Javascript, jQuery, HTML5, SCSS, CSS3, D3JS for drawing charts, Adobe XD for UI/UX design, Adobe Photoshop for images processing and another tasks relevant to UI. OPSWAT", "company": "OPSWAT", "end_time": "2018-11-30T00:00:00Z", "industry": "High Technology", "position": "Senior Front - End Developer", "conf_score": 0.8276224652027222, "start_time": "2012-12-01T00:00:00Z"}, {"id": 15192, "detail": "is a company providing telecommunication software and services.\nJoining South Telecom I undertake database design, developing main web portal of company, many internal websites for managing customers, services, managing calling logs of VoIP Services. My Responsibilities: ü Develop all web applications of company: main website, web application for managing agency, web application for customer support, web application for selling international phone card. ü Get mockup from UI designer, slice to HTML, implement JavaScript to process user’s actions. ü Design system and database with SQL server, programming store procedures, functions. ü Implement web services to connect with partner, connecting with payment gate. ü Design UI in some situations. ü Manage and monitor servers\nTechnologies used: ASP.NET, C#, SQL Server, Windows server, IIS, Cisco, VoIP gateway, IDE Visual Studio. My skills used: C#, ASP.NET, SQL Programming, SQL Database Design, Javascript, jQuery, jQueryUI, HTML, CSS, Adobe Photoshop, management windows servers.", "company": "South Telecom", "end_time": "2012-12-31T00:00:00Z", "industry": "Other", "position": "Full stack .NET Developer", "conf_score": 0.8276224652027222, "start_time": "2009-06-01T00:00:00Z"}], "address": "Hoc Mon District, Ho Chi Minh City, Vietnam"}