{"skills": ["sanitation", "talent management", "internal audit", "scheme", "management consulting", "implementation", "sales", "management", "corporate culture", "administration", "human resources", "structure", "analysis", "compensation & benefits", "distribution logistics", "performance management", "insurance", "recruitment", "evaluation system", "procurement", "small office", "iso", "microsoft", "performance evaluation", "class", "process development", "data management", "teamwork", "data management system", "services tax", "problem solving", "compensation structure", "recruitment strategy"], "fulltext": "NGUYEN THI KIEU OANH \nStrong at Talent Acquisition, C&B Management, global HR system & reports. \nExperienced in working in a new established foreign company. \nDate of birth: 11/11/1984, Married with one 2 years-old son.  \nACHIEVEMENTS \nHigh performance (1/5) to be nominated to Manager level at Samsung SDS, HCM Branch \nafter 01 year contribution. \nCan meet the tight deadlines of mass-hiring, ad-hoc reports and good problems solving. \nSmoothly set up Samsung SDS - HCM branch (warehouse & distribution, logistics operation). \nEXPERIENCES \nHR & SUPPORT MANAGER, MINH NGUYEN INDUSTRIAL SUPPORT JSC \nWorking period: May 2017 – Oct 2018. \nCompany’s business type: Plastics Industrial Manufacturing, Samsung 1st \nClass Partner \nCompany size: 350 Headcounts, Direct Report: Vietnamese CEO \n1. Recruitment (30%) \n- \nManage the whole recruitment processes & support the recruitment team in posting \njobs, CV screening, recruitment test, interviewing, selection, reference check, job offer, \nect. in order to timely hire the right talents as business’s or project’s requirements \n- \nBe creative in generating candidate pool and finding candidate sources for recruitment: \npartnership with colleges, vocational training schools, universities & head hunters; \nadvertisement on websites, newspaper; attending job fairs; PR Harvey Nash brand \nname for appealing candidates, etc \n- \nWeekly update recruitment status to the management and line managers. \n2. C&B (Compensation & Benefit) (30%) \n- \nDesign salary structures and C&B schemes for different staff levels \n- \nConduct/attend salary survey to understand and keep management updated on salary \nbenchmarks \n- \nConduct yearly performance evaluation and recommend right salary (review) for \nperformance and salary benchmarks where available \n- \nEnsure company’s C&B program is always in compliant with the up-to-dated labour \ncode \n- \nEnsure adherence to company’s guideline on salary budget, review and promotion \nprocesses. \n- \nTalent Management \n- \nCoordinate with line managers to build performance targets or Key Performance \nIndicators (KPI) for various functions and projects \n- \nDetermine appropriate measurement tools to track performance vs target/KPI \n- \nDesign Reward and Recognition programs for performance excellence \n- \nBuild Staff Loyalty or Retention programs to retain top talents with the company \n3. Companies policy & Employees Relations: (20%) \n- \nEnsure all employees comply with the company regulations. \n- \nUpdating the company regulations accordant with Labor law’s and RHQ requirements. \n- \nProvides advice to Section managers and employee' queries regarding application of HR \npolicies within the areas of responsibilities \n- \nFollowing up the implementation company regulations at sites \n- \nConsulting Management and RHQ the discipline form legally \n- \nMaintain and update policies, procedures and other human resources matters \n- \nIssue Labor contract termination base on company benefit and labor law. \n- \nSolving all disciplines according to labor law procedure \n4. Training & development (20%): \n- \nDefine training plan & budget to the management based on business’s requirements \n- \nCoordinate with line managers to conduct regular training analysis and define training \nneeds for different staff levels \n- \nDevelop training programs based on training needs for staff improvement or \ndevelopment \n- \nExecute training plan by coordinating with external training centers as well as internal \ntrainings including induction training, soft skill training and technical training \n- \nDevelop succession plan and define training programs for key staff \n- \nCoordinate career development process & map career plan to different staff levels \n5. Management Board supporting (10%) \nHR & GA MANAGER, SAMSUNG SDS HCM BRANCH, FACTORY SITE \nWorking period: Sep 2012 - Sep 2016 \nCompany size: 300 Headcounts, Direct Report: Korean Managing Director \n1. Recruitment & training management (30%) \n- \nManage all recruitment process included sourcing, screening, interviewing, checking \nreferences; negotiating employment offers; relocation; orientation training. \n- \nKeep close communication with hiring manager to understand the job requirement, \nprovide consultancy to hiring managers about searching strategy, define the \nassessment processes & tools with hiring manager and update the hiring status. \n- \nCoordinate with Departments in creating and managing potential candidate pools, \nespecially for positions which are rare in the market. \n- \nDevelop and implement recruitment and screening systems and procedures in order to \nattract the most qualified candidates for position vacancies in the company. \n- \nEvaluate external labor market conditions and internal employee turnover trends to \nrecommend changes to the organization's recruitment strategies. \n- \nSelect and manage ongoing relationships with recruitment agencies to ensure \nsatisfactory standards of service. \n- \nSupervise training course and ensure that all training activities are in accordance to the \ntarget of company and all training programs have been smoothly executed. \n2. Compensation & Benefits (20%) \n- \nIn charge of monthly payroll, benefits, PIT, Social, Health and Unemployment Insurance. \n- \nUpdate labor law, social insurances regulations, tax services to consult, implement, \nadjust company policy and conduct training for all employees’ understanding. \n- \nCalculate gross & net salaries and labor cost to company whenever required. \n- \nAdvise on salary increase requests, prepare spreadsheets for the annual salary review. \n- \nWorking with RHQ to design the compensation structures (job classification, job \nevaluation system, job description policy, promotion policy, salary scale etc.) aligned \nwith the corporate culture and the corporate values. \n- \nWorking with RHQ to analyze internal and external market data, company’s current \nemployee population, salary and manpower demands to develop salary budgets. \n- \nMonthly perform and submit the HR cost plan to RHQ and Labor Dept. if any. \n3. Performance Management & HR planning (30%) \n- \nBuild up and update KPIs, Competencies Profile, Career Development Plan for each \ndepartment through discussion and brainstorming activities with Line Managers, HR \nManager and Chairman aligned with company goals. \n- \nKeep track and consult with Line Managers in the process of Performance Review (mid- \nyear review, year-end review) to ensure a proper communication to employees. \n- \nImplement annual performance appraisal program for salary adjustment and bonus. \n- \nPersonnel information data system management, adding new employee and \ndeactivating resignation, updating the transaction (salary change, promotion, \ndemotion, transfer, personal information) on the HR system. \n- \nSupport other department by providing tools, process and policies in regard to talent \nmanagement, compensation & rewards, employment regulations, recruitment and \nperformance management. \n4. Company policies & employee relations & Management support (20%) \nHR & LOGISTICS MANAGER, KODAK AUTHORIZED DISTRIBUTOR \nWorking period: Mar 2009 – Sep 2012 \nCompany’s business type: Kodak scanner distributor \nCompany size: 70 Headcounts, Direct report: Vietnamese CEO \n- \nBeing charge of recruitment and employees data management. \n- \nManage employee profiles, labor contract, probation, transfer, exit procedures. \n- \nFull charge of company’s recruitment activities. \n- \nSolve conflicts, violations, and manage labor disputes and employee grievances… \n- \nLiaison with local authorities for all HR and admin matter trouble shooting. \n- \nWelcome training conducting and support sales departments on training activities, \nrecord performance evaluation after training. \n- \nBusiness trip arrangement (hotel & flight booking, advance & claim...) for employees. \n- \nSupervises the team of cleaners to ensure general upkeep and sanitation of the work \nenvironment such as work spaces, wash rooms, utility and storage areas, and facilities. \n- \nProcurement of office supplies and stationery, control the small office-equipment’s \nrelated problems including copiers, fax machine, printers, phone trunk lines… \n- \nAdmin for all meetings & events, manage programs and budget for company activities \nsuch as company travels, seminar, kick-off meetings, closing ceremonies… \nISO EXECUTIVE & SECRETARY, DAI DUNG MANUFACTURES & CONSTRUCTIONS GROUP \nWorking period: Jan 2006 – Dec 2008 \nCompany’s business type: Mechanical manufacture & constructions \nCompany size: 1000 Headcounts, Direct report: Board of Directors \n- \nProcess compliance & implementing, documentation checking and improving. \nPerform quarterly internal audits for whole group. \nAssist Board of Directors to work with consultancy for projects of company re-structure. \nCoordinate with Head of Departments to set up ISO application in the whole factory. \nSupport HR department if any requirements. \n- \n- \n- \n- \nEDUCATION \nBA of Business Administration, University of economics HCMC \nTRAINING COURSES \n2014 – 2015: Chief of Human Resources Officer, Pace Institute, HCMC. \nAug 2014: EWP HR training, Samsung SDS Asia Pacific Pte. Ltd, Singapore \nMar 2014: Samsung Vietnam HR workshop, Samsung Electronics VN, Bac Ninh \nMay 2013: Global HR training, Samsung SDS Head Quarter, Korea \nNov 2012: GHR system, Samsung SDS Asia Pacific Pte. Ltd, Singapore \nSKILLS AND \nABILITIES \nComputer \nü Good at using Microsoft Office \nü Skilled in Global HR system \nLanguages \nü English: Advanced level \nü French: bilingual course in university. \nSkills \nü Strong and proven analytical skills. \nü Problem solving, Work under pressure \nü Teamwork, Time management \nREFERENCES  \nAvailable upon request. ", "educations": [{"id": 4564, "gpa": null, "major": "Quản lý đô thị và công trình", "school": "University of economics HCMC", "diploma": "Bachelors", "end_time": null, "conf_score": 0.7746143300927613, "start_time": null, "picklist_major": "Architecture / Interior Design", "major_categories": "Kiến trúc và xây dựng", "major_categories_detail": "Kiến trúc và quy hoạch"}], "experiences": [{"id": 15206, "detail": "Company’s business type: Plastics Industrial Manufacturing, Samsung 1st\nClass Partner Company size: 350 Headcounts, Direct Report: Vietnamese CEO 1. Recruitment (30%) - Manage the whole recruitment processes & support the recruitment team in posting jobs, CV screening, recruitment test, interviewing, selection, reference check, job offer, ect. in order to timely hire the right talents as business’s or project’s requirements\n- Be creative in generating candidate pool and finding candidate sources for recruitment: partnership with colleges, vocational training schools, universities & head hunters; advertisement on websites, newspaper; attending job fairs; PR Harvey Nash brand name for appealing candidates, etc\n- Weekly update recruitment status to the management and line managers.\n2. C&B (Compensation & Benefit) (30%) - Design salary structures and C&B schemes for different staff levels\n- Conduct/attend salary survey to understand and keep management updated on salary benchmarks\n- Conduct yearly performance evaluation and recommend right salary (review) for performance and salary benchmarks where available\n- Ensure company’s C&B program is always in compliant with the up-to-dated labour code\n- Ensure adherence to company’s guideline on salary budget, review and promotion processes.\n- Talent Management - Coordinate with line managers to build performance targets or Key Performance Indicators (KPI) for various functions and projects\n- Determine appropriate measurement tools to track performance vs target/KPI - Design Reward and Recognition programs for performance excellence\n- Build Staff Loyalty or Retention programs to retain top talents with the company\n3. Companies policy & Employees Relations: (20%) - Ensure all employees comply with the company regulations.\n- Updating the company regulations accordant with Labor law’s and RHQ requirements.\n- Provides advice to Section managers and employee' queries regarding application of HR policies within the areas of responsibilities\n- Following up the implementation company regulations at sites\n- Consulting Management and RHQ the discipline form legally\n- Maintain and update policies, procedures and other human resources matters\n- Issue Labor contract termination base on company benefit and labor law.\n- Solving all disciplines according to labor law procedure\n4. Training & development (20%): - Define training plan & budget to the management based on business’s requirements\n- Coordinate with line managers to conduct regular training analysis and define training needs for different staff levels\n- Develop training programs based on training needs for staff improvement or development\n- Execute training plan by coordinating with external training centers as well as internal trainings including induction training, soft skill training and technical training\n- Develop succession plan and define training programs for key staff\n- Coordinate career development process & map career plan to different staff levels\n5. Management Board supporting (10%)", "company": "MINH NGUYEN INDUSTRIAL SUPPORT JSC", "end_time": "2018-10-31T00:00:00Z", "industry": "Other", "position": "HR & SUPPORT MANAGER", "conf_score": 0.9338747039935654, "start_time": "2017-05-01T00:00:00Z"}, {"id": 15207, "detail": "Company size: 300 Headcounts, Direct Report: Korean Managing Director 1. Recruitment & training management (30%) - Manage all recruitment process included sourcing, screening, interviewing, checking references; negotiating employment offers; relocation; orientation training.\n- Keep close communication with hiring manager to understand the job requirement, provide consultancy to hiring managers about searching strategy, define the assessment processes & tools with hiring manager and update the hiring status.\n- Coordinate with Departments in creating and managing potential candidate pools, especially for positions which are rare in the market.\n- Develop and implement recruitment and screening systems and procedures in order to attract the most qualified candidates for position vacancies in the company.\n- Evaluate external labor market conditions and internal employee turnover trends to recommend changes to the organization's recruitment strategies.\n- Select and manage ongoing relationships with recruitment agencies to ensure satisfactory standards of service.\n- Supervise training course and ensure that all training activities are in accordance to the target of company and all training programs have been smoothly executed.\n2. Compensation & Benefits (20%) - In charge of monthly payroll, benefits, PIT, Social, Health and Unemployment Insurance. - Update labor law, social insurances regulations, tax services to consult, implement, adjust company policy and conduct training for all employees’ understanding.\n- Calculate gross & net salaries and labor cost to company whenever required.\nAdvise on salary increase requests, prepare spreadsheets for the annual salary review.\nWorking with RHQ to design the compensation structures (job classification, job evaluation system, job description policy, promotion policy, salary scale etc.) aligned with the corporate culture and the corporate values.\nWorking with RHQ to analyze internal and external market data, company’s current employee population, salary and manpower demands to develop salary budgets.\nMonthly perform and submit the HR cost plan to RHQ and Labor Dept. if any.\n3. Performance Management & HR planning (30%) Build up and update KPIs, Competencies Profile, Career Development Plan for each department through discussion and brainstorming activities with Line Managers, HR Manager and Chairman aligned with company goals.\nKeep track and consult with Line Managers in the process of Performance Review (mid- year review, year-end review) to ensure a proper communication to employees.\nImplement annual performance appraisal program for salary adjustment and bonus.\nPersonnel information data system management, adding new employee and deactivating resignation, updating the transaction (salary change, promotion, demotion, transfer, personal information) on the HR system.\nSupport other department by providing tools, process and policies in regard to talent management, compensation & rewards, employment regulations, recruitment and performance management.\n4. Company policies & employee relations & Management support (20%)", "company": "SAMSUNG SDS HCM BRANCH, FACTORY SITE", "end_time": "2016-09-30T00:00:00Z", "industry": "High Technology", "position": "HR & GA MANAGER", "conf_score": 0.9264139694127339, "start_time": "2012-09-01T00:00:00Z"}, {"id": 15208, "detail": "", "company": null, "end_time": "2015-01-31T00:00:00Z", "industry": "Other", "position": "of Human Resources Officer", "conf_score": 0.7588694396088908, "start_time": "2014-01-01T00:00:00Z"}, {"id": 15209, "detail": "", "company": "Samsung SDS Head Quarter", "end_time": "2013-12-31T00:00:00Z", "industry": "High Technology", "position": null, "conf_score": 0.703054895247018, "start_time": "2013-05-01T00:00:00Z"}, {"id": 15210, "detail": "", "company": "Samsung SDS Asia Pacific Pte. Ltd", "end_time": "2012-12-31T00:00:00Z", "industry": "High Technology", "position": "GHR system", "conf_score": 0.7195163243318522, "start_time": "2012-11-01T00:00:00Z"}, {"id": 15211, "detail": "Company size: 70 Headcounts, Direct report: Vietnamese CEO - Being charge of recruitment and employees data management.\n- Manage employee profiles, labor contract, probation, transfer, exit procedures.\n- Full charge of company’s recruitment activities.\n- Solve conflicts, violations, and manage labor disputes and employee grievances...\n- Liaison with local authorities for all HR and admin matter trouble shooting.\n- Welcome training conducting and support sales departments on training activities, record performance evaluation after training.\n- Business trip arrangement (hotel & flight booking, advance & claim...) for employees.\n- Supervises the team of cleaners to ensure general upkeep and sanitation of the work environment such as work spaces, wash rooms, utility and storage areas, and facilities.\n- Procurement of office supplies and stationery, control the small office-equipment’s related problems including copiers, fax machine, printers, phone trunk lines...\n- Admin for all meetings & events, manage programs and budget for company activities such as company travels, seminar, kick-off meetings, closing ceremonies...\nISO", "company": "KODAK AUTHORIZED DISTRIBUTOR", "end_time": "2012-09-30T00:00:00Z", "industry": "Other", "position": "HR & LOGISTICS MANAGER", "conf_score": 0.8723840999046604, "start_time": "2009-03-01T00:00:00Z"}, {"id": 15212, "detail": "pany size: 1000 Headcounts, Direct report: Board of Directors Process compliance & implementing, documentation checking and improving.\nPerform quarterly internal audits for whole group.\nAssist Board of Directors to work with consultancy for projects of company re-structure.\nCoordinate with Head of Departments to set up ISO application in the whole factory.\nSupport HR department if any requirements.", "company": "DAI DUNG MANUFACTURES & CONSTRUCTIONS GROUP", "end_time": "2008-12-31T00:00:00Z", "industry": "Other", "position": "ISO EXECUTIVE & SECRETARY", "conf_score": 0.8795042662994684, "start_time": "2006-01-01T00:00:00Z"}], "address": null}