{"skills": ["linux", "stack", "strut", "docker", "task management", "java technology", "c#", "mongodb", "redux", "unit test", "jsf", "test driven development", "analysis", "apacheds", "spring mvc", "microservices", "iso", "testing", "oracle", "fedora", "jenkins", "jsp", "intellij idea", "angularjs", "full stack development", "aws", "angular", "internet", "java", "marketing", "json", "javascript", "cloud", "jdbc", "administration", "automation test", "spring cloud", "mobile application", "email marketing", "database management system", "spring security", "asp", "restful", "openid", "ibm", "window operating system", "spirateam", "exacttarget", "java language", "management", "netbeans", "java core", "rsvp", "scrum master", "union", "itko lisa", "css", "jira", "maven", "appium", "continuous integration", "database", "hibernate", "system administration", "bitbucket", "bootstrap", "html", "postman", "automation", "oauth2", "jboss", "ams", "neo4j", "selenium", "database management", "studio", "spring boot", "security", "j2ee", "structure", "spring", "bank accounts", "operating system", "sql", "gradle", "software development", "mvc", "uml", "process data", "redmine", "swagger", "junit", "php", "mysql"], "fulltext": "RESUME  \nNGUYEN ANH NHAN \nTechnical Manager \nPhone:  \nMail:  \nSkype:  \nReference : \n- \nPhuoc Nguyen Thanh – Solution Architect at FSOFT HCM \n- \nHoang Phi – Delivery Manager Operation at FSOFT HCM \n- \nTien Duong Dung – QMS Director at Larion \nSUMMARY \n• I have more than 8 years’ experience in software development. \n• I have experience and strong at Software and Web Application using Java. \n• I am able to apply Selenium and Appium automation test framework using Java. \n• I am experience at integrating automation test and deploying application into Continuous \nIntegration, Jenkins. \n• Build project and manage development team from frontend to backend team. \n• Working as a full-stack developer to build entire website from front-end to backend with Angular4 \nand Java (Spring, Hibernate, Restful) \nTECHNICAL SKILLS \n• Programming Languages: Java, PHP and C#, Javascripts \n• Java: J2EE, JSP, JSTL Servlet, Caesar, Jasper Report, Test-Driven Development, Junit, UML, Maven, \nJBoss ESB, WSO2 ESB, Microservices \n• JavaScript:Angular2, NodeJS, Polymer Web Component. \n• Frameworks/Platforms: Spring, Spring MVC, Spring Security, Spring LDAP, Hibernate, Struts, JSF, \nAlfresco ECM, Liferay Portal, NodeJS, Web Services (SOAP, Restful), LISA, Selenium, Appium, \nSwagger, \n• Database Management Systems: MySQL, Oracle, SQL Server and PosgreSQL. \n• IDEs: Eclipse, Netbeans, LISA, IntelliJ IDEA. \n• Operating Systems: Windows, Linux. \n• Tools: LISA ITKO (Test Automation tool), Selenium, Appium. \n• Cloud Platform: Amazon Web Services, Docker \nEDUCATION \n● Agriculture and Forestry University HCM, Major: Computer Science.  \nPROFESSIONAL EXPERIENCE  \n07/2017 – current: Cyfeer JSC \nTechnical Architect: \nProjects: CyHome \n●  Description : \n- \nBuilding new product version with new Mobile and Administration system.  \n●  Responsibilities : \n⁻ \nSelect technologies to apply into this project. \n⁻ \nDesign api documents with Swagger Editor. \n⁻ \nWork as a technical architecture, build backend system with spring cloud and docker, \nAWS. \n⁻ \nCollaborating with design team, advice UI/UX to design team and applied to product. \n⁻ \nDefine services and build each service with spring boot and assign member do tasks. \n⁻ \nUse Jira to assign tasks to member and manage product as a scrum master. \n● Technologies: Spring boot, Spring cloud ,Mongodb, AWS , Docker. \n01/2017 – 7/2017: VNNG IT \nTechnical Leader: \nProjects: PP-V2& Watt \n●  Description : \n- \nA system that enable clients access each/all internal services based on user’s permission.  \n●  Responsibilities : \n⁻ \nSelect technologies to apply into this project. \n⁻ \nDesign api document with Swagger Editor. \n⁻ \nWork as a full-stack developer to build entire project from frontend to backend, use \nAngular and Java. \n⁻ \nWrite Unit Test for all functions, all tiers. \n⁻ \nTesting each Api with Postman. \n● Technologies: Angular4, Java, Spring boot, restful web service, Swagger, Documentation-\ndrivenapidesign \n11/2016 – 01/2017: VNNG IT \nProject Leader/ Scrum Master \nProjects: SW-Ecom \n●  Description :  \n- \nSW-Ecom: An ecommerce system that enables User to buy/exchange electronic devices \neach other and protects user’s transactions. I have built this project from begin: Receive \nrequests from Product Owner and transfer to members,guide and design UI/UX with \ndesigner, studied and built project source code with Angular2/4,Webpack, Docker \nassigned tasks, supported member to develop. And joined to develop some features also. \n●  Responsibilities : \n⁻ \nDiscuss with CTO to choose technologies and apply into project. \n⁻ \nWork with Designer UI/UX to transfer Product Owner requirements, analyses and support \ndesigner to understand requirement. \n⁻ \nWork as a scrum master, use Jira, Bitbucket to manage member’s tasks \n⁻ \nAllocated and managed members and support them whenever they need.  \n⁻ \nSupport team member and deploy release code on Linux server. \n⁻ \nReview source code. \n⁻ \nBuilt and developed project using Documentation-drivenapi design. \n⁻ \nWorked as a full-stack developer with Angular and Java. \n● Technologies: Angular2/4, Webpack, Redux, NodeJS, Docker, Polymer Web Component, \nMicroservices, Light-4J, Light-Oauth2, Gradle, Oauth2, OpenID. \n01/2015 – 11/2016:FSOFT HCM \nSenior Java Developer \nProjects: WebScraper, SW-Ecom, RMS, Universal Profile, APG Control & Monitor \n●  Description :  \n⁻ \nWebScraper: A project that offer a service allows user to extract any kind of content on \nany websites and store them as an API for further use. I join this project as a team leader, \nanalyzed requirements with client, create WBS and assign members into this project.  \n⁻ \nRMS:Meteorological System that allow user can view all information about meteorology \nvia website and mobile application. Admin can manage and modify stations on all \nprovinces. My responsibility is creating fully requirement and create WBS, build project \nbackend with java, spring, MongoDB and allocated members into this project.  \n⁻ \nUniversal Profile: is system for profile creation and management. The user is able to view \nand pause on one device and then resume viewing on another device. It provides \nimportant feature with a seamless cross-platform experience designed around their \npersonalized tastes and needs. The system deploys a centralized personalization \nframework to achieve scalable architecture on multi products. \n⁻ \nAPG Control & Monitor: The APG Control & Monitor is a web-based application, running \non the EDS Portal (Guide Studio). It allows users to update the APG configuration and \nnotify all instances of all the affected subsystems. It also eases the process of adding or \nremoving an instance of an APG subsystem. APG Control & Monitor tracks the data from \nthe input to APG HE to the output from GD (Guide Driver).  \n●  Responsibilities:  \n⁻ \nChoose technologies and build backend project structure with Spring,MongoDB, Restful \nweb service. \n⁻ \nAllocated and managed members and support them whenever they need.  \n⁻ \nSupport team member and deploy release code. \n⁻ \nResearch and apply LISA tool to automation test. \n⁻ \nImplement data driven approach to automation test. \n⁻ \nDevelop Test cases and Coding to support UP Team applying automation test. \n⁻ \nWrite extended LISA library using Java to perform verification of JSON based responses. \n⁻ \nWrite library to update test result back to SpiraTeam tool which is test case management \nsystem. \n⁻ \nIntegrate LISA automation test script to Jenkins. \n⁻ \nCollaborate with other teams to apply automation test. \n⁻ \nSupport new members to work with LISA and automation test. \n● Technologies: CA LISA tool, Selenium and Java, Spring, MongoDB, NodeJS, AngularJS, \nAngular2/4,Webpack, Redux, NodeJS, Docker. \n10/2013 – 01/2015: Sunrise Software Solution \nProject: Alfresco ECM (5/2014 – 01/2015) \n• Description: Alfresco ECMis a system that used to manage all documents of organization, it \nhelps manager pre-process before storing any documents that submitted by internal staffs, so \nthat company can get process certification ISO-27001. \n●  Responsibilities:  \n⁻ \nResearch new technologies to create mock project and directly report to Manager. \n⁻ \nDevelop internal system which helps company to get ISO Certification 27001 and manage \ndocumentation of all departments \n⁻ \nPresent Seminars to all team’s developers. \n●  Technologies:  \n⁻ \nAlfresco ECM, Liferay Portal, JSF, Maven SDK. \n⁻ \nRestful Web services, WSO2 ESB, Spring, MongoDB, PosgreSQL, NodeJS, Eclipse. \nProject: Mono-Connector (10/2013– 05/2014) \n• Description: Develop a Cloud Connector of WSO2 ESB which integrates to third parties: \nMonoloop and ExactTarget, this engine use APIs from both services to collect and analyze all \nand user’s activities when they work on internet: Monoloop collect activities, analyze and pre-\nprocess data before send to ExactTarget, it uses that data to create email marketing tragedy \nbefore sending marketing emails to customer. \n●  Responsibilities:  \n⁻ \nResearch and developed a cloud Connector which connects WSO2 ESB to third parties \n(Monoloop, ExactTarget).  \n⁻ \nResearch and understand how to develop a recommendations engine by using open \nsource libraries: Neco4J & Reco4J. \n● Technologies: Restful Web services, WSO2 ESB, Spring, Reco4J, Neo4J, Eclipse, Maven. \n03/2013– 10/2013:Fosft HCM \nSenior Java Developer – Team Leader \nProject: N-RSVP \n• Description: Develop system that supports NETS (a biggest BANK in Singapore) to manage all \nmerchants and their financial transactions on POS machines in Malls. System need to \nsynchronized transactions between server and user’s flash-pay card to ensure about data \nconsistency. \n●  Responsibilities:  \n⁻ \nDevelop project structure from beginning and share knowledge to member to use it. \n⁻ \nWork as team leader, train and manage member’s task, supports them to solve technical \nissues. \n⁻ \nCollaborate with QA to complete PM tasks such as: CM Plan, CM Report, task \nmanagement. \n● Technologies:  \n⁻ \nSpring, Spring LDAP, Spring Security, Spring MVC, Hibernate, LDAP, HTML, CSS, Bootstrap. \n⁻ \nEclipse, Maven, ApacheDS Server, MySQL, Linux Fedora. \n06/2012– 09/2013:MService \nSenior Java Developer \nProject: MS-WU Gateway \n• Description: Develop a gateway that transfers money from Western Union system to MOMO \ne-wallet. It helps MOMO’s User can transfer their money from Western Union and then \narchive it by bank account or MOMO’s agencies. \n●  Responsibilities:  \n⁻ \nDiscuss with Partner and Manager to finalize functionalities of application. \n⁻ \nDeveloped application and executed testing phases with OPUSSOSFT’s staffs from India, \nSingapore and US. \n⁻ \nWrite Technical Document and transfer knowledge to IT Department. \n● Technologies: Java Core, JDBC, SOAP Web Services, Utiba Core, Eclipse, Redmine, Oracle \n02/2010 – 02/2012: Individual System \n.NET Developer (04/2011– 02/2012) \nProject: DPMS, HBF Conversion, Kumon Description:  \n• Description:  \n⁻ \nDPMS: an internal system that manages organization’s data like employees and \nproperties. \n⁻ \nHBF Conversion: converting a sub-system of Hitachi Global Service from java (JSP) to C# \n(web form).  \n⁻ \nKumon: a system that allow Managers to manage all Employees’ information: salary, \nposition and manage how and when to promote anyone via their achievement in \norganization. \n●  Responsibilities:  \n⁻ \nDeveloped task which assigned from Project Leader \n⁻ \nExecuted Unit & Integration test  \n● Technologies: Java, JSP, Servlet, HTML/CSS, Redmine, Eclipse, Oracle, WebSphere Server, C#, \nAsp.net web form. \nJava Developer (02/2010– 02/2011) \nProject: UVAS \n• Description: A project that developed embedded core system from IBM \n• Responsibilities:  \n⁻ \nDeveloped task which assigned from Project Leader \n⁻ \nExecuted Unit & Integration test  \n● Technologies: \n⁻ \nSQL, DB2, Store Procedure \n⁻ \nRedmine, Eclipse, MySQL. \n06/2009 – 02/2010(Freelancer) \nJava Developer \nProject: Photo Gallery, Website News \n●  Description : \n⁻ \nPhoto Gallery:  Design and Developed a Photo Gallery that help user can store and \nmanage their photos via web interface. \n⁻ \nWebsite News: Design and Developed a system that provide latest news about all \ncurrencies, rates for gold, stock, oil, …User must pay to access site’s resources and \ninformation. \n●  Responsibilities:  \n⁻ \nDesigned Layout and Developed whole website as a full stack developer. \n⁻ \nExecuted Unit & Integration test. \n● Technologies:  \n⁻ \nPHP, Smarty, Scriptaculous, HTML, CSS, MySQL. \n⁻ \nJava, JSP, Servlet, Hibernate, Photoshop. \nThank you for reading my CV! ", "educations": [{"id": 4581, "gpa": null, "major": "Khoa học máy tính", "school": "Agriculture and Forestry University HCM", "diploma": "Bachelors", "end_time": null, "conf_score": 0.795966882854041, "start_time": null, "picklist_major": "IT - Hardware/Networking", "major_categories": "Máy tính và công nghệ thông tin", "major_categories_detail": "Máy tính"}], "experiences": [{"id": 15275, "detail": ": Projects: CyHome ● Description : - Building new product version with new Mobile and Administration system.\n● Responsibilities : − Select technologies to apply into this project.\n− Design api documents with Swagger Editor. − Work as a technical architecture, build backend system with spring cloud and docker,\nAWS. − Collaborating with design team, advice UI/UX to design team and applied to product.\n− Define services and build each service with spring boot and assign member do tasks.\n− Use Jira to assign tasks to member and manage product as a scrum master.\n● Technologies: Spring boot, Spring cloud ,Mongodb, AWS , Docker.", "company": "Cyfeer JSC", "end_time": "2023-04-13T00:00:00Z", "industry": "Other", "position": "Technical Architect", "conf_score": 0.9380559850414887, "start_time": "2017-07-01T00:00:00Z"}, {"id": 15276, "detail": ": Projects: PP-V2& Watt ● Description : - A system that enable clients access each/all internal services based on user’s permission.\n● Responsibilities : − Select technologies to apply into this project.\n− Design api document with Swagger Editor.", "company": "VNNG IT", "end_time": "2017-07-31T00:00:00Z", "industry": "Other", "position": "Technical Leader", "conf_score": 0.9174648511369632, "start_time": "2017-01-01T00:00:00Z"}, {"id": 15277, "detail": "h Designer UI/UX to transfer Product Owner requirements, analyses and support designer to understand requirement.\n− Work as a scrum master, use Jira, Bitbucket to manage member’s tasks\n− Allocated and managed members and support them whenever they need.\n− Support team member and deploy release code on Linux server.\n− Review source code.\n− Built and developed project using Documentation-drivenapi design.\n− Worked as a full-stack developer with Angular and Java. ● Technologies: Angular2/4, Webpack, Redux, NodeJS, Docker, Polymer Web Component, Microservices, Light-4J, Light-Oauth2, Gradle, Oauth2, OpenID. • Description: Develop system that supports NETS (a biggest BANK in Singapore) to manage all merchants and their financial transactions on POS machines in Malls. System need to synchronized transactions between server and user’s flash-pay card to ensure about data consistency.\n● Responsibilities: − Develop project structure from beginning and share knowledge to member to use it.\n− Work as team leader, train and manage member’s task, supports them to solve technical issues.\n− Collaborate with QA to complete PM tasks such as: CM Plan, CM Report, task management.\n● Technologies: − Spring, Spring LDAP, Spring Security, Spring MVC, Hibernate, LDAP, HTML, CSS, Bootstrap. − Eclipse, Maven, ApacheDS Server, MySQL, Linux Fedora.", "company": "VNNG IT", "end_time": "2017-01-31T00:00:00Z", "industry": "Other", "position": "Project Leader/ Scrum Master", "conf_score": 0.9040113918355452, "start_time": "2016-11-01T00:00:00Z"}, {"id": 15278, "detail": "Projects: WebScraper, SW-Ecom, RMS, Universal Profile, APG Control & Monitor ● Description : − WebScraper: A project that offer a service allows user to extract any kind of content on any websites and store them as an API for further use. I join this project as a team leader, analyzed requirements with client, create WBS and assign members into this project.\n− RMS:Meteorological System that allow user can view all information about meteorology via website and mobile application. Admin can manage and modify stations on all provinces. My responsibility is creating fully requirement and create WBS, build project backend with java, spring, MongoDB and allocated members into this project.\n− Universal Profile: is system for profile creation and management. The user is able to view and pause on one device and then resume viewing on another device. It provides important feature with a seamless cross-platform experience designed around their personalized tastes and needs. The system deploys a centralized personalization framework to achieve scalable architecture on multi products.\n− APG Control & Monitor: The APG Control & Monitor is a web-based application, running on the EDS Portal (Guide Studio). It allows users to update the APG configuration and notify all instances of all the affected subsystems. It also eases the process of adding or removing an instance of an APG subsystem. APG Control & Monitor tracks the data from the input to APG HE to the output from GD (Guide Driver). ● Responsibilities: − Choose technologies and build backend project structure with Spring,MongoDB, Restful web service.\n− Allocated and managed members and support them whenever they need.\n− Support team member and deploy release code.\n− Research and apply LISA tool to automation test.\n− Implement data driven approach to automation test.\n− Develop Test cases and Coding to support UP Team applying automation test.\n− Write extended LISA library using Java to perform verification of JSON based responses.\n− Write library to update test result back to SpiraTeam tool which is test case management system.\n− Integrate LISA automation test script to Jenkins. − Collaborate with other teams to apply automation test.\n− Support new members to work with LISA and automation test.\n● Technologies: CA LISA tool, Selenium and Java, Spring, MongoDB, NodeJS, AngularJS, Angular2/4,Webpack, Redux, NodeJS, Docker.", "company": "FSOFT HCM", "end_time": "2016-11-30T00:00:00Z", "industry": "Other", "position": "Senior Java Developer", "conf_score": 0.830738895005311, "start_time": "2015-01-01T00:00:00Z"}, {"id": 15279, "detail": ") • Description: Alfresco ECMis a system that used to manage all documents of organization, it helps manager pre-process before storing any documents that submitted by internal staffs, so that company can get process certification ISO-27001. ● Responsibilities: − Research new technologies to create mock project and directly report to Manager. − Develop internal system which helps company to get ISO Certification 27001 and manage documentation of all departments\n− Present Seminars to all team’s developers.\n● Technologies: − Alfresco ECM, Liferay Portal, JSF, Maven SDK. − Restful Web services, WSO2 ESB, Spring, MongoDB, PosgreSQL, NodeJS, Eclipse. Project: Mono-Connector (10/20", "company": "Sunrise Software Solution", "end_time": "2015-01-31T00:00:00Z", "industry": "High Technology", "position": null, "conf_score": 0.8252991284527994, "start_time": "2013-10-01T00:00:00Z"}, {"id": 15280, "detail": "", "company": "Fosft HCM", "end_time": "2013-10-31T00:00:00Z", "industry": "Other", "position": null, "conf_score": 0.8025987250525485, "start_time": "2013-03-01T00:00:00Z"}, {"id": 15281, "detail": "Project: MS-WU Gateway • Description: Develop a gateway that transfers money from Western Union system to MOMO e-wallet. It helps MOMO’s User can transfer their money from Western Union and then archive it by bank account or MOMO’s agencies.\n● Responsibilities: − Discuss with Partner and Manager to finalize functionalities of application.\n− Developed application and executed testing phases with OPUSSOSFT’s staffs from India, Singapore and US. − Write Technical Document and transfer knowledge to IT Department. ● Technologies: Java Core, JDBC, SOAP Web Services, Utiba Core, Eclipse, Redmine, Oracle", "company": "MService", "end_time": "2013-09-30T00:00:00Z", "industry": "Other", "position": "Senior Java Developer", "conf_score": 0.8648336255873691, "start_time": "2012-06-01T00:00:00Z"}, {"id": 15282, "detail": "Project: DPMS, HBF Conversion, Kumon Description: • Description: − DPMS: an internal system that manages organization’s data like employees and properties.\n− HBF Conversion: converting a sub-system of Hitachi Global Service from java (JSP) to C# (web form).\n− Kumon: a system that allow Managers to manage all Employees’ information: salary, position and manage how and when to promote anyone via their achievement in organization.\n● Responsibilities: − Developed task which assigned from Project Leader − Executed Unit & Integration test\n● Technologies: Java, JSP, Servlet, HTML/CSS, Redmine, Eclipse, Oracle, WebSphere Server, C#, Asp.net web form.", "company": "Individual System", "end_time": "2012-02-29T00:00:00Z", "industry": "Other", "position": ".NET Developer", "conf_score": 0.8638832033833036, "start_time": "2011-04-01T00:00:00Z"}, {"id": 15283, "detail": "• Description: A project that developed embedded core system from IBM • Responsibilities: − Developed task which assigned from Project Leader − Executed Unit & Integration test\n● Technologies: − SQL, DB2, Store Procedure − Redmine, Eclipse, MySQL.", "company": "UVAS", "end_time": "2011-02-28T00:00:00Z", "industry": "Other", "position": "Java Developer", "conf_score": 0.8994806984696452, "start_time": "2010-02-01T00:00:00Z"}], "address": null}