{"skills": ["stack", "database schema", "java", "ams", "rest", "management", "frontend development", "elasticsearch", "git", "svn", "devops", "structure", "project management", "redis", "teamcity", "css", "software development", "testing", "game server", "backend development", "database", "full stack development", "mysql", "html"], "fulltext": "Phung Manh Cuong \nSenior Software Engineer \nSummary \nSoftware Engineer with more than 5 years experiences, particularly interested in software development \ntechniques that help create simple solutions for complex problems. I am passionate about modern software \ndevelopment which lead me continue learning new technologies and constantly skill improvement. \nI love the idea about business first thinking/approarch that's the most important when working on Product's \nenvironment. Moreover, looking for interesting idea to build a strong/userful product in effective way, \nthen sharing with others are the things I love to and try to do time by time. \nEducation \nB.S., Computer Science, HCM University of Technology, 2013 \nWork Experience \nSeptemper 2017 - Present, Senior Backend Developer, Contentnet Ltd \nVideofly Dev Team \nSetup and manage the CI/CD system (TeamCity), design and implement release process. \nResearch, design and implement recommend system (Mahout, Spark, PredictionIO). \nWorks as DevOps that setup and monitoring production and staging enviroment. \nWork with developers to get the feedback about processing and with QA to decide what \nfeatures should be released/deployed for next step. \nMigrate all things from old infrastructe (Redis, Elasticsearch, SVN) to a lot of better one (MySQL, \nElasticsearch, GIT). \nSeptemper 2016 - August 2017, Senior Backend Developer, Lifestyle Project Management \nTimo Backend Team \nWrite efficient and testable code, make the code self-testing as much as posible. \nRefactoring the legacy code, step by step make code cleaner and optimizing it. \nJoin to discuss bussines requirement with others team and support QA team. \nMaintaining the system and step by step build supporting tools to manage the system. \nAugust 2015 - August 2016, Java Backend Developer, Big-Labs Pre Ltd \nSmart Shopping Mall \nAnalyse business and generate dump data. \nGenerate dumps data that support for QC/QA teams. \nImplement report engine via BigLabs's customer requirements. \nDesign UX/UI and implememnt visualize tools. \nWork with Frontend and leader to design API via REST style. \nAugust 2014 - July 2015, Full Stack Developer, Hoiio Pre Ltd. \nConference Application \nWork with others to design new UI which make user comfortable to use. \nDesign and implement both front-end and back-end. \nDesign and write document REST API, support for other departments. \nMigrate data from old version application \nDirectory Application \nRefactor the code, re-write all the application both front-end and back-end. \nDesign new database schema that more compatible with new requirement \nMigrate data from MySQL to new data-store (Elasticsearch). Design and \nimplement REST API, writing document. Support others App Owner to \nintegrate with Directory App. Step by step improve the code quality, \nadding new feature. \nStaff Application \nRefactoring the code and step by step adding new feature. \nDesign and implement back-end, front-end \nIntegrate with other Hoiio's application \nConvert UI implement from imagines to Frontend code in HTML, CSS \nAugust 2013 - July 2014, Java Backend Developer, HDC. \nServer Game SkyGradern \nDiscuss with others to get the feedback about the game-server and create new feature \nImprove performance of database and the backend codebase, step by step refactoring. \nDesign and implement the api for the mobile team, dicuss with them about request and response \nstructure between client and server \nHelping QA team testing some feature that can't be tested from Frontend \nDynamic configuration: step by step move all the config from file to database table, update config \nevery 5 second \nWeb Crawler \nImplement a web crawler that get info some webpage (livescore.com, flashscore.com.au) and push \nupdate to other system \nKey Skill \nEnglish communication \nJava programing language \nMySQL, Elasticsearch \nBig data platform: Hadoop2 + Spark \nFrontend skills ", "educations": [{"id": 4582, "gpa": null, "major": "Khoa học máy tính", "school": "HCM University of Technology", "diploma": "Bachelors", "end_time": "2013-01-01T00:00:00Z", "conf_score": 0.8464256548178335, "start_time": null, "picklist_major": "IT - Hardware/Networking", "major_categories": "Máy tính và công nghệ thông tin", "major_categories_detail": "Máy tính"}], "experiences": [{"id": 15284, "detail": "Videofly Dev Team Setup and manage the CI/CD system (TeamCity), design and implement release process.\nResearch, design and implement recommend system (Mahout, Spark, PredictionIO). Works as DevOps that setup and monitoring production and staging enviroment.\nWork with developers to get the feedback about processing and with QA to decide what features should be released/deployed for next step.\nMigrate all things from old infrastructe (Redis, Elasticsearch, SVN) to a lot of better one (MySQL, Elasticsearch, GIT).", "company": "Contentnet Ltd", "end_time": "2023-04-13T00:00:00Z", "industry": "Other", "position": "Senior Backend Developer", "conf_score": 0.9142206543796373, "start_time": "2017-01-01T00:00:00Z"}, {"id": 15285, "detail": "Write efficient and testable code, make the code self-testing as much as posible.\nRefactoring the legacy code, step by step make code cleaner and optimizing it.\nJoin to discuss bussines requirement with others team and support QA team.\nMaintaining the system and step by step build supporting tools to manage the system.", "company": "Timo Backend Team", "end_time": "2017-08-31T00:00:00Z", "industry": "Other", "position": "Senior Backend Developer, Lifestyle Project Management", "conf_score": 0.7930238043945285, "start_time": "2016-01-01T00:00:00Z"}, {"id": 15286, "detail": "mart Shopping Mall Analyse business and generate dump data.\nGenerate dumps data that support for QC/QA teams.\nImplement report engine via BigLabs's customer requirements.\nDesign UX/UI and implememnt visualize tools.\nWork with Frontend and leader to design API via REST style.", "company": "Big - Labs Pre Ltd", "end_time": "2016-08-31T00:00:00Z", "industry": "Other", "position": "Java Backend Developer", "conf_score": 0.8044329014146352, "start_time": "2015-08-01T00:00:00Z"}, {"id": 15287, "detail": "Conference Application Work with others to design new UI which make user comfortable to use.\nDesign and implement both front-end and back-end.\nDesign and write document REST API, support for other departments.\nMigrate data from old version application\nDirectory Application Refactor the code, re-write all the application both front-end and back-end.\nDesign new database schema that more compatible with new requirement\nMigrate data from MySQL to new data-store (Elasticsearch). Design and implement REST API, writing document. Support others App Owner to integrate with Directory App. Step by step improve the code quality, adding new feature.\nStaff Application Refactoring the code and step by step adding new feature.\nDesign and implement back-end, front-end\nIntegrate with other Hoiio's application\nConvert UI implement from imagines to Frontend code in HTML, CSS", "company": "Hoiio Pre Ltd.", "end_time": "2015-07-31T00:00:00Z", "industry": "Other", "position": "Full Stack Developer", "conf_score": 0.9142206543796373, "start_time": "2014-08-01T00:00:00Z"}, {"id": 15288, "detail": ". Server Game SkyGradern Discuss with others to get the feedback about the game-server and create new feature\nImprove performance of database and the backend codebase, step by step refactoring.\nDesign and implement the api for the mobile team, dicuss with them about request and response structure between client and server\nHelping QA team testing some feature that can't be tested from Frontend Dynamic configuration: step by step move all the config from file to database table, update config every 5 second\nWeb Crawler Implement a web crawler that get info some webpage (livescore.com, flashscore.com.au) and push update to other system", "company": "HDC", "end_time": "2014-07-31T00:00:00Z", "industry": "Other", "position": "Java Backend Developer", "conf_score": 0.8044329014146352, "start_time": "2013-08-01T00:00:00Z"}], "address": null}