{"skills": ["budgeting", "supply chain", "phone call", "administration", "analysis", "customer relationship management", "database management", "digital content", "microsoft", "accounting", "marketing", "sales", "sell", "payment", "database", "protocol", "event promotion", "excel", "sales and marketing", "online social network", "marketing communications", "recruitment", "relationship management", "management", "tv ads"], "fulltext": "HA THI THU TRANG \n PERSONAL INFORMATION \nPersonal Information: \nAddress: \nFull name: Ha Thi Thu Trang \n                Hanoi City. \nBirthday:  24  December  1987  \nGender: Female \nOBJECTIVES \nTo work in a professional working environment with open chance to \nbe promoted To deal with planning, marketing, PR jobs \n KEY SKILLs \nPersonal Skills \nHaving good knowledge and experiences in marketing, branding management, planning & PR \nfields Having good communication and negotiating skills in both Vietnamese and English. \nAbility to communicate effectively at many different levels and \nmethods Ability to use digital recording devices, edit and upload \ndigital content Ability to work under pressure and maintain deadlines \nMaintaining confidentiality \nComputer literate and be excellent in Microsoft Word, Excel, Power point and SPSS \nStatistics. \nAble to work with the other prefects to ensure the smooth running of events, motivate \nworkmates to participate and succeed in these events. \nBe active member of company and know what it takes to make a successful team. \nAble to manage time to make sure that all work are got done. \nAble to set up tight deadlines to balance with prioritized work. \nFocused and willing to learn \nHaving a very clear career goal to focus on and \nwork towards. Be willing to learn from workmates. \nAWARD \nAward for the best employee in contribution for sale growth in 2015 from Head Quarter in Japan \n WORK EXPERIENCES \nPanasonic Vietnam Co., Ltd – Panasonic Sales Vietnam Division 2014 – present \nPosition: Marketing Assistant Manager \nI. GENERAL MANGEMENT ROLE \nResponsible for making marketing plan quarterly & yearly. \nResponsible for managing staffs & outsourced vendors to ensure everything go on right progress \nResponsible for the coordination & execution of all marketing & communication \nactivities of company including ATL, BTL, branding activities \nResponsible for the performance of all marketing & branding activities to achieve the \nKPI by leading, managing & motivating team. \nDevelop the communication strategy, action plan & content direction for regular \nactivities & launching events to increase company’s brand awareness. \nPrepare reports & other tracking measures in order to track the performance of marketing campaigns, \nII. DETAIL DESCRIPTION \n1. MARKETING PLANNING \nIn-charge to make marketing plan for whole air conditioner department of Panasonic \nVietnam Company (the department accounted for 50% income of Panasonic Vietnam) in \nATL, BTL & branding activities in each quarterly & yearly. \nSettle the overview of marketing activities for whole fiscal year. Work with other teams (sales, \nsupply chain, accounting & legal team) in Panasonic as well as other partners to implement \nadvertisement for each city, region and allocate POSM support. Focus on the pick season to \nlaunch events, activities, promotions to push sell-out & enhance the brand. Make activation plan \nin channels to push sell-out and improve the image of Panasonic in modern trade stores. \nNew ideas and improvement. \nControl budget, manage all activities for achieving KPI and timing management \n2. MARKETING EXECUTION \nPrepare ideas & plan to implement BTL activities (like dealer events, consumer events, \nroadshow…) and ATL activities in both traditional & digital advertisement like TV ads, \nOOH ads, Taxi ads, digital campaign on social networks, online ads, SEM, SEO, etc. \nOutside \ndisplay (Signboard)  for nationwide  Traditional  trade channel: work with Sales \nteam for  allocation  - \nwork with  supplier  for   Marquette, \ninstallation and   quality; \nInside display (Dummy, panel, light  box,  carton  box)  for \nnationwide traditional trade \nchannel:  Work  with  Sales  team  for  quantity  and  allocation -  work with \nfactory for \nproduction - work with supplier for installation and quality; \nInside  display  (Shelf  display)  for  nationwide  Modern  trade  channel  :  Work  with  modern \nelectronic stores for quantity and allocation - work with suppliers for installation and \nquality \nOther POSM ( leaflet, pricelist, wobblers, calendars) for nationwide market : work with \nBrand team for Marquette – work with supplier for printing, logistic and allocation \nWork  close  with  distributors,  retailers  to  maintain  the  POSM  display  and  support  them  for \nissues  at  sight  or  when  they  need  support  for  display  of  new  stores  of  their  channel \n3. MARKETING BUDGET MANAGEMENT \nPlan for marketing budget at the beginning of fiscal year \nReview, control and accrue budget every month to ensure it is not \nover the forecast Review and close budget in the end of fiscal year \nInspection and payment document process for agency/supplier after task \n4. MARKET SITUATION REPORT \nBuild close relation with distributors, retailers to track activities, events, promotion of \nPanasonic and competitors and report for reaction; \nGet  information  from  distributors,  retailers  about  issues  of  Panasonic  (Stock  available, logistic  \nand  delivery,  price,  after  sales  service)  and  report  to  Marketing  and  Sales  team  to \nhandle; \nYearly \ncollection report from monthly reports to show the overview of the market for \nwhole year, support sales team to forecast volume in \nthe next financial year; \n5. EVENT AND ACTIVITES \nKey person-in charge of all events in Panasonic Vietnam from making plan to execute, \nmaintain the quality & performance \nDealer Event: 4-8 events/year \nConsumer Event: run whole year \nDealer Trip: at least 4 trips/year \nVietnam Construction and Project Development Company (CPD Group) \n2011-2012 Position: Project Assistant \n1. Support Functions \nHelping in the clarification of the objectives and operations for a particular project or \nprogram \nHandling the logistics of the project-making agendas and developing the material to be \nused for the project. \nDesigning and editing materials for the program by laying out reports and materials for \nthe public, including brochures, newsletters and flyers. \nAttending the meeting or program to take minutes, collect information and prepare \ncorrespondence for participants. \nMaintaining and updating websites that are related to the \nproject or program. Responsible for recruitments \nGathering, analyzing and evaluating client’s requirements, managing and responding to \nchanges. \nConnecting to partners and manufacturers to select the most appropriate product \nmeeting client’s demand and company’s demand \nPropose business plan to the Board of Directors \nNegotiate sale contract with business partners \n2. Administrative Functions \nResponsible  for  a  liaison  between  project  directors,  coordinators  and  other  staff;  also \nperforms liaison duties between clients and staff working on the project. Adhering to \nprotocol for the transfer and dissemination of project information \nProviding other support functions, such as implementing the initial point of contact with \nproject participants or supporters \n3. Budgeting Functions \nSubmitting monthly budgets for projects and programs in an efficient manner includes \nsubmitting expense reports \nSolving financial issues with accounts, which require performing detailed research or \ntroubleshooting general financial problems \nHanoi Golden Plaza Hotel 2009-2011 \nPosition: Sales & Marketing Executive \n1. Supporting to develop annual marketing plans \nPreparing products for showing and to availing potential customers \nRecording all sales and other related actives for the preceding month \nPreparing analysis indicating effective pricing of products and services \n2. Customer Relationship Management \nReceive and reply phone call and emails of customers and partners \nMonitor service standard for increasing customers’ satisfaction (tour guide, cruiser, \nrooms, bus and other suppliers) \nKeep a record on former, existing and potential clients. \nProvide service evaluation and ensure all complaints are thoroughly investigated, \nresolved and fed back with respective departments as necessary \n3. E-marketing Management \nEmail database management \nWebsite updating and monitoring \nRespond the review on travel forum (Trip Advisor, Lonely Planet …) \n4. Sale products \nSelling products related to tourism products (tours and tourism services) \n EDUCATION AND TRAINING \nFull scholarship of Chinese Culture University, Taiwan \n2012 – 2013 \nMaster of Business Administration – International Trade Department \nCanadian Embassy & World University Service of Canada (WUSC) \n2010  \nSustainable Tourism Training Course \nHanoi Open University \n2006 – 2011 \nBachelor of Business Administration - Faculty of Tourism \nThai Nguyen Specialized High School \n2002 - 2005 \nINTEREST \nTraveling and cooking ", "educations": [{"id": 4623, "gpa": null, "major": "Du lịch", "school": "Hanoi Open University", "diploma": "Bachelors", "end_time": "2011-01-01T00:00:00Z", "conf_score": 0.8144336096406013, "start_time": "2006-01-01T00:00:00Z", "picklist_major": "Other", "major_categories": "Du lịch, khách sạn, thể thao và dịch vụ cá nhân", "major_categories_detail": "Du lịch"}], "experiences": [{"id": 15450, "detail": "Vietnam Division I. GENERAL MANGEMENT ROLE Responsible for making marketing plan quarterly & yearly.\nResponsible for managing staffs & outsourced vendors to ensure everything go on right progress\nResponsible for the coordination & execution of all marketing & communication activities of company including ATL, BTL, branding activities\nResponsible for the performance of all marketing & branding activities to achieve the\nKPI by leading, managing & motivating team.\nDevelop the communication strategy, action plan & content direction for regular activities & launching events to increase company’s brand awareness.\nPrepare reports & other tracking measures in order to track the performance of marketing campaigns,\nII. DETAIL DESCRIPTION 1. MARKETING PLANNING In-charge to make marketing plan for whole air conditioner department of Panasonic Vietnam Company (the department accounted for 50% income of Panasonic Vietnam) in\nATL, BTL & branding activities in each quarterly & yearly.\nSettle the overview of marketing activities for whole fiscal year. Work with other teams (sales, supply chain, accounting & legal team) in Panasonic as well as other partners to implement advertisement for each city, region and allocate POSM support. Focus on the pick season to launch events, activities, promotions to push sell-out & enhance the brand. Make activation plan in channels to push sell-out and improve the image of Panasonic in modern trade stores.\nNew ideas and improvement.\nControl budget, manage all activities for achieving KPI and timing management\nOutside display (Signboard) for nationwide Traditional trade channel: work with Sales team for allocation - work with supplier for Marquette, installation and quality;\nInside display (Dummy, panel, light box, carton box) for nationwide traditional trade channel: Work with Sales team for quantity and allocation - work with factory for production - work with supplier for installation and quality;\nInside display (Shelf display) for nationwide Modern trade channel : Work with modern electronic stores for quantity and allocation - work with suppliers for installation and quality\nOther POSM ( leaflet, pricelist, wobblers, calendars) for nationwide market : work with\nBrand team for Marquette - work with supplier for printing, logistic and allocation\nWork close with distributors, retailers to maintain the POSM display and support them for issues at sight or when they need support for display of new stores of their channel", "company": "Panasonic Vietnam Co., Ltd", "end_time": "2023-04-13T00:00:00Z", "industry": "Manufacturing", "position": "Marketing Assistant Manager", "conf_score": 0.8491052071194641, "start_time": "2014-01-01T00:00:00Z"}, {"id": 15451, "detail": ". Support Functions Helping in the clarification of the objectives and operations for a particular project or program\nHandling the logistics of the project-making agendas and developing the material to be used for the project.\nDesigning and editing materials for the program by laying out reports and materials for the public, including brochures, newsletters and flyers.\nAttending the meeting or program to take minutes, collect information and prepare correspondence for participants.\nMaintaining and updating websites that are related to the project or program. Responsible for recruitments\nGathering, analyzing and evaluating client’s requirements, managing and responding to changes.\nConnecting to partners and manufacturers to select the most appropriate product meeting client’s demand and company’s demand\nPropose business plan to the Board of Directors Negotiate sale contract with business partners\n2. Administrative Functions Responsible for a liaison between project directors, coordinators and other staff; also performs liaison duties between clients and staff working on the project. Adhering to protocol for the transfer and dissemination of project information\nProviding other support functions, such as implementing the initial point of contact with project participants or supporters\n3. Budgeting Functions Submitting monthly budgets for projects and programs in an efficient manner includes submitting expense reports\nSolving financial issues with accounts, which require performing detailed research or troubleshooting general financial problems", "company": "Vietnam Construction and Project Development Company (CPD Group)", "end_time": "2012-01-31T00:00:00Z", "industry": "High Technology", "position": "Project Assistant", "conf_score": 0.9355788230522663, "start_time": "2011-01-01T00:00:00Z"}, {"id": 15452, "detail": ". Supporting to develop annual marketing plans\nPreparing products for showing and to availing potential customers\nRecording all sales and other related actives for the preceding month\nPreparing analysis indicating effective pricing of products and services\n2. Customer Relationship Management Receive and reply phone call and emails of customers and partners\nMonitor service standard for increasing customers’ satisfaction (tour guide, cruiser, rooms, bus and other suppliers)\nKeep a record on former, existing and potential clients.\nProvide service evaluation and ensure all complaints are thoroughly investigated, resolved and fed back with respective departments as necessary\n3. E-marketing Management Email database management\nWebsite updating and monitoring\nRespond the review on travel forum (Trip Advisor, Lonely Planet ...) 4. Sale products\nSelling products related to tourism products (tours and tourism services)", "company": "Hanoi Golden Plaza Hotel", "end_time": "2011-01-31T00:00:00Z", "industry": "Other", "position": "Sales & Marketing Executive", "conf_score": 0.93297463704607, "start_time": "2009-01-01T00:00:00Z"}], "address": "Hanoi City."}