{"skills": ["networking", "administration", "analysis", "internet", "rss", "project management", "marketing", "sales", "sell", "make decision", "digital marketing", "crm", "implementation", "creative thinking", "operations management", "futures", "programmatic buying", "recruitment", "identity", "management", "medium", "storage management"], "fulltext": "s\n+HCMC, Vietnam\nBranding & Campaign Manager \nEXPERIENCE \nProject Manager \nNavigos Group \n07/2017 - Ongoing \nHCMC, Vietnam \nProvide overall project management and compliance \n•\nProject phase in, phase out, transition and sustainability planning and\nextension of project as required.\n•\nPhase and Yearly budget, details implementation plan, and\noperational strategy are in place and approved in line with Project\nDesign and donor requirements.\n•\nRegular meetings conducted among Project team including\nconsortium members on progress work and further analysis on\nneeds for change to partner requests through open and constant\nchannels of communications with partners.\n•\nProvide strong servant leadership, encourage, support, coach and\nmentor the project team, ensuring capacity is built and appropriate\nresults are attained.\n•\nDevelop and ensure appropriate tools and strategy to monitor the\nprogress and quality and impact of the project and is implemented\n•\nAssist in resolving issues that comes up during project\nimplementation.\n•\nImmediately communicate significant issues that may come across\nto supervisor\n•\nLead the recruitment process in the Project team whenever the\ncase arises to hire new staff to manage the projects\nSales Manager \nAppier \n  01/2017 - 07/2017 \nHCMC, Vietnam \n•\nProactively contact new and existing clients and educate, propose and\nsecure buy-in on Digital Marketing.\n•\nIdentify, propose and sell programs to targeted organizations within\nthe target markets set out by the company.\n•\nDevelop an understanding of client’s business, products, services,\ncustomer profile, marketing and business objectives, competitors and\nsales\n•\nProvide excellent level of professionalism and service in responding to\ngeneral and customized client requests.\n•\nBe an influencer in digital marketing to businesses in the market.\n•\nUnderstand all new products and their roles.\n•\nResponsible for special projects as assigned.\nMOST PROUD OF \nInspired to young generation to \nbuild their \"own brand\". \nSpeaker of some talk shows at Wall Street \nEnglish Centers, high schools. \nDeveloped Strong Brand \nidentity across all channels and touch \npoints (online and offline) while \nconsistently delivering our brand story \nLANGUAGES \nVietnamese \nProficient \nEnglish \nProficient \nKEY SKILLS \nIdentify Market Segment \nLeadership \nCreative Thinking \nCampaign Management \nr \n+ \nEXPERIENCE \nSales & Marketing Manager \nVe Interactive, Asia Ltd. \n01/2015-01/2017 \nHCMC,Vietnam \nVe Interactive is a multi-award-winning technology company, serving over \n10,000 e commerce clients around the world. Working in 19 languages \nand with 26 offices worldwide, we implement online efficiency strategies \nfor domestic and multinational retailers, increasing their online \nconversions by an average of 25%. \nSpecialties: \nRe-targeting, Re-engagement, Conversion optimization, Website \nabandonment, e-commerce, digital marketing, Performance Marketing, \nProgrammatic buying. \n•\nPerformed frequent and effective networking with a variety of business\npartners and customers.\n•\nBuilt strong, lasting relationships with market players.\n•\nBuilt and maintained lasting and productive contacts with the media\n•\nLinked between suppliers, media and company clients.\n•\nOrganized marketing research to implement brand awareness.\n•\nDefined, researched and monitor the market opportunities in Vietnam.\n•\nConducted customer surveys to analyze the demands of the market.\n•\nAnalyzed product and market pricing on a regular basis.\nSales training in Hong Kong and Singapore twice/ 3months.\n•\nHelped manage the administration, legal and financial duties of the\noffice.\n•\nManaged digital campaign across various media and demonstrate a\npassion for excellent client servicing and project management.\n•\nDiscovered and developed opportunities for marketing that involved\nadvertising on the Internet, regional/national as well as specialist\npublications.\n•\nManaged the production of marketing materials.\n•\nInvolved in all the 360-degreeintegrated marketing brainstorming and\nplanning session regarding the scale of the client’s campaign.\nBusiness Development Manager \nKC Media \n 10/2013 - 03/2015 \nHCMC, Vietnam \nThis position works to improve KC Media market position and achieve \nfinancial growth then defines long-term organizational strategic goals, \nbuilds key customer relationships, identifies business opportunities, \nnegotiates and closes business deals and maintains extensive knowledge \nof current market conditions. It is my job to work with the internal team, \nmarketing staff, and other managers to increase sales opportunities and \nthereby maximize revenue. The key responsibility is to find potential new \ncustomers, present to them, ultimately convert them into clients, and \ncontinue to grow business in the future. Furthermore, this will also help \nmanage existing clients and ensure they stay satisfied and positive. \n•\nProspected for potential new clients and turn this into increased\nbusiness.\n•\nMet potential clients by growing, maintaining, and leveraging your\nnetwork.\nEDUCATION \nDiploma in Business \nAdministration \nNCC Education Global Organization - UK \nTOEIC Test (520/600) \n& English Proficiency \nCourse in 7 years \nVATC \nSUMMARY \n9+ years of in-depth involvement in all levels \nof marketing & sales, having sound knowledge \nof marketing & sales strategies and its \nprinciples, quick grasp of new technologies \nand market trends, with the ability to formulate \nstrategies, make decisions, organizational \nskills and plan with confidence. \n•\nIdentified potential clients, and the decision makers within the client\norganization.\n•\nResearched and build relationships with new clients.\n•\nSet up meetings between client decision makers and company’s\npractice leaders/Principals.\n•\nWorked with marketing staff to ensure that prerequisites (like\nqualification or getting on a vendor list) are fulfilled within a timely\nmanner.\n•\nEnsured all team members represent the company in the best light.\n•\nPresented business development training and mentoring to business\ndevelopers and other internal staff.\n•\nResearched and develop a thorough understanding of the company’s\npeople and capabilities.\n•\nUnderstood the company’s goal and purpose so that will continual to\nenhance the company’s performance.\n5 Years in High Fashion Retail Industry & Interior Design \nRalph Lauren, Crocodile, Kartell Flagship Store, Van Laack. \n02/2008 - 08/2013\nH HCMC, Vietnam \n-\nMy journey in fashion world started from a question: Why do they can pay\nfive thousand dollars for a bag or an evening gown? This question increased\nmy curiosity to make me have to find out the answer.\n-\nHalf of the decade, I gained many valuable experiences in many working\nfields such as: Operation Management, CRM & POS System, Storage\nManagement, Import & Export product or facility, Strategy Planning in Sales\n& Marketing, Financial Management. Started as a Fashion Consultant in\nVan Laack, I always followed my goal to reach to the level of Senior\nManager. Fortunately, I had a great chance to work for Crocodile Vietnam as\nthe Brand Manager in nearly 2 years.", "educations": [{"id": 4650, "gpa": null, "major": "Quản lý đô thị và công trình", "school": "NCC Education", "diploma": "Other", "end_time": null, "conf_score": 0.8385731314027556, "start_time": null, "picklist_major": "Architecture / Interior Design", "major_categories": "Kiến trúc và xây dựng", "major_categories_detail": "Kiến trúc và quy hoạch"}], "experiences": [{"id": 15544, "detail": "- Ongoing HCMC, Vietnam Provide overall project management and compliance\n• Project phase in, phase out, transition and sustainability planning and extension of project as required.\n• Phase and Yearly budget, details implementation plan, and operational strategy are in place and approved in line with Project Design and donor requirements.\n• Regular meetings conducted among Project team including consortium members on progress work and further analysis on needs for change to partner requests through open and constant channels of communications with partners.\n• Provide strong servant leadership, encourage, support, coach and mentor the project team, ensuring capacity is built and appropriate results are attained.\n• Develop and ensure appropriate tools and strategy to monitor the progress and quality and impact of the project and is implemented\n• Assist in resolving issues that comes up during project implementation.\n• Immediately communicate significant issues that may come across to supervisor\n• Lead the recruitment process in the Project team whenever the case arises to hire new staff to manage the projects", "company": "Navigos Group", "end_time": "2017-12-31T00:00:00Z", "industry": "Other", "position": "Project Manager", "conf_score": 0.8777332888374383, "start_time": "2017-07-01T00:00:00Z"}, {"id": 15545, "detail": "HCMC, Vietnam • Proactively contact new and existing clients and educate, propose and secure buy-in on Digital Marketing. • Identify, propose and sell programs to targeted organizations within the target markets set out by the company.\n• Develop an understanding of client’s business, products, services, customer profile, marketing and business objectives, competitors and sales\n• Provide excellent level of professionalism and service in responding to general and customized client requests.\n• Be an influencer in digital marketing to businesses in the market.\n• Understand all new products and their roles.\n• Responsible for special projects as assigned.", "company": "Navigos Group", "end_time": "2017-07-31T00:00:00Z", "industry": "Other", "position": "Sales Manager Appier", "conf_score": 0.8086621310791741, "start_time": "2017-01-01T00:00:00Z"}, {"id": 15546, "detail": "CMC,Vietnam Ve Interactive is a multi-award-winning technology company, serving over\n10,000 e commerce clients around the world. Working in 19 languages and with 26 offices worldwide, we implement online efficiency strategies for domestic and multinational retailers, increasing their online conversions by an average of 25%. Specialties: Re-targeting, Re-engagement, Conversion optimization, Website abandonment, e-commerce, digital marketing, Performance Marketing, Programmatic buying.\n• Performed frequent and effective networking with a variety of business partners and customers.\n• Built strong, lasting relationships with market players.\n• Built and maintained lasting and productive contacts with the media\n• Linked between suppliers, media and company clients.\n• Organized marketing research to implement brand awareness.\n• Defined, researched and monitor the market opportunities in Vietnam. • Conducted customer surveys to analyze the demands of the market.\n• Analyzed product and market pricing on a regular basis.\nSales training in Hong Kong and Singapore twice/ 3months.\n• Helped manage the administration, legal and financial duties of the office.\n• Managed digital campaign across various media and demonstrate a passion for excellent client servicing and project management.\n• Discovered and developed opportunities for marketing that involved advertising on the Internet, regional/national as well as specialist publications.\n• Managed the production of marketing materials.\n• Involved in all the 360-degreeintegrated marketing brainstorming and planning session regarding the scale of the client’s campaign.", "company": "Ve Interactive, Asia Ltd.", "end_time": "2017-01-31T00:00:00Z", "industry": "Other", "position": "Sales & Marketing Manager", "conf_score": 0.9665185576724751, "start_time": "2015-01-01T00:00:00Z"}, {"id": 15547, "detail": "HCMC, Vietnam This position works to improve KC Media market position and achieve financial growth then defines long-term organizational strategic goals, builds key customer relationships, identifies business opportunities, negotiates and closes business deals and maintains extensive knowledge of current market conditions. It is my job to work with the internal team, marketing staff, and other managers to increase sales opportunities and thereby maximize revenue. The key responsibility is to find potential new customers, present to them, ultimately convert them into clients, and continue to grow business in the future. Furthermore, this will also help manage existing clients and ensure they stay satisfied and positive.\n• Prospected for potential new clients and turn this into increased business.\n• Met potential clients by growing, maintaining, and leveraging your network.\n• Identified potential clients, and the decision makers within the client organization.\nResearched and build relationships with new clients.\nSet up meetings between client decision makers and company’s practice leaders/Principals. Worked with marketing staff to ensure that prerequisites (like qualification or getting on a vendor list) are fulfilled within a timely manner.\nEnsured all team members represent the company in the best light.\nPresented business development training and mentoring to business developers and other internal staff.\nResearched and develop a thorough understanding of the company’s people and capabilities.\nUnderstood the company’s goal and purpose so that will continual to enhance the company’s performance.\n• • • • • • •", "company": "KC Media", "end_time": "2015-03-31T00:00:00Z", "industry": "Other", "position": "Business Development Manager", "conf_score": 0.9665185576724751, "start_time": "2013-10-01T00:00:00Z"}, {"id": 15548, "detail": "H HCMC, Vietnam - My journey in fashion world started from a question: Why do they can pay five thousand dollars for a bag or an evening gown? This question increased my curiosity to make me have to find out the answer.\n- Half of the decade, I gained many valuable experiences in many working fields such as: Operation Management, CRM & POS System, Storage Management, Import & Export product or facility, Strategy Planning in Sales & Marketing, Financial Management. Started as a Fashion Consultant in\nVan Laack, I always followed my goal to reach to the level of Senior Manager. Fortunately, I had a great chance to work for", "company": "Ralph Lauren, Crocodile, Kartell Flagship Store, Van Laack", "end_time": "2013-08-31T00:00:00Z", "industry": "Other", "position": "Fashion Retail Industry & Interior Design", "conf_score": 0.9065791484080965, "start_time": "2008-02-01T00:00:00Z"}], "address": null}