{"skills": ["rxswift", "core data", "postman", "internet", "energetic", "java", "analytics", "json", "iot", "concurrency", "javascript", "ams", "eauthentication", "xml", "management", "io", "agile development methodology", "nano", "bluetooth", "git", "firebase", "analysis", "project management", "structure", "mvc architecture", "swift", "search", "trello", "css", "restful", "jira", "mvvm", "arduino", "software development", "mvc", "list view", "communication skill", "business logic", "database", "class", "teamwork", "software development methodology", "sqlite", "gcd", "bitbucket", "agile", "singleton", "html"], "fulltext": "Ngô Quang Tuấn Anh\n+84 366421234       \ntuananhsteven@gmail.com         \nDistrict 2, Ho Chi Minh city\nSummary \nI am a software engineer, I have spent most of my time to develop iOS apps for 3 years. I \nreally love reading and practicing the new iOS technologies to improve my knowledge \nand skills. I also have passions to share my knowledge for everyone in my free time.  \nObjectives\nThe current objectives: Highly energetic and passionate iOS developer seeking working \nopportunities in the iOS application development (with Swift). Interested in improving my \ncurrent programming, communication and teamwork skills to positively contribute to an \norganization’s corporate or departmental objectives.  \nThe next 3-year objectives: Becoming a project manager. \nEducation \nFPT University - Bachelor of Science \nHo Chi Minh city, Viet Nam - 2013 - 2017 \nMajor: Software Engineering \nMinor: Information System \nGraduation project: Crowd Monitoring of Exhibition \nCertificate of iOS Programming \nNhat Nghe Academy, Ho Chi Minh city, Viet Nam - July 2015 \nCertificate of Academic Preparation English \nFPT University, Ho Chi Minh city, Viet Nam- September 2014 \nReferences available upon request \nSkills \nCommunication Languages: English (fluent), Japanese (beginner) \nProgramming Languages: familiar with Swift, Java, HTML, CSS, Javascript. \nDatabases & Offline Storage: experienced with SQLite, Core Data framework, Realm \nDevelopment Software: familiar with development tools as: Xcode and Simulator; code \nversion control tools as: Git and Bitbucket; GIT GUI as: Source Tree; project management \ntools as: Jira, Confluence and Trello; communication tools: Slack and Skype; other tools: \nPostman, Sketch,… \nArchitecture: MVC, MVVM, Singleton, Clean Swift, Functional Reactive Programming \nTechnologies: experienced with web services: JSON and XML, Google Vision, Parse, \nFirebase, IOT (bluetooth devices, iBeacon, Arduino, Raspberry, Home Assistant) \nPlatforms: technical proficiency in Mac OSX \niOS 3rd party library : Alamofire, Kingfisher, SVProgressHUD, Firebase Analytics, Realm, \nRxSwift, Texture (AsyncDisplayKit), PromiseKit, Reachability, Facebook SDK, SnapKit, \nCryptoSwift, SkeletonView, IQKeyboardManagerSwift. \nSoftware Development Methodologies : Agile (Scrum) \nTeam work: enjoy working as a team member as well as independently. Using the above \ndevelopment software for team work. \nParticipate the team building activities like traveling, eating, “nhậu”, “quẩy” bar, karaoke, \nlive concert with members in development team and company. \nExperience  \nFULLTIME EMPLOYEE \n10/2018 -NOW: IOS DEVELOPER AT CALIFORNIA MANAGEMENT GROUP (CMG.ASIA) \nLEEP App : a fitness social application for all members and PTs of California Fitness & Yoga \nClub. LEEP connects all Cali PTs and their members through Chat, Fitness Calendar and \nNews feed. LEEP also allows members to book and buy the personal training sessions with \ntheir desired PTs. \nhttps://itunes.apple.com/vn/app/leep-app/id1230805728?mt=8 \n12/2017 -9/2018: IOS DEVELOPER AT PERSON PROCESS AND TECHNOLOGY \nFUMA (Atoun Inc): I developed the applications for Person Process and Technology ’s \ncustomer. The application will control the operations of the oil diffuser, fan and light: turn \non/off, change mode, set timer, ... I used the Core Bluetooth library for implementing this \napp. \nhttps://itunes.apple.com/jp/app/fuma/id1329618283?l=en&mt=8 (only Japan market) \nTable Top Order: I fixed bugs and developed some features in the current product of \nPersol: Restaurant Ordering System. Some bugs involve with UI, business logic and \nperformance of loading data from Internet.  \nhttps://itunes.apple.com/jp/app/uレジ-tto/id1260880422?l=en&mt=8 (only Japan market) \nSTUDENT \n09/2017 -11/2017: FREELANCER IOS DEVELOPER \nI developed the application for monitoring, analyzing and predicting the lottery result. \nSome technologies and skills I applied for this app: Web-service, Realm, Push Notification, \nRealtime Database with Firebase, Google Vision, Clean Swift Architecture. \n09/2017 -11/2017: GRADUATION PROJECT AT FPT UNIVERSITY: CROWD MONITORING OF EXHIBITION \nI developed the system to collect, analysis user trends at Exposition taking place and \nfinished. The system also can notify visitors about the upcoming events. Some \ntechnologies I applied for this app: Web-service, iBeacons, Push Notification. \n10/2016 -03/2017: PART-TIME IOS DEVELOPER AT  TMA SOLUTIONS \nI developed the applications for TMA customer. \n7/2016 - 9/2016: FREELANCER IOS DEVELOPER \nI developed the application for my customer. This application allows user to view list of \nsongs for each category. User can play music, view lyrics and music sheet, download \nsongs, add some songs into their wishlist, share with their friend via mail, facebook, … . I \nused the Web-service, Realm and AVFoundation for building this app. \n15/7/2016 - 8/2016: CULTURAL EXCHANGE AT INDIA \nI attended the cultural exchange program between the FPT University and ITM University.  \n4/2016 - 6/2016 PART-TIME JOB AT IDE ACADEMY \nDesigned and implemented the two applications: \nE-commerce App: The application displays the categories and list of products for each \ncategory. It also allows users to add products into their wishlist, their shopping cart and \ncheck out when users want to finish shopping. Users can search their desired products and \nview their order history. This application interacts with RESTful web services basing on \nJSON structure by Alamofire library.  \nChat App: This application allows users to open the chat room (2 person or a group). User \ncan send the text, image and emoji messages or their location with their friend. I used the \nrealtime database of Firebase for implementing this app. \nI made some youtube videos for guiding the new students of IDE academy. Some topic \nthat I have made videos: Alamofire framework, Authentication and Realtime-database with \nthe new Firebase, Download File, Parse JSON and XML,… \n7/2015 - 2/2016 SELF-EDUCATION AND UPDATE THE NEW IOS TECHNOLOGY WITH SWIFT AND DO \nSMALL PET PROJECTS: \nSome small pet projects: the iOS application to control lights for my room, the application \nto support learning English words for the TOEFL test and the application to manage \norders in restaurant. Some technologies I used: Bluetooth 4.0 with arduino nano, SQLite to \nstore vocabulary, Web service with JSON. \n2/2015 - 6/2015 PARTICIPATING THE IOS PROGRAMING COURSE AT NHAT NGHE ACADEMY  \nFinal course project: Built an iOS application to introduce products for a mobile phone \nand computer store. This application allows user to view the news about the latest \nproducts, view detail all products, search the specific products and display the contact \ninformation of the store. This application uses web service technology (JSON). \nPublications: \nMy Old Blog: https://viblo.asia/u/tuananhsteven. Some topics I have written: iOS \nconcurrency with GCD and Operation (9 posts), Class and Struct in Swift - Similarities and \nDifferences,… \nPowered by TCPDF (www.tcpdf.org)", "educations": [{"id": 4694, "gpa": null, "major": "Hệ thống thông tin quản lý", "school": "FPT University", "diploma": "Bachelors", "end_time": "2017-01-01T00:00:00Z", "conf_score": 0.8122306558073306, "start_time": "2013-01-01T00:00:00Z", "picklist_major": "Administrative/Clerical", "major_categories": "Kinh doanh và quản lý", "major_categories_detail": "Quản trị – Quản lý"}], "experiences": [{"id": 15691, "detail": "LEEP App : a fitness social application for all members and PTs of California Fitness & Yoga Club. LEEP connects all Cali PTs and their members through Chat, Fitness Calendar and\nNews feed. LEEP also allows members to book and buy the personal training sessions with their desired PTs. https://itunes.apple.com/vn/app/leep-app/id1230805728?mt=8", "company": "CALIFORNIA MANAGEMENT GROUP (CMG.ASIA)", "end_time": "2023-04-13T00:00:00Z", "industry": "Other", "position": "IOS DEVELOPER", "conf_score": 0.8167547004921527, "start_time": "2018-10-01T00:00:00Z"}, {"id": 15692, "detail": ": I developed the applications for Person Process and Technology ’s customer. The application will control the operations of the oil diffuser, fan and light: turn on/off, change mode, set timer, ... I used the Core Bluetooth library for implementing this app. https://itunes.apple.com/jp/app/fuma/id1329618283?l=en&mt=8 (only Japan market)\nTable Top Order: I fixed bugs and developed some features in the current product of\nPersol: Restaurant Ordering System. Some bugs involve with UI, business logic and performance of loading data from Internet. https://itunes.apple.com/jp/app/uレジ-tto/id1260880422?l=en&mt=8 (only Japan market)\nSTUDENT 09/", "company": "PERSON PROCESS AND TECHNOLOGY\nFUMA (Atoun Inc", "end_time": "2018-09-30T00:00:00Z", "industry": "High Technology", "position": "IOS DEVELOPER", "conf_score": 0.8169468421241411, "start_time": "2017-12-01T00:00:00Z"}, {"id": 15693, "detail": "ATION PROJECT AT FPT UNIVERSITY: CROWD MONITORING OF EXHIBITION I developed the system to collect, analysis user trends at Exposition taking place and finished. The system also can notify visitors about the upcoming events. Some technologies I applied for this app: Web-service, iBeacons, Push Notification.", "company": "PERSON PROCESS AND TECHNOLOGY\nFUMA (Atoun Inc", "end_time": "2017-11-30T00:00:00Z", "industry": "High Technology", "position": "FREELANCER IOS DEVELOPER", "conf_score": 0.7893183707182327, "start_time": "2017-09-01T00:00:00Z"}, {"id": 15694, "detail": "developed the applications for TMA customer.\n7/2", "company": "TMA SOLUTIONS", "end_time": "2017-03-31T00:00:00Z", "industry": "High Technology", "position": "IOS DEVELOPER", "conf_score": 0.8169468421241411, "start_time": "2016-10-01T00:00:00Z"}, {"id": 15695, "detail": "developed the application for my customer. This application allows user to view list of songs for each category. User can play music, view lyrics and music sheet, download songs, add some songs into their wishlist, share with their friend via mail, facebook, ... . I used the Web-service, Realm and AVFoundation for building this app.", "company": "TMA SOLUTIONS", "end_time": "2016-09-30T00:00:00Z", "industry": "High Technology", "position": "FREELANCER IOS DEVELOPER", "conf_score": 0.6960871676698025, "start_time": "2016-07-01T00:00:00Z"}, {"id": 15696, "detail": "esigned and implemented the two applications:\nE-commerce App: The application displays the categories and list of products for each category. It also allows users to add products into their wishlist, their shopping cart and check out when users want to finish shopping. Users can search their desired products and view their order history. This application interacts with RESTful web services basing on\nJSON structure by Alamofire library.\nChat App: This application allows users to open the chat room (2 person or a group). User can send the text, image and emoji messages or their location with their friend. I used the realtime database of Firebase for implementing this app.\nI made some youtube videos for guiding the new students of IDE academy. Some topic that I have made videos: Alamofire framework, Authentication and Realtime-database with the new Firebase, Download File, Parse JSON and XML,...", "company": "IDE ACADEMY", "end_time": "2016-06-30T00:00:00Z", "industry": "Other", "position": null, "conf_score": 0.777234957045544, "start_time": "2016-04-01T00:00:00Z"}], "address": "District 2, Ho Chi Minh city"}