{"skills": ["hard working", "insurance", "android", "testing", "io", "tester", "management", "redmine"], "fulltext": "CURRICULUM VITAE\nII. SKILLS\nTechnical skills:\n4+ years experiences in software testing\nSoftware testing process\nQuestion and Answer skill in joining project\nTest case design\nReport bug\nMobile, Website testing skill\nSoft skills:\nBe efficient in group working.\nBe able to work under high pressure\nHard working\nCapable of working independently\nIII. EDUCATION HISTORY\nSchool\nDegree\nFrom\nTo\nVan Hien University\n Electric - Telecom Engineer\n2002\n[ 2007\nPage l of3\nIV. EMPLOYMENT HISTORY\n2+ years of working experience testing engineer for Application outsources for Japan,\nweb application at JV-IT company ltd.\n2 years of working experience testing engineer for Application products for VietNam,\nweb application at ITT Group company ltd.\n1/ Testing Engineer\nJV-IT company\nWorking duration: From 2016 to present.\nResponsibilities:\nT\nTwo months experience management\n1\nWorked as tester 2 years ago.\nCurrently project: K-Bukka (web), N-Diss (Web, IOS, Android)\nProjects:\nN-Diss, K-Bukka, S1... The projects on Web site and Application web. First, receive\nrequirement from the customer. Next BSE, dev and QC will discus about new\nrequirement. Then, collect all question from everybody and create QA. After that, QC\ndesign the test case and follow up new requirement and QA. And execute the test case\nfollow all Require (Task, Design, QA, review checklist), and report all bugs found in\nRedmine. So all people always follow QA in the Redmine, update the test case when the\ncustomer answer. Final, QC finished test then Dev release to the customer. In the time,\nwe will perform free test on the release environment. The customer tested all function\nand UI again, the tasks finished when the customer tested ok and close task. My company\nuser Redmine tool for log time everyday, report things in here.\nOMMS, BSN , Nissan, ITSM, Madocon... The projects on Mobile. First, receive\nrequirement from the customer. Next BSE, dev and QC will discus about new\nrequirement. Then, collect all question from everybody and create QA. After that, QC\ndesign the test case and follow up new requirement and QA. And execute the test case\nfollow all Require (Task, Design, QA, review checklist), and report all bugs found in\nRedmine. So all people always follow up QA in the Redmine, update the test case when\nthe customer answer. Final, QC finished test then Dev release to the customer.My\ncompany user Redmine tool for log time everyday, report things in here.\nPage 2 of3\n2/ Testing Engineer\nITT Group company\nWorking duration: From 2014 to 2016.\nResponsibilities: worked as tester.\nProjects:\nPhamNguyen, ThuocLaSaiGon: The projects on Web site and Application (Android).\nFirst, I receive new requirement from my customer. Next, Dev and QC discuss about this\nrequest. Then, design the test case. After that, execute test and release for my customer.\n3/ Other projects (outside).\nHave attended projects\n1. LV= Car Insurance Site on devices (Web, mobiles, tablet, .. with iOS and\nAndroid).\nLink: http://lv.com/\n2. Joules - New Mobile Site on devices (Web, mobiles, IOS and Android)\nLink: http://uatmobmain.eclipsegroup.co.uk/\n3.\nSuperdry.co.uk Mobile Site\nLink: http://com.stage.sd.co.uk/\n4. I\nRoyal National Institute of Blind People Site on Web, tablet, mobiles\nhttp://live.mnib.precedenthost.co.uk/\nPage 3 of3", "educations": [{"id": 4738, "gpa": null, "major": "Kinh tế quốc tế", "school": "Van Hien University", "diploma": "Bachelors", "end_time": "2007-01-01T00:00:00Z", "conf_score": 0.9078501694013758, "start_time": "2002-01-01T00:00:00Z", "picklist_major": "Economical", "major_categories": "Khoa học xã hội và hành vi", "major_categories_detail": "Kinh tế học"}], "experiences": [{"id": 15846, "detail": "years ago.\nCurrently project: K-Bukka (web), N-Diss (Web, IOS, Android) Projects: N-Diss, K-Bukka, S1... The projects on Web site and Application web. First, receive requirement from the customer. Next BSE, dev and QC will discus about new requirement. Then, collect all question from everybody and create QA. After that, QC design the test case and follow up new requirement and QA. And execute the test case follow all Require (Task, Design, QA, review checklist), and report all bugs found in\nRedmine. So all people always follow QA in the Redmine, update the test case when the customer answer. Final, QC finished test then Dev release to the customer. In the time, we will perform free test on the release environment. The customer tested all function and UI again, the tasks finished when the customer tested ok and close task. My company user Redmine tool for log time everyday, report things in here.\nOMMS, BSN , Nissan, ITSM, Madocon... The projects on Mobile. First, receive requirement from the customer. Next BSE, dev and QC will discus about new requirement. Then, collect all question from everybody and create QA. After that, QC design the test case and follow up new requirement and QA. And execute the test case follow all Require (Task, Design, QA, review checklist), and report all bugs found in\nRedmine. So all people always follow up QA in the Redmine, update the test case when the customer answer. Final, QC finished test then Dev release to the customer.My company user Redmine tool for log time everyday, report things in here.\nProjects: PhamNguyen, ThuocLaSaiGon: The projects on Web site and Application (Android). First, I receive new requirement from my customer. Next, Dev and QC discuss about this request. Then, design the test case. After that, execute test and release for my customer.", "company": "JV - IT company", "end_time": "2023-04-13T00:00:00Z", "industry": "High Technology", "position": "Testing Engineer", "conf_score": 0.8176684279967229, "start_time": "2016-01-01T00:00:00Z"}], "address": null}