{"skills": ["search", "networking", "administration", "internet", "structure", "insurance", "accounting", "market research", "marketing", "sales", "sell", "customer marketing", "negotiation skill", "database", "positive attitude", "contract terms", "implementation", "time service", "quality management", "recruitment", "information management", "general management", "supplier quality management", "management"], "fulltext": "Contact\nhuydoanpham@yahoo.com\nwww.linkedin.com/in/huy- pham-99863661  (LinkedIn)\nTop Skills\nSales Management\nSales Presentations\nTeam Management\nHuy Pham\nSenior Business Partnership\nVietnam\nSummary\nGood business sense with 8 years experienced \n- Understand internet market and products, familiar with start-up\nchallenges\n- Effective communicator\n- Self-motivated but able to work as part of a team\n- Good organisational and time-management skills\n- Good negotiation skills and persuasiveness\n- Confidence presenting to large groups of people\n- Trustworthiness and discretion when handling confidential\ninformation\n- Smart appearance and professional manner\n- Positive attitude and enjoy networking\nExperience\nLINE Corp\nSenior Business Partnership - BEYEU Project\nJune 2018 - Present \nVietnam\nBaby Love - a member of Line, is a free mobile app for moms. Based on the\nbaby's age from pregnancy to age 5, the app helps parents keep up with useful\ninformation and questions raised by mothers of the same age.\n- Structuring a deal includes: services and products and discount,\ncommissions, collaborative steps to ondeal.\n- Support the sale to complete the discussion and signing with the merchant\nwhen cooperating with BEYEU\n- Responsible for operation and enforcement of the merchant in cooperation\nwith BEYEU\n- Be responsible for partnering with BEYEU for the e-commerce channel as\nwell as the partner responsible for shipping.\n- Cooperate with other departments to complete the assigned tasks such as\nlegal, accounting, marketing, technical, content, customer care.\nAchievements:\nPage 1 of 6\n- Plans for the deal structure include: cooperative type and commission\n- Cooperate with Legal and complete the following items: E-commerce\ntransaction platform licence, e-commerce project licence, promotion license\n- Supported sale has completed two major campaigns for Unilever for the\nOMO brand: Sampling (8000 combo) and Reward (8000 e-voucher). In\naddition to the Beesmart smart toy product partners\nFoodnow.vn\nFounder\nApril 2016 - May 2018 (2 years 2 months)\nVietnam\nNowadays, people are living in busy society and they have got crazy life. \nUsers want to save money and time for family, relationship, friends, job...\nMerchants want to get more revenue and best solutions for business but lack\nof, such as: manegment tool, employement and pay too much money for\nmarketing.\nFoodnow.vn is food delivery website, we provide not only food delivery service\nfor user but also suppliers.  \nWe provide solution for all people and business. Beside,  we concentrate to\nsolve problems of society, such as: save time, money.\nFoodnow will be become one of largest Supermarket online in Việt Nam.\nMoreovers, We will connect all of suppliers to provide the best service for all of\nFoodnow's member.\nCốc Cốc\nSenior Sales\nAugust 2016 - July 2017 (1 year)\n27B Nguyen Dinh Chieu, Dakao Ward, District 1, HCMC\nSell QC Cốc Cốc ad placements\nDevelop and maintain partners database\nIncrease awareness of Cốc Cốc’s capabilities to existing and prospective\nclients\nDevelop business—build and maintain good relationships with clients\nPrepare attractive documents/presentations to inspire and persuade clients\nMeet monthly and quarterly sales objectives\nCollect market information for superiors to maximize business opportunities\nResearch and forecast new trends in the Vietnamese online advertising market\nCollaborate with other teams to develop new products/services\nExecute other tasks assigned by management\nAchievement: \nPage 2 of 6\nBest Seller in last quarter in 2016\nDucNhung Company\nKey Account Manager\nJuly 2015 - June 2016 (1 year)\nQuiNhon City and HoChiMinh City\nFinancial (KA channel):\nPlan for sales cycle in Month to:\n- Co-work with marketing, customer service, admin and production to\nimplement activities with customers\n- Closely work with customers to ensure efficient operation\n- Ensure best service to customers/consumers\n- Co-work with customer to build the good business relation ship\nSales Management \n- Seek new key clients in various Electric industries.\n- The presenting and business plan to customer.\n- Participate in preparation for month trading terms contract with key\ncustomers.\n- Consult in the development of Sales tools and provide implementation\nsupport to Director.\n- Solve the problems in collaborative process to ensure the successful\ncooperation\nCommunication\n- Ensure clear and timely communication of all business related matter\n- Provide consultant in all communication.\n- Manage and maintain general communication and relation with key\ncustomers.\nFoody Corp\nProject Manager\nDecember 2014 - April 2015 (5 months)\nHo Chi Minh City\nUsing solid experience in ecommerce to set up operation of DeliveryNow\nproject\nSupporting other departments: marketing, production and IT in operation tasks:\n- Work out with Marketing departments for business development strategy\nfor DeliveryNow.vn in explore market planning, approach potential clients\nstrategy; \n- Collaborate with production department to solve the problem in company\nprocess: brand image, service process\nPage 3 of 6\n- Manage sales department in deals source in both service and products, solve\nthe daily tasks another issues to be ensure for a smoothly business\nOperation:\no In charge of deal quality management, quantity of deals for ecommerce\nbusiness, content of deals\n- Set up the KPI and Policy for: Sale, Customer service, Editor, Delivery\ndepartments\n- Report performant every week \nMarket Research:\n- Research about the service, product: brand name, price, policies, market\ndemand\n- Sourcing Privates Sales Products for Company inventory in Vietnam\n- Manage and evolve restaurants and corporate relationships\nSuppliers’ management\n- Suppliers quality management in quality of service/ product, best price and\ncheck for ability\n- Manage and develop relationships with restaurant business\nSale Management\n- Assist and work closely with business development team to source and\nextend high quality, timely service to current and prospective restaurant in\nVietnam\n- Define and manage requirements for day-to-day account management and\noperations\n- Other services as may be discussed and agreed to\n- Ensure that all administration is completed as required\nAchievement:\n- After 2 months, we have 190 merchants signed the contract on over 274\nmerchants on the website\n- Exceeding the set target 45%\n- With over 50 orders per day\nnhomMua.com\n3 years 4 months\nKey Account Manager\nFebruary 2013 - March 2014 (1 year 2 months)\nVietnam\nFinancial (KA channel):\n- Plan for sales cycle in Month to:\n- Co-work with marketing, customer service, admin and production to\nimplement activities with customers\nPage 4 of 6\n- Closely work with customers to ensure efficient operation\n- Ensure best service to customers/consumers\n- Co-work with customer to build the good business relation ship\nSales Management\n- Seek new key clients: hospitality, beauty service, product (FMCG, fashion…)\n- The presenting and business plan to customer.\n- Participate in preparation for month trading terms contract with key\ncustomers.\n- Consulted in the development of Sales tools and provide implementation\nsupport to Key Account team.\n- Solve the problems in collaborative process to ensure the successful\ncooperation\nCommunication\n- Ensure clear and timely communication of all business related matter\n- Provide consultant in all communication.\n- Manage and maintain general communication and relation with key\ncustomers.\nSenior Account Executive - Team leader\nDecember 2010 - June 2013 (2 years 7 months)\nVietnam\nHead Office- Ho Chi Minh         Aug 2011- Jan 2013\n- Training staff for understanding about the Groupon industry\n- Responsible for sales team: support to find the merchant and achieved the\ntarget of sale\n- Seek new clients and market development: hospitality, beauty service,\nproduct (FMCG, fashion…)\no Management information about goods and services of partners to ensure the\nsuccessful cooperation\no Solve the problems in collaborative process \nAchievement: Best seller in March, April and May, 2012\nHanoi Branch (6 months to set up branch at Hanoi)       Jan- Aug 2011\n- Recruitment\n- Training for staff: Groupon industry and structure DEAL\n- Responsible for sales team\n- Seek new clients and market development: hospitality, beauty service,\nproduct (FMCG, fashion…) \n- Manage business situation: \nPage 5 of 6\no Research about the market in Hanoi: Consumer Behavior and Competitors\nCollect customer’s opinions, analyze information and make plan for team to\nattack the market\no Solve problems happen in during the time cooperation with merchant\no Report the market information for General Director of Market Development\n- Find merchants for 5 market segments: Hotel & Resort, Restaurant, Spa\nproduct and service\nHa Khue Company one of the partners of FPT Corporation\nSales Executive\nMarch 2010 - December 2010 (10 months)\nVietnam\nSell products and collect opinions from customer\nSolve the problems in collaborative process to ensure the successful\ncooperation\nThe search for new customers and market development\nReport the market information for Sale Manager\nEducation\nSt.Martin College\nAdvance Diploma of Business Management, Business Administration and\nManagement, General · (2006 - 2009)\nAIA VietNam\nInsurance Certificate, Insurance · (2014 - 2014)\nPage 6 of 6\nPowered by TCPDF (www.tcpdf.org)", "educations": [{"id": 4744, "gpa": null, "major": "Kỹ thuật điện tử – viễn thông", "school": "St.Martin College", "diploma": "Colleges", "end_time": "2009-01-01T00:00:00Z", "conf_score": 0.9212119350388319, "start_time": "2006-01-01T00:00:00Z", "picklist_major": "Technical", "major_categories": "Kỹ thuật", "major_categories_detail": "Kỹ thuật điện, điện tử và viễn thông"}], "experiences": [{"id": 15865, "detail": "Vietnam Baby Love - a member of Line, is a free mobile app for moms. Based on the baby's age from pregnancy to age 5, the app helps parents keep up with useful information and questions raised by mothers of the same age.\n- Structuring a deal includes: services and products and discount, commissions, collaborative steps to ondeal.\n- Support the sale to complete the discussion and signing with the merchant when cooperating with BEYEU - Responsible for operation and enforcement of the merchant in cooperation with BEYEU - Be responsible for partnering with BEYEU for the e-commerce channel as well as the partner responsible for shipping.\n- Cooperate with other departments to complete the assigned tasks such as legal, accounting, marketing, technical, content, customer care.\nAchievements: - Plans for the deal structure include: cooperative type and commission\n- Cooperate with Legal and complete the following items: E-commerce transaction platform licence, e-commerce project licence, promotion license\n- Supported sale has completed two major campaigns for Unilever for the\nOMO brand: Sampling (8000 combo) and Reward (8000 e-voucher). In addition to the Beesmart smart toy product partners", "company": "LINE Corp", "end_time": "2023-04-13T00:00:00Z", "industry": "Other", "position": "Senior Business Partnership", "conf_score": 0.9142206543796373, "start_time": "2018-06-01T00:00:00Z"}, {"id": 15867, "detail": "(2 years 2 months)\nVietnam Nowadays, people are living in busy society and they have got crazy life.\nUsers want to save money and time for family, relationship, friends, job...\nMerchants want to get more revenue and best solutions for business but lack of, such as: manegment tool, employement and pay too much money for marketing.\nFoodnow.vn is food delivery website, we provide not only food delivery service for user but also suppliers.\nWe provide solution for all people and business. Beside, we concentrate to solve problems of society, such as: save time, money.\nFoodnow will be become one of largest Supermarket online in Việt Nam. Moreovers, We will connect all of suppliers to provide the best service for all of\nFoodnow's member.", "company": "Foodnow.vn", "end_time": "2018-05-31T00:00:00Z", "industry": "FMCG", "position": "Founder", "conf_score": 0.9380974856686034, "start_time": "2016-04-01T00:00:00Z"}, {"id": 15869, "detail": "(1 year)\n27B Nguyen Dinh Chieu, Dakao Ward, District 1, HCMC Sell QC Cốc Cốc ad placements\nDevelop and maintain partners database\nIncrease awareness of Cốc Cốc’s capabilities to existing and prospective clients\nDevelop business—build and maintain good relationships with clients\nPrepare attractive documents/presentations to inspire and persuade clients\nMeet monthly and quarterly sales objectives\nCollect market information for superiors to maximize business opportunities\nResearch and forecast new trends in the Vietnamese online advertising market\nCollaborate with other teams to develop new products/services\nExecute other tasks assigned by management\nAchievement:", "company": "Cốc Cốc", "end_time": "2017-07-31T00:00:00Z", "industry": "High Technology", "position": "Senior Sales", "conf_score": 0.9175172730272324, "start_time": "2016-08-01T00:00:00Z"}, {"id": 15871, "detail": "(1 year)\nQuiNhon City and HoChiMinh City Financial (KA channel):\nPlan for sales cycle in Month to:\n- Co-work with marketing, customer service, admin and production to implement activities with customers\n- Closely work with customers to ensure efficient operation\n- Ensure best service to customers/consumers\n- Co-work with customer to build the good business relation ship\nSales Management - Seek new key clients in various Electric industries.\n- The presenting and business plan to customer.\n- Participate in preparation for month trading terms contract with key customers.\n- Consult in the development of Sales tools and provide implementation support to Director. - Solve the problems in collaborative process to ensure the successful cooperation\nCommunication - Ensure clear and timely communication of all business related matter\n- Provide consultant in all communication.\n- Manage and maintain general communication and relation with key customers.", "company": "DucNhung Company", "end_time": "2016-06-30T00:00:00Z", "industry": "Other", "position": "Key Account Manager", "conf_score": 0.9257062876052345, "start_time": "2015-07-01T00:00:00Z"}, {"id": 15873, "detail": "(5 months)\nHo Chi Minh City Using solid experience in ecommerce to set up operation of DeliveryNow project\nSupporting other departments: marketing, production and IT in operation tasks:\n- Work out with Marketing departments for business development strategy for DeliveryNow.vn in explore market planning, approach potential clients strategy;\n- Collaborate with production department to solve the problem in company process: brand image, service process\n- Manage sales department in deals source in both service and products, solve the daily tasks another issues to be ensure for a smoothly business\nOperation: o In charge of deal quality management, quantity of deals for ecommerce business, content of deals\n- Set up the KPI and Policy for: Sale, Customer service, Editor, Delivery departments\n- Report performant every week\nMarket Research: - Research about the service, product: brand name, price, policies, market demand\n- Sourcing Privates Sales Products for Company inventory in Vietnam - Manage and evolve restaurants and corporate relationships\nSuppliers’ management\n- Suppliers quality management in quality of service/ product, best price and check for ability\n- Manage and develop relationships with restaurant business\nSale Management - Assist and work closely with business development team to source and extend high quality, timely service to current and prospective restaurant in\nVietnam - Define and manage requirements for day-to-day account management and operations\n- Other services as may be discussed and agreed to\n- Ensure that all administration is completed as required\nAchievement: - After 2 months, we have 190 merchants signed the contract on over 274 merchants on the website\n- Exceeding the set target 45% - With over 50 orders per day", "company": "Foody Corp", "end_time": "2015-04-30T00:00:00Z", "industry": "FMCG", "position": "Project Manager", "conf_score": 0.9175172730272324, "start_time": "2014-12-01T00:00:00Z"}, {"id": 15875, "detail": "(1 year 2 months)\nVietnam Financial (KA channel):\n- Plan for sales cycle in Month to:\n- Co-work with marketing, customer service, admin and production to implement activities with customers", "company": "nhomMua.com", "end_time": "2014-03-31T00:00:00Z", "industry": "Other", "position": "Key Account Manager", "conf_score": 0.9167205923617493, "start_time": "2013-02-01T00:00:00Z"}, {"id": 15876, "detail": "Senior Account Executive - Team leader\nDecember 2010 - June 2013 (2 years 7 months)\nVietnam Head Office- Ho Chi Minh Aug 2011- Jan 2013 - Training staff for understanding about the Groupon industry\n- Responsible for sales team: support to find the merchant and achieved the target of sale\n- Seek new clients and market development: hospitality, beauty service, product (FMCG, fashion...) o Management information about goods and services of partners to ensure the successful cooperation o Solve the problems in collaborative process\nAchievement: Best seller in March, April and May, 2012 Hanoi Branch (6 months to set up branch at Hanoi) Jan- Aug 2011 - Recruitment - Training for staff: Groupon industry and structure DEAL - Responsible for sales team\n- Seek new clients and market dev o Research about the market in Hanoi: Consumer Behavior and Competitors Collect customer’s opinions, analyze information and make plan for team to attack the market o Solve problems happen in during the time cooperation with merchant o Report the market information for General Director of Market Development - Find merchants for 5 market segments: Hotel & Resort, Restaurant, Spa product and service", "company": "nhomMua.com", "end_time": "2013-01-31T00:00:00Z", "industry": "Other", "position": "Senior Account Executive - Team leader", "conf_score": 0.8952932740837064, "start_time": "2011-08-01T00:00:00Z"}, {"id": 15877, "detail": "(10 months)\nVietnam Sell products and collect opinions from customer\nSolve the problems in collaborative process to ensure the successful cooperation\nThe search for new customers and market development\nReport the market information for Sale Manager", "company": "FPT Corporation", "end_time": "2010-12-31T00:00:00Z", "industry": "High Technology", "position": "Sales Executive", "conf_score": 0.9057206749122791, "start_time": "2010-03-01T00:00:00Z"}], "address": null}