{"skills": ["team management", "css", "administration", "analysis", "interpersonal skill", "google ads", "twitter", "bidding", "energetic", "facebook analytics", "microsoft", "marketing", "google analytics", "analytics", "liaising", "liaising with", "digital marketing", "excel", "facebook insights", "video marketing", "digital strategy", "business goal", "management", "medium"], "fulltext": "Address: 332/8 Cach Mang Thang Tam, Dist. 3, HCMC\nMobile: 0986 990 248\nDate of Birth\n   :   5/5/1990\nEmail: uyen5590@gmail.com \nVU NGOC TU UYEN\nEXPERIEN\nCES\nDigital\nMarketing\nLeader\n–\nCJ\nCGV\nVietnam\n5/2018 - Present\n•\nDesign and implement yearly and monthly Digital Strategy to align\nwith business goals.\n•\nManage social media team to generate and publish daily content on\nFacebook, Instagram and Zalo.\n•\nCoordinate SEM & SEO activities to optimize the website’s\nperformance.\n•\nPropose seasonal promotion campaigns. Measure and report the\neffectiveness of each campaign.\n•\nStay up-to-date with current and trends in Social Media.\n•\nBuild a complete entertainment ecosystem for CGV on digital\nplatforms, including optimize website, create movie information\nportal, entertainment website. Work with IT team for UX/UI & CSS.\n•\nPrepare monthly report and analysis to evaluate the performance of\neach digital channel.\n•\nCommunicate with partners and digital agencies to ensure\nconsistent brand image.\nSenior Digital Marketing – ZALORA Vietnam (Central Group)\n10/2015 – 4/2018                                          \n•Managing all SEM channels for Zalora business, including SEM, GDN,\nCoccoc, Retargeting and Social Media platforms.\n•Working closely with Coccoc, Retargeting agencies and regional\nGoogle team on multiple ads channels to optimize outcome within\nallocated budget.\n•Getting requirements from Campaign Management team regarding\nmonthly campaigns. Liaising with Design team to deliver productive\nartworks across all platforms.\n•Utilizing keyword tools to research on high-volume keywords and\ndevelop effective bidding strategy to optimize performance and meet\ntarget provided.\n•Coordinating with Internal Production team to optimize landing pages\nand other technical issues.\n•Analyzing and reporting on the performance of the campaigns via\nGoogle Analytics, Facebook Insights in the effort of achieving KPIs and\nmaximizing results.\n•Staying up-to-date with emerging technologies and the evolving\ndigital landscape to identify relevant first-to-market opportunities.\nDigital\nMarketing\nExecutive\n–\nTrung\nThuy\nGroup\n5/2012 – 5/2015\n•Planned, budgeted and implemented integrated marketing\ncampaigns.\n•Ran online advertising campaigns: Google Ads, Coccoc Ads, GDN,\nFacebook Ads.\n•Developed idea for marketing materials, including infographic,\nbrochure, banner, leaflet...\n•Created SEO-friendly content for website, blog posts and produce\nattractive storyboard for video marketing.\n•Managed social media platform (Facebook, Twitter, Instagram) to\npromote and engage with potential customers.\n•Brainstormed and executed online interactive activities (contests and\ngames) in order to improve brand awareness among potential clients.\n•Produced PR articles, press kit, advertorial, newsletter, blog posts... to\nincrease online awareness through social media, websites, and direct\nmailings.\n•Measured and reported performance of all digital marketing\ncampaigns, and assessed against goals.\nSKILLS\n•\nProficient in using Microsoft Office (Word, Excel, PowerPoint, Outlook).\n•\nProficiency in social media (Facebook, Twitter,  Linkedin, Google+).\n•\nBe able to work effectively as a team player, and earn the trust of\nboth junior and senior colleagues.\n•\nDynamic, positive, self - motivated, detail – oriented, energetic and\nfast learner.\n•\nPromptly adapt to a multi-cultural setting with strong interpersonal\nskills.\nEDUCATIO\nN\nBachelor of Commerce                                                                        \n2/ 2010 – 11/ 2012\nRMIT International University, Ho Chi Minh City, Vietnam     \nMaster of Business Administration\nRMIT International University, Ho Chi Minh City, Vietnam                    \n2/2014 – 5/2015\nREFEREES\nLy Khanh Quynh Vy – Marketing Manager\nMobile: 0933 462 294", "educations": [{"id": 4758, "gpa": null, "major": "Quản lý đô thị và công trình", "school": "RMIT International University", "diploma": "Masters", "end_time": "2015-05-01T00:00:00Z", "conf_score": 0.9265487929128834, "start_time": "2014-02-01T00:00:00Z", "picklist_major": "Architecture / Interior Design", "major_categories": "Kiến trúc và xây dựng", "major_categories_detail": "Kiến trúc và quy hoạch"}, {"id": 4756, "gpa": null, "major": "Commerce", "school": "RMIT International University,", "diploma": "Bachelors", "end_time": "2012-11-01T00:00:00Z", "conf_score": 0.8809185088169064, "start_time": "2010-02-01T00:00:00Z", "picklist_major": "Other", "major_categories": "", "major_categories_detail": ""}], "experiences": [{"id": 15915, "detail": "• Design and implement yearly and monthly Digital Strategy to align with business goals.\n• Manage social media team to generate and publish daily content on\nFacebook, Instagram and Zalo. • Coordinate SEM & SEO activities to optimize the website’s performance.\n• Propose seasonal promotion campaigns. Measure and report the effectiveness of each campaign.\n• Stay up-to-date with current and trends in Social Media. • Build a complete entertainment ecosystem for CGV on digital platforms, including optimize website, create movie information portal, entertainment website. Work with IT team for UX/UI & CSS. • Prepare monthly report and analysis to evaluate the performance of each digital channel.\n• Communicate with partners and digital agencies to ensure consistent brand image.", "company": "CJ CGV Vietnam", "end_time": "2023-04-13T00:00:00Z", "industry": "Other", "position": "Digital Marketing Leader", "conf_score": 0.7625990117186952, "start_time": "2018-05-01T00:00:00Z"}, {"id": 15917, "detail": "•Managing all SEM channels for Zalora business, including SEM, GDN, Coccoc, Retargeting and Social Media platforms.\n•Working closely with Coccoc, Retargeting agencies and regional\nGoogle team on multiple ads channels to optimize outcome within allocated budget.\n•Getting requirements from Campaign Management team regarding monthly campaigns. Liaising with Design team to deliver productive artworks across all platforms.\n•Utilizing keyword tools to research on high-volume keywords and develop effective bidding strategy to optimize performance and meet target provided.\n•Coordinating with Internal Production team to optimize landing pages and other technical issues.\n•Analyzing and reporting on the performance of the campaigns via\nGoogle Analytics, Facebook Insights in the effort of achieving KPIs and maximizing results.\n•Staying up-to-date with emerging technologies and the evolving digital landscape to identify relevant first-to-market opportunities.", "company": "ZALORA Vietnam (Central Group)", "end_time": "2018-04-30T00:00:00Z", "industry": "High Technology", "position": "Senior Digital Marketing", "conf_score": 0.9142206543796373, "start_time": "2015-10-01T00:00:00Z"}, {"id": 15919, "detail": "•Planned, budgeted and implemented integrated marketing campaigns.\n•Ran online advertising campaigns: Google Ads, Coccoc Ads, GDN, Facebook Ads. •Developed idea for marketing materials, including infographic, brochure, banner, leaflet...\n•Created SEO-friendly content for website, blog posts and produce attractive storyboard for video marketing.\n•Managed social media platform (Facebook, Twitter, Instagram) to promote and engage with potential customers.\n•Brainstormed and executed online interactive activities (contests and games) in order to improve brand awareness among potential clients.\n•Produced PR articles, press kit, advertorial, newsletter, blog posts... to increase online awareness through social media, websites, and direct mailings.\n•Measured and reported performance of all digital marketing campaigns, and assessed against goals.", "company": "Trung Thuy Group", "end_time": "2015-05-31T00:00:00Z", "industry": "Other", "position": "Digital Marketing Executive", "conf_score": 0.9423911728571437, "start_time": "2012-05-01T00:00:00Z"}], "address": "332/8 Cach Mang Thang Tam, Dist. 3, Hcmc"}