{"skills": ["budgeting", "administration", "nfc", "finance", "internet", "google ads", "mai", "lighting", "business communication", "leadership skill", "data mining", "class", "market research", "marketing", "marketing strategy", "sales", "payment", "enquiry", "negotiation skill", "excel", "crm", "digital communication", "implementation", "affiliate marketing", "csr", "management", "medium", "problem solving"], "fulltext": "CAO LAN PHUONG \n#801, Tower 1, Estella Heights, \nAn Phu Ward, District 2, Ho Chi Minh City \nPhone: 0988.919.696  \nE-Mail: phuong.clp@gmail.com \nObjectives \nDevelop professional leadership career in Marketing. Becoming a long-term, value asset to the \norganisation with creativeness, ambition, unique up-to-date hands-on experience and \ncommitment.  \nWORKING EXPERIENCES \nNKID CORPORATION \nOCT 2013 – DEC 2018 \nMarketing Manager \nVision, plan and supervise all Online/Offline marketing campaign for over 28 tiNiWorld Centers \nnationwide with a wide range scope of work: \n1. Planning, budgeting and report:  \n• \nForecasted and planed monthly, quarterly, annually Marketing campaign to ensure \nrevenue target \n• \nMonitored and analyzed market trend to develop brand strategy   \n• \nDeveloped plan to improve existing customer experiences and increase profitability, \nbrand love \n• \nTranslated business vision into CSR activities \n• \nBuilt budget and ensured cost effectiveness across business units \n• \nWorked closely with Technology, Operation and Finance team to develop new \nservice/products also strategy to reach monthly business target in parallel with \nincreasing customer satisfaction \n• \nConducted local market research and customer behavior to establish nation/cities \nmarketing strategy for every niche market of each center \n2. Digital Communication \n• \nPlaned, created and monitored Online Brand Presence and Online \nRoadmap (Social Pages, Website, App..) for Brand Awareness; \n• \nMonitored all digital communications content creation and implementations includes: \nFanpage, Website, App, Youtube Channels \n• \nMonitored all Digital Communication execution includes: Facebook Ads, PPC, Display \nAds, SEO, Email MKT, Online PR, O2O \n• \nManaged and performance control of Digital Specialist team in action to generate sales \nof Birthday Party/Group Sales with Affiliate Marketing, SEO, Google Ads; \n• \nActively led the development of Brand CRM platform includes: NFC Membership Card, \nPrepaid Payment, Customer App, Redemption Program. Improving the usability, UI \n2 \ndesign, content and conversion of the platform; \n3. Events:  \n• \nManaged all in-centers, out-centers, opening, launching and annual events \n• \nDeveloped and implemented In-Center mini events to raise Customer Experience that \ndifferentiate brands and emphasize brand leader position (Missions, shows, \nperformance) \n• \nConducted entertainment programs. Created tiNi-Band, in-house performance group \n• \nConstantly created new content to deliver Brand story both online and offline (shows, \nvideos, comics) \n4. Leadership & Management:  \n• \nGuided day to day activities of Marketing team \n• \nDirectly led 29 members in 3 in-house teams of: Digital Communication, Event, \nCreative.   \n• \nLed and coached team members with specialize course & monthly team sharing \n• \nMonitored Customer Satisfaction, Brand Health and Social Listening  \n• \nAnalyzed and developed potential strategic partner relationships for brand \n• \nWorked with agency to ensure: vision, budget and KPIs \n• \nActively contributed to Organization culture program  \nJODRIC PTY \nAUG 2013 – OCT 2013 \nBusiness Development Manager \n1. Account Management:  \n• \nProposed Sales & Marketing Solution for client  \n• \nProposed monthly event strategy to client  \n• \nSupervised all execution \n• \nDealt with sponsors and communication partners \n2. Business Development:  \n• \nContacted potential partners \n• \nClosed new business deals by coordinating requirements; developing and negotiating \ncontracts; integrating contract requirements with business operations. \n3 \nSTRUCTON VIETNAM PTY LTD \nDEC 2012 – JUL 2013 \nMarketing Manager \n• \nConducted market research and contributed to marketing campaign planning to \naddress new customers/clients; \n• \nLocalized company portfolio and corporation campaign \n• \nContributed intensively in building business development team \n• \nActively managed company profile and ensure the effectiveness of each project \nproposals; \n• \nCustomized capacity data and other administrative tasks for projects. \n• \nSupported in working with foreign project manager \n• \nActively conducted Client relation retention \nMAGONN DESIGN  \n JUN 2012 – OCT 2012 \nCommunication & PR Leader  \n• \nSupported marketing team for above the line and below the line marketing activities \nsuch as: fashion event, private sale, magazine photo-shooting, TV talks in facilities \nadministration, expenses recording and backstage garments organizing; \n• \nManaged and utilized Magonn E-commerce website includes: customer experience, \nclicks control, products, visual and data mining \n• \nTook photos of products and event photos, retouched and uploaded to website; \n• \nClarified and diagnosed market response via telephone, Facebook fan page, forums \nand brand’s website. \nKINGCOM MEDIA LTD \n JAN 2010 – MAY 2011 \nEvent Coordinator (Part-time) \n• \nParticipated in preparing budgets and provided periodic progress reports to Event \nManager for each event project;  \n• \nProposed new ideas to improve the event planning and implementation process;  \n• \nAssisted in negotiations for space contracts and booked event space, arranged food \nand beverage, audiovisual equipment and ensured appropriate décor; \n• \nMonitored setup team before event; record setup expenses; ensure the concept \nexecution \n• \nGuided back stage team (Audio and lighting, performer, promotion staff) \n4 \nVIETNAM AIRLINES \nNOV 2002 – SEP 2009 \nCabin Attendant  \n• \nLed and mentored a team of 7-10 cabin attendants to provide high quality services \nfrom Economy Class to Business Class; \n• \nCollected and reported about customer’s feedbacks, contributed ideas to enhance \nservices; \n• \nResponded and replied to passenger enquiries about company, brand, flights and \ndestination; \n• \nEnsured customer relation, professional service and safety of passengers; \n• \nAdministered the effectively use of supplies and giving feedback to quality control \ndepartment. \nEDUCATION \nRMIT UNIVERSITY VIETNAM \n          FEB 2010 – JUN 2012 \nBachelor of Commerce \nHighlight courses: Marketing, Market Research, Business Communication, E-commerce, \nStrategic Management and International Management. \nFLIGHT TRAINING CENTER OF VIETNAM                             MAR 2002 – NOV 2002 \nProfessional Flight Attendant Training Course \nHighlight courses: Professional Customer Service, Professional Customer Relation, First Aid, \nCrew Resources Management, and Flight Safety \nCENTRE OF DIGITAL EXCELLENCE & GOOGLE VIETNAM        DEC 2018 \nGoogle Digital 4.0 Workshop \nSKILLS & QUALIFICATION \n- \nExcellent written and oral communications and negotiation skills; \n- \nGood business sense and highly commitment brand love \n- \nCreative and eager learner of new trend, technology \n- \nGood leadership skills, ability to lead big team \n- \nFlexibility in all working conditions for effective problem solving; \n- \nDeep understand of market, customer behaviour and technology updates \n- \nGood organizing & multi-tasking, able to work under pressure to meet deadlines; \n5 \n- \nGood knowledge in Photoshop, Illustrator and Photography \n- \nComputer proficiency in MS Word, Excel, Power Point and Internet access;  \nPERSONAL DATA \nDate of Birth: November, 20th 1984 \nHobbies & Interest: Art, technology, reading, music, \nwatching Discovery channel and National Geographic \nchannel \nWork Availability: Feb 2019 \nPersonalities: Good sense of humor, trustworthy, self-\nmotivated and socialized. \nREFERENCES \n1 Họ và tên \nNguyễn Phương Thảo  \nChức vụ: \nTrưởng phòng C&B \nCông ty \nN KID Corporation \nĐiện thoại \n0909.396.781  \nEmail: \nThao.nguyenphuong@nkidcorp.com \n2 Họ và tên \nNguyễn Lê Chi Mai \nChức vụ: \nCo Founder/ CEO \nCông ty \nN KID Corporation \nĐiện thoại \n0916.906.331  \nEmail: \nMai.nguyen@nkidcorp.com \n6 \n3 Họ và tên \nLâm Minh Trí \nChức vụ: \nCreative Director \nCông ty \nJodric Pty \nĐiện thoại \n0913.154.448 \nEmail: \nz@jodric.com \nPowered by TCPDF (www.tcpdf.org)", "educations": [{"id": 4768, "gpa": null, "major": "Commerce", "school": "RMIT UNIVERSITY VIETNAM", "diploma": "Bachelors", "end_time": "2012-06-01T00:00:00Z", "conf_score": 0.7851615749618549, "start_time": "2010-02-01T00:00:00Z", "picklist_major": "Other", "major_categories": "", "major_categories_detail": ""}], "experiences": [{"id": 15968, "detail": "Vision, plan and supervise all Online/Offline marketing campaign for over 28 tiNiWorld Centers nationwide with a wide range scope of work:\n1. Planning, budgeting and report:\n• Forecasted and planed monthly, quarterly, annually Marketing campaign to ensure revenue target\n• Monitored and analyzed market trend to develop brand strategy\n• Developed plan to improve existing customer experiences and increase profitability, brand love\n• Translated business vision into CSR activities\n• Built budget and ensured cost effectiveness across business units\n• Worked closely with Technology, Operation and Finance team to develop new service/products also strategy to reach monthly business target in parallel with increasing customer satisfaction\n• Conducted local market research and customer behavior to establish nation/cities marketing strategy for every niche market of each center\n2. Digital Communication • Planed, created and monitored Online Brand Presence and Online Roadmap (Social Pages, Website, App..) for Brand Awareness; • Monitored all digital communications content creation and implementations includes:\nFanpage, Website, App, Youtube Channels • Monitored all Digital Communication execution includes: Facebook Ads, PPC, Display Ads, SEO, Email MKT, Online PR, O2O • Managed and performance control of Digital Specialist team in action to generate sales of Birthday Party/Group Sales with Affiliate Marketing, SEO, Google Ads; • Actively led the development of Brand CRM platform includes: NFC Membership Card, Prepaid Payment, Customer App, Redemption Program. Improving the usability, UI design, content and conversion of the platform;\n3. Events: • Managed all in-centers, out-centers, opening, launching and annual events\n• Developed and implemented In-Center mini events to raise Customer Experience that differentiate brands and emphasize brand leader position (Missions, shows, performance)\n• Conducted entertainment programs. Created tiNi-Band, in-house performance group\n• Constantly created new content to deliver Brand story both online and offline (shows, videos, comics)\n4. Leadership & Management: • Guided day to day activities of Marketing team\n• Directly led 29 members in 3 in-house teams of: Digital Communication, Event, Creative. • Led and coached team members with specialize course & monthly team sharing\n• Monitored Customer Satisfaction, Brand Health and Social Listening • Analyzed and developed potential strategic partner relationships for brand\n• Worked with agency to ensure: vision, budget and KPIs • Actively contributed to Organization culture program", "company": "NKID CORPORATION", "end_time": "2018-12-31T00:00:00Z", "industry": "Other", "position": "Marketing Manager", "conf_score": 0.9174648511369632, "start_time": "2013-10-01T00:00:00Z"}, {"id": 15969, "detail": "1. Account Management: • Proposed Sales & Marketing Solution for client\n• Proposed monthly event strategy to client\n• Supervised all execution\n• Dealt with sponsors and communication partners\n2. Business Development: • Contacted potential partners\n• Closed new business deals by coordinating requirements; developing and negotiating contracts; integrating contract requirements with business operations.", "company": "JODRIC PTY", "end_time": "2013-10-31T00:00:00Z", "industry": "Other", "position": "Business Development Manager", "conf_score": 0.9174648511369632, "start_time": "2013-08-01T00:00:00Z"}, {"id": 15970, "detail": "• Conducted market research and contributed to marketing campaign planning to address new customers/clients;\n• Localized company portfolio and corporation campaign\n• Contributed intensively in building business development team\n• Actively managed company profile and ensure the effectiveness of each project proposals;\n• Customized capacity data and other administrative tasks for projects.\n• Supported in working with foreign project manager\n• Actively conducted Client relation retention", "company": "STRUCTON VIETNAM PTY LTD", "end_time": "2013-07-31T00:00:00Z", "industry": "Other", "position": "Marketing Manager", "conf_score": 0.9256580526889115, "start_time": "2012-12-01T00:00:00Z"}, {"id": 15971, "detail": "• Supported marketing team for above the line and below the line marketing activities such as: fashion event, private sale, magazine photo-shooting, TV talks in facilities administration, expenses recording and backstage garments organizing;\n• Managed and utilized Magonn E-commerce website includes: customer experience, clicks control, products, visual and data mining\n• Took photos of products and event photos, retouched and uploaded to website;\n• Clarified and diagnosed market response via telephone, Facebook fan page, forums and brand’s website.", "company": "MAGONN DESIGN", "end_time": "2012-10-31T00:00:00Z", "industry": "Other", "position": "Communication & PR Leader", "conf_score": 0.9309830986368706, "start_time": "2012-06-01T00:00:00Z"}, {"id": 15972, "detail": "(Part-time) • Participated in preparing budgets and provided periodic progress reports to Event Manager for each event project;\n• Proposed new ideas to improve the event planning and implementation process;\n• Assisted in negotiations for space contracts and booked event space, arranged food and beverage, audiovisual equipment and ensured appropriate décor;\n• Monitored setup team before event; record setup expenses; ensure the concept execution\n• Guided back stage team (Audio and lighting, performer, promotion staff)", "company": "KINGCOM MEDIA LTD", "end_time": "2011-05-31T00:00:00Z", "industry": "Other", "position": "Event Coordinator", "conf_score": 0.9256580526889115, "start_time": "2010-01-01T00:00:00Z"}, {"id": 15973, "detail": "• Led and mentored a team of 7-10 cabin attendants to provide high quality services from Economy Class to Business Class; • Collected and reported about customer’s feedbacks, contributed ideas to enhance services;\n• Responded and replied to passenger enquiries about company, brand, flights and destination;\n• Ensured customer relation, professional service and safety of passengers;\n• Administered the effectively use of supplies and giving feedback to quality control department.", "company": "VIETNAM AIRLINES", "end_time": "2009-09-30T00:00:00Z", "industry": "Other", "position": "Cabin Attendant", "conf_score": 0.9174648511369632, "start_time": "2002-11-01T00:00:00Z"}], "address": "#801, Tower 1, Estella Heights, An Phu Ward, District 2, Ho Chi Minh City"}