{"skills": ["online game", "marketing communications", "data analysis", "business strategy", "dash", "analysis", "administration", "digital marketing", "project management", "positive attitude", "marketing", "implementation", "management", "medium", "sales", "digital content"], "fulltext": "NGUYEN NGOC\n09 July 1988\nngngthanhmai@gmail.com\n+84938613093\nfacebook.com/ngngthanhmai\nlinkedin.com/in/ngngthanhmai\nTHANH MAI\nLIFE PHILOSOPHY\nYou dare to go through a hard struggle as the\nspirit moves you and definitely see the light at\nthe end of the tunnel.\nEXPERIENCE\nO\nMARKETING & MERCHANDISE MANAGER\nCon Cung Join Stock 2017 - Present\nPlan and develop merchandising strategies that balance customers'\nexpectations and company's objectives through analysing sales figures,\ncustomers reactions and market trends to anticipate product needs and\nplan product stock.\nMaximise customer interests and sales levels by online displaying\nproducts appropriately and produce layout plans for stores.\nForecast profits/sales and plan budgets base on monitor stock\nmovement and consider promotions, price changes, clearance.\nAchievements\nGrowth 120 stores with over 1 million shoppers per month.\nKeep brand's reputation and customers' trust in the media crisis\ncommunication.\nO\nDIGITAL MARKETING MANAGER\nCalifornia Management Group 2015 - 2017\nBuild plans and orientate strategies for Marketing Projects inside and\noutside of CMG to achieve superior customer engagement by strategically\nexploiting all aspects of the media marketing roadmap with the allocation\nof marketing budget to ensure achievement profit objectives.\nCreate marketing programs including: establish pricing strategy,\nbuilding communication strategies, planing activations/promotions to\nbuild category connection with consumers, forecasting and allocation of\nmarketing budget to ensure achievement brand profit objectives.\nCo-ordinate between external partners and internal departments to\nensure the implementation of marketing activities, all aligned with the\nsystem.I also create appropriate tracking procedures to ensure\nproperexecution of these activities.\nAchievements\nMake California Fitness & Yoga the most interested fitness brand in the\nfitness industry.\nMost Valuable Player prize at CMG Award 2016.\n6/10 TOP content that generates the most engagement on social\nmedia in fitness industry.\n70o.0oo: new fans got in 6 months with the best cost ever.\nO\nDIGITAL MARKETING CONSULTANT\nHD Digital Agency 2014 - 2016\nAssist Digital Marketing Director with strategy and operational\ndecisions, whilst ofering generating marketing ideas and provide\nconsultancy during the client meeting.\nCreate and effectively disseminate digital content plans, coordinate,\nimplement and monitor targeted and segmented campaigns and\nprojects across relevant channels to promote the client's products and\nservices to customers.\nBuild and maintain strong, long-lasting customer relationships to\nanalyze customer needs; give the plan to approach the problem as the\npremise for the meeting of ideas and digital marketing plans for clients.\nAchievements\nReceive satisfaction from customers who cooperated: Coke, Close up,\nHazeline, KFC, Men's Biore, Điện Quang, Aviva Vietnam, Sapporo, Head\n& Shoulder, LinkedIn, Cat Tien Sa...\n50%: the growth rate of Galaxy Cinema revenue from social media with\nmy strategic and operation content role.\nO\nSENIOR MARKETING\nVNG Corporation 2011 - 2015\nBe responsible for the ativities of the MKT online products including:\npaid media (banner ads, GDN, SEM), PR, Social media, promotions,. to\nensure the objectives of branding, new user, revenue, churn user, ..\nProvide pr\nE\n0\nMOST PROUD OF\nall\nCon Cung's growth\nfrom 280 stores to 400 stores with over a\nmillion shopper per month\nY\nMost Valuable Player\nat California Management Group\nl\nMarking California Fitness & Yoga the\nmost interested fitness brand\nLeading in the fitness industry and\nFacebook honours Success Story to\ninspire marketer\nLF]\nVietnam Record\ncertificated by Organization Vietnam\nGuinness for the map of Vietnam with the\nmost representative images\ne\n10 years experience in marketing\nthrough strategy building and\nimplementing plans for 52 campaigns\nSTRENGTHS\nBusiness Strategy)\nProject Management)\n(ogical Thinking )Data Analysis )\nMarketing)\nPositive Attitude) (Taking Responsibility)\n(CFlexibility)\n(Assertiveness )\nCCreativity)\n(Self-Control )\nA\nHOBBIES AND INTERESTS\n1\nRUNNING\njoin Dalat Ultra Trail, Dragon Dash, 42race\nL\nCLIMBING & ADVENTURE TRAVEL\nconquer Fansipan, Ba Den and discover\nTu Lan Caves System\nQ\nTAKE CARE FAMILY\nhappily married and has one daughter\nn\nENTERTAINMENT\nMovie, Music, Photography\ni\nrelevant content production and promotion, including website, key\nvisual, content, technical and policy literature.\nCreate and effectively disseminate digital content (graphics, videos)\nacross various internal and external channels in supporting of above\nand below the line.\nAchievements\nManage the 2nd biggest social network with more than 4 million users.\n1 Vietnamese record: \"Online Map have attached most photo profile\" is\ncertificated by Organization Vietnam Guinness.\n3 online games (Include Gunny, Boom, Wartune): manage all activities of\nthe MKT online and get more 1 million users per month for each product.\n10.000 participants: implement the marketing communication for the\nevent\"Dai Hoi Lau Hanh\" in 12/2014, this is the ofline event that\natracted the most participants in the field of online games in Vietnam at\nthe moment there.\n85o.00: organize and operate 1 of the 2 largest fan page in the field of\nonline game.\nEDUCATION\nMBA of Business Administration at Ho Chi\nBusiness Training & Digital Marketing at BMG\nInternational Education\nEngineers of Information Technology at Hong\nBang International University\nO\nWEBMASTER\nHoang Quan Corporation Limited 2009 - 2011\nMaintain websites and servers to meet user needs, take responsibility\nfor making site easy to use, atractive and secure.\nWork closely with colleagues and external stakeholders to assess website\neffectiveness and identify opportunities for continuous improvement.", "educations": [{"id": 4837, "gpa": null, "major": "Quản lý đô thị và công trình", "school": "Ho Chi", "diploma": "Masters", "end_time": null, "conf_score": 0.754892152877782, "start_time": null, "picklist_major": "Architecture / Interior Design", "major_categories": "Kiến trúc và xây dựng", "major_categories_detail": "Kiến trúc và quy hoạch"}, {"id": 4838, "gpa": null, "major": "Công nghệ thông tin", "school": "Hong Bang International University", "diploma": "Other", "end_time": null, "conf_score": 0.8324313187237338, "start_time": null, "picklist_major": "IT - Hardware/Networking", "major_categories": "Máy tính và công nghệ thông tin", "major_categories_detail": "Công nghệ thông tin"}], "experiences": [{"id": 16195, "detail": "Plan and develop merchandising strategies that balance customers' expectations and company's objectives through analysing sales figures, customers reactions and market trends to anticipate product needs and plan product stock.\nMaximise customer interests and sales levels by online displaying products appropriately and produce layout plans for stores.\nForecast profits/sales and plan budgets base on monitor stock movement and consider promotions, price changes, clearance.\nAchievements Growth 120 stores with over 1 million shoppers per month.\nKeep brand's reputation and customers' trust in the media crisis communication.", "company": "Con Cung Join Stock", "end_time": "2023-04-13T00:00:00Z", "industry": "Other", "position": "MARKETING & MERCHANDISE MANAGER", "conf_score": 0.9125776658202421, "start_time": "2017-01-01T00:00:00Z"}, {"id": 16196, "detail": "Build plans and orientate strategies for Marketing Projects inside and outside of CMG to achieve superior customer engagement by strategically exploiting all aspects of the media marketing roadmap with the allocation of marketing budget to ensure achievement profit objectives.\nCreate marketing programs including: establish pricing strategy, building communication strategies, planing activations/promotions to build category connection with consumers, forecasting and allocation of marketing budget to ensure achievement brand profit objectives.\nCo-ordinate between external partners and internal departments to ensure the implementation of marketing activities, all aligned with the\nsystem.I also create appropriate tracking procedures to ensure properexecution of these activities.\nAchievements Make California Fitness & Yoga the most interested fitness brand in the fitness industry.\nMost Valuable Player prize at CMG Award 2016. 6/10 TOP content that generates the most engagement on social media in fitness industry. 70o.0oo: new fans got in 6 months with the best cost ever.", "company": "California Management Group", "end_time": "2017-01-31T00:00:00Z", "industry": "Other", "position": "DIGITAL MARKETING MANAGER", "conf_score": 0.8934852989433446, "start_time": "2015-01-01T00:00:00Z"}, {"id": 16197, "detail": "Assist Digital Marketing Director with strategy and operational decisions, whilst ofering generating marketing ideas and provide consultancy during the client meeting.\nCreate and effectively disseminate digital content plans, coordinate, implement and monitor targeted and segmented campaigns and projects across relevant channels to promote the client's products and services to customers.\nBuild and maintain strong, long-lasting customer relationships to analyze customer needs; give the plan to approach the problem as the premise for the meeting of ideas and digital marketing plans for clients.\nAchievements Receive satisfaction from customers who cooperated: Coke, Close up,\nHazeline, KFC, Men's Biore, Điện Quang, Aviva Vietnam, Sapporo, Head & Shoulder, LinkedIn, Cat Tien Sa... 50%: the growth rate of Galaxy Cinema revenue from social media with my strategic and operation content role.", "company": "HD Digital Agency", "end_time": "2016-01-31T00:00:00Z", "industry": "High Technology", "position": "DIGITAL MARKETING CONSULTANT", "conf_score": 0.9125776658202421, "start_time": "2014-01-01T00:00:00Z"}, {"id": 16198, "detail": "Be responsible for the ativities of the MKT online products including: paid media (banner ads, GDN, SEM), PR, Social media, promotions,. to ensure the objectives of branding, new user, revenue, churn user, .. Provide pr relevant content production and promotion, including website, key visual, content, technical and policy literature.\nCreate and effectively disseminate digital content (graphics, videos) across various internal and external channels in supporting of above and below the line.\nAchievements Manage the 2nd biggest social network with more than 4 million users.\n1 Vietnamese record: \"Online Map have attached most photo profile\" is certificated by Organization Vietnam Guinness. 3 online games (Include Gunny, Boom, Wartune): manage all activities of the MKT online and get more 1 million users per month for each product.\n10.000 participants: implement the marketing communication for the\nevent\"Dai Hoi Lau Hanh\" in 12/2014, this is the ofline event that atracted the most participants in the field of online games in Vietnam at the moment there. 85o.00: organize and operate 1 of the 2 largest fan page in the field of online game.", "company": "VNG Corporation", "end_time": "2015-01-31T00:00:00Z", "industry": "High Technology", "position": "SENIOR MARKETING", "conf_score": 0.9046002206438599, "start_time": "2011-01-01T00:00:00Z"}, {"id": 16199, "detail": "Maintain websites and servers to meet user needs, take responsibility for making site easy to use, atractive and secure.\nWork closely with colleagues and external stakeholders to assess website effectiveness and identify opportunities for continuous improvement.", "company": "Hoang Quan Corporation Limited", "end_time": "2011-01-31T00:00:00Z", "industry": "Other", "position": "WEBMASTER", "conf_score": 0.9219244899197291, "start_time": "2009-01-01T00:00:00Z"}], "address": null}