{"skills": ["online shopping", "postman", "regression", "payment", "excel", "banking", "business analysis", "enterprise", "analysis", "tester", "firebase", "sell", "online banking", "search", "sql", "jira", "mantis", "technology transfer", "testing", "microsoft", "sql query", "kibana", "assembla"], "fulltext": "1 \nNGUYỄN THỊ HỒNG YẾN \nApplication Tester Jobs \nWork place: Ho Chi Minh City \nDesired Job: \nFulltime \nCurrent salary: 15.5 Million \nPERSONAL INFORMATION \nGender: Female \nDate of birth: October 24th \n1993 \nPlace: Nam Dinh \nID No: 163258598 \nPlace of Issue: Nam Dinh Provincial \nPolice \nMarial Status : Single \nPermanent address: Hong Thuan Commune,Giao Thuy District, Nam Dinh Province \nCurrent address: Ho Chi Minh City \nACADEMIC RECORD \nSpecialized learning time: \nFro \nm \nTo \nMejor Subject \nSchool Name \nDegree \n2011 \n2015 \nApplied \nMathematics and \nInformatics \nHa Noi University of Science \n(Vietnam National University, \nHanoi) \nGraduated \n2015 \nTester \nIMIC Technology transfer joint \nstock company(Imicrosoft.edu.vn) Tester/QC \nCAREER GOALS \n● To obtain a position of tester to make use of my knowledge and bring into play my \nprofessional ability. Especially, I’d like to work at an outsourcing company to improve \nlanguage skills as well as knowledge of international technology. \n● To study to have very deep knowledge of auto test. \n● Hope to work at the company for a long time to sell myself and help develop company. \nSKILL \n● Understanding of test procedures and testing techniques \n● Having the skill, experience of writing: Specification, test plan, test care, test report \ndaily and report Monthly. \n● Having the capacity of business analysis and analyzed the business with customers \nfor Au job search project. \n● Carrying out the test, watching out and check the progress of fix bugs, the progress of \nproject to endure quality and deadline of the project. \n● Having experienced reporting bugs on some tools such as : Mantis-Jira, Assembla, \nand some tool for testing as Charles, Postman, Firebase, Kibana, Pycharm \n● Being proficient at Microsoft Word , Powerpoint, Excel. \n● English: Reading Comprehension, Professional English writing skills, exchanging \ndirectly with customers through Skype, Jira \n● Having basic knowledge of query data SQL. \nWORKING HISTORY AND PROJECT \n1. Period From - To: Sep 2015 – Sep 2017 \nCompany Name : Kiot-Viet Software joint stock (Citigo) Company \nPosition: The Tester and BA test analyze the job search system of the ApplyDirect \ncompany in Australia \nProject: \no \nhttp:/www.applydirect.com.au/ \no \nhttp://iworkfor.nsw.gov.au/ \no \nhttps://healthbuzz.applydirect.com.au/ \no \nCompany’s Description: It is one of three systems to find job exchanges \nbetween the job seeker and the largest employer in Australia, New Zealand. \nWebsite was built 9 years and is continuing to grow. \nJob Description: \n- Survey, analyze business, synthesize the function of the system for dev \nbefore starting to build system with 2 new job search website. \n2 \n3 \n- Make testcase, test and receive additional requests from customers, bug \ntracking and project progress \n- Write user instructions, query SQL data \n- Communicate directly with customers about the requirement as well as \nproposing options for optimizing system functions \n2. Period From - To: Sep 2017 – Aug 2018 \nCompany Name: VietNam Payment Solution Joint Stock Company \nPosition: Tester test the online payment service for the domestic and foreign App stores \nsuch as App functions, transfers, gadgets on the App: Airline Tickets, Movie Tickets, \nScan QR Pay ... \nProject: \no \nDomestic banks: Viettin Bank, BIDV, VP Bank, Vietcombank, \nLienVietPost bank, Agribank, SHB, ... and Cambodian banks. \no \nCambodian banks: Phillipbank, Cambodia bank, BIDC bank. \no \nCompany’s Description: providing services to more than 40 banks in \nVietnam, 5 telecom companies and more than 8000 enterprises, offering \nconvenient payment solutions such as: Mobile Banking application, VNPAYQR \npayment gateway, VNPAYQR, online shopping Online Banking VnTicket, \nVnTicket, VnThop, SMS Banking, VnPayBill, , VnMart e-wallet, multi-function, \n... \no \nJob Description: \n- \n- Make testcase, testplan after receiving the requirement from BA \n- \n- Test under testcase, log bug on Jira and track project progress to deadline \n- \n- Be the primary tester for the App Booking App \n- \n- Chat, test guide, support with projects in Cambodia \n- \n- Write guide for the customer \n3. Period From - To: August 2018 - Now \nCompany Name: Foody Corp \nPosition: Tester test orderAPI and interface on Now App, Foody App. \nProject: \nNow App, Foody App: both version Vietnam and Thailand. Test update version \nCompany’s Description: Now is an on-demand food delivery service app in Vietnam, \nalso featuring a variety of other local service such as fresh grocery & medicine, food \ndelivery, table booking… \no \nJob Description: \n- \nMake testcase, testplan after receiving the requirement from PM \n- \nContribute to establishing good software requirements, specifications, detailed \ndesigns UI/UX. \n- \nDevelop test plans, scenarios and test cases for functional, regression and system \n4 \nlevel tests for product, project.- Test under testcase, log bug on Jira and track \nproject progress to deadline \n- \nTest API if client hasn’t build yet by Charles, Postman \nUse and tracking log by Firebase, Kibana \nTest by query SQL \n- \n- \nHOBBIES \n• \nEnjoys learning, exploring new things. \n• \nEnjoy traveling, listening to music, watching movies, reading books ... \n• \nPrefer to participate in cultural exchanges. \nI declare that the information I have given above is true and complete in all respects. \nHo Chi Minh, April 2019 \nPerson providing the information \nNguyễn Thị Hồng Yến \n5 ", "educations": [{"id": 4824, "gpa": null, "major": "Toán tin", "school": "Ha Noi University of Science\n(Vietnam National University,\nHanoi)", "diploma": "Bachelors", "end_time": "2015-01-01T00:00:00Z", "conf_score": 0.8428647865008564, "start_time": "2011-01-01T00:00:00Z", "picklist_major": "IT - Hardware/Networking", "major_categories": "Toán và thống kê", "major_categories_detail": "Toán học"}], "experiences": [{"id": 16140, "detail": "test orderAPI and interface on Now App, Foody App. Project: Now App, Foody App: both version Vietnam and Thailand. Test update version\nCompany’s Description: Now is an on-demand food delivery service app in Vietnam, also featuring a variety of other local service such as fresh grocery & medicine, food delivery, table booking... o\nJob Description: - Make testcase, testplan after receiving the requirement from PM - Contribute to establishing good software requirements, specifications, detailed designs UI/UX. - Develop test plans, scenarios and test cases for functional, regression and system level tests for product, project.- Test under testcase, log bug on Jira and track project progress to deadline\nTest API if client hasn’t build yet by Charles, Postman Use and tracking log by Firebase, Kibana Test by query SQL", "company": "Foody Corp", "end_time": "2023-04-13T00:00:00Z", "industry": "FMCG", "position": "Tester", "conf_score": 0.9062566624575289, "start_time": "2018-08-01T00:00:00Z"}, {"id": 16141, "detail": "test the online payment service for the domestic and foreign App stores such as App functions, transfers, gadgets on the App: Airline Tickets, Movie Tickets, Scan QR Pay ... Project: o\nDomestic banks: Viettin Bank, BIDV, VP Bank, Vietcombank, LienVietPost bank, Agribank, SHB, ... and Cambodian banks. o\nCambodian banks: Phillipbank, Cambodia bank, BIDC bank. o\nCompany’s Description: providing services to more than 40 banks in\nVietnam, 5 telecom companies and more than 8000 enterprises, offering convenient payment solutions such as: Mobile Banking application, VNPAYQR payment gateway, VNPAYQR, online shopping Online Banking VnTicket, VnTicket, VnThop, SMS Banking, VnPayBill, , VnMart e-wallet, multi-function,\n... o\nJob Description: - - Make testcase, testplan after receiving the requirement from BA - - Test under testcase, log bug on Jira and track project progress to deadline\n- - Be the primary tester for the App Booking App - - Chat, test guide, support with projects in Cambodia - - Write guide for the customer", "company": "VietNam Payment Solution Joint Stock Company", "end_time": "2018-08-31T00:00:00Z", "industry": "High Technology", "position": "Tester", "conf_score": 0.9169439909506765, "start_time": "2017-09-01T00:00:00Z"}, {"id": 16142, "detail": "est analyze the job search system of the ApplyDirect company in Australia Project: o http:/www.applydirect.com.au/ o http://iworkfor.nsw.gov.au/ o https://healthbuzz.applydirect.com.au/ o\nCompany’s Description: It is one of three systems to find job exchanges between the job seeker and the largest employer in Australia, New Zealand. Website was built 9 years and is continuing to grow.\nJob Description: - Survey, analyze business, synthesize the function of the system for dev before starting to build system with 2 new job search website.\n- Make testcase, test and receive additional requests from customers, bug tracking and project progress\n- Write user instructions, query SQL data\n- Communicate directly with customers about the requirement as well as proposing options for optimizing system functions", "company": "Kiot - Viet Software joint stock (Citigo) Company", "end_time": "2017-09-30T00:00:00Z", "industry": "High Technology", "position": "Tester and BA", "conf_score": 0.8810150449679194, "start_time": "2015-09-01T00:00:00Z"}, {"id": 16143, "detail": "● To obtain a position of tester to make use of my knowledge and bring into play my professional ability. Especially, I’d like to work at an outsourcing company to improve language skills as well as knowledge of international technology.\n● To study to have very deep knowledge of auto test.\n● Hope to work at the company for a long time to sell myself and help develop company.", "company": "IMIC Technology transfer joint stock company", "end_time": "2015-12-31T00:00:00Z", "industry": "High Technology", "position": "Tester", "conf_score": 0.8757252098597131, "start_time": "2015-01-01T00:00:00Z"}], "address": "Hong Thuan Commune,giao Thuy District, Nam Dinh Province"}