{"skills": ["search", "ethereum", "robot", "studio", "ssl", "css", "algorithm", "finance", "structure", "html", "reactjs", "cryptocurrency", "email marketing", "bing", "rss", "google ads", "search engine", "wordpress", "facebook pixel", "marketing", "moz", "payment", "blockchain", "cfs", "hubspot", "banking", "digital marketing", "xml", "spice", "cfo", "enterprise", "futures", "php", "bitcoin", "management"], "fulltext": "OVERVIEW \nAs a Mannger/Senior Digital Marketing Specialist with 6 years of experience, I always \nunderstand thoroughly and master obviously Google algorithm, basic and advanced technique \nto improve the rank and top 1-5 position, optimize CPM, CPC, CPA, CPV, CPL to receive large \nsource of access from customers everywhere to bring the effective turnover for the Enterprise. \nI increasingly learn and share my experience. I always set the highest target to obtain \nsuccess. Enthusiasm in work as well as effective work management, friendly with colleague and \nprove with the senior manager the trust and confidence regarding my Senior Digital Marketing \nSpecialist job. \nSKILLS \n- \nSEO (SEO Onpage and SEO Offpage) \n- \nPerformace Pay Ads (Adwords, GDN, Youtube, Facebook) \n- \nASO (App Store Optimization CH Play and App Store) \n- \nContent (Landing page, Ads, Blog) \n- \nKnown Design Banner, Design Video, Design Website \n- \nPlan & Report for Manager and Head Marketing \nNguyen Nghia Thanh \nManager / Senior Digital Marketing \nForeign Trade University \n2010 - 2015 \nBachelor of External Economic \nUniversity Finance - Marketing \n2010 – 2013 \nBachelor of Information System \nCertificate B on English – Ho Chi Minh city Banking University \nEDUCATION \nEXPERIENCE \nQUOINE VIETNAM \nHo Chi Minh, VN \nSenior Performance Digital Marketing Specialist \n04.2018 – 05.2019 \n“QUOINE is a leading fintech company that provides trading, exchange, and next generation \nfinancial services powered by blockchain technology. QUOINE believe cryptocurrencies and \nblockchain technology will shape the future of financial services. QUOINE is a FinTech company at \nheart, focused on making financial services accessible to all. QUOINE is now building Liquid by \nQUOINE a global liquidity platform backed by our QASH token.” \nJob description \n- Optimize SEO and improve ranking keyword for Homepage: Liquid.com code by PHP, App \npage: app.liquid.com code by Reactjs and blog.liquid.com code by Hubspot \n- Optimize CPA pay ads Google Adword, GDN on Global market \n- Suggest and combination with content team and design team, frontend team create “Buy \npage” (Buy bitcoin, Buy Ethereum with Fiat…) \n- Develop content on Quora, Yahoo news, Google News, Wikipedia \n- Structure Youtube channel \n- Research page and activitives big competitor (Binance, OKEX, Coinbase, Houbi…) \n- Research Data and Audience Customer and develop benefit page and optimize campaign \n- Have new idea in Digital Marketing (Ex: Suggest have extension Chrome for user, create page \nshare ebook cryptocurrency get signup) \n- Traing SEO technical for Frontend team and Digital Marketing team \n- Plan and report campaign for Manager and Head Marketing \nThai Long Consumer of Ngoc Nghia Group \nHo Chi Minh, VN \nSenior Digital Marketing Specialist \n08.2017 – 04.2018 \n“Thai Long Consumer Ltd., ( belong to Ngoc Nghia Group ) is a trading company major in local \ntidbits distribution which is specialized in spices and foods. Now, Thai Long is famous about spice \nbrands in the market ( fish sauce , soy sauce , chili sauce, seasoning ,..) .Indeed, there are 2 \noutstanding brands : Thai Long & Kabin fish sauce .” \nJob description \n- Schedule plan yearly and monthly overview of work, arrange weekly the plan in detail and \nmade result of the work and budget forecasts according to KPI running the Digital Marketing. \n- Collaborate with Brand Manager to bring trends and approach consumers including channel \nDigital Marketing , keyword, Promotions. \n- Report the performance and budget to CFO and Head Marketing. \n- Collaborate with Design Manager to create Landing page layout, Private Blog Network layout, \nPayment layout, Homepage layout, Template brand Facebook post. \n- List of keywords with high search volume on products, brands and topic related to facility. \n- Check the standard SEO content from the Agency. Build SEO articles, CTA content standard. \n- Protect brand on Social Network, Google search. Against the negative user behavior. \n- Optimize code, loading speed and SEO website Homepage, Landing page, Private Blog \nNetwork website, building backlink high PA/DA, TF/CF. \n- Optimize performance CPM, CPA, CPC, CPV, CPL increase Adword, GDN, Facebook Ads. \n- Set code optimize include Goal (Google) and Pixel (Facebook) get converstion rate. \n- Run big budget 3 billion VNĐ/month campaign in Vietnam and Global. \nVinaHost Co.,LTD \nHo Chi Minh, VN \nDigital Marketing Specialist \n04.2015 – 08.2017 \n“ VinaHost is a company specialized in supplying services such as Hosting, Server, VPS, Domain, \nSSL Certificate, Colocation, server management, website design in Vietnam market.” \nJob description \n- Perform SEO of foreign key words about company services such as Server, Dedicated Server, \nHosting, Domain, VPS, Email Hosting, Email Marketing on Google. Com search engine (English, \nVietnamese), Google.com.vn (English, Vietnamese) \n- Optimize Onpage standard to be suitable with search engine such as Google, Bing, Yahoo, \nYandex, Coccoc.. \n+ Use SEO tools such as SEO Squake, SEO Doctor, Open SEO Start, IBP, analyze tags of \nmeta, title, description, Robots.txt, sitemap.xml, RSS, Link post, Keyword, Heading, Meta languge \n(vi- VN, en- US), Doctype... \n+ Competitive research of competitors about keyword, backlink by tools (Moz Bar, Ahref , \nSEO Power Suite ) , writing to make general marketing SEO plan. \n+ Suggest, give out solutions to prevent methods of competitors: bad link, name of \nbrand-name + defrauded “keyword” to protect tradename on social network channels. \n+ Optimize W3C standard website source code: HTML, CSS. \n+ Build satellite site system for specific product by Wordpress code source, heighten \nGoogle standard user’s experience. \n+ Consider for approval of SEO (SmallSEOTool, DMCA) articles from content staff and \ninstruct staff content how to write an article. \n+ Design google standard banner, resize banner and professional admicro for Google \nAdSense advertising, run digital marketing by Photoshop, AI,Xara 3D Text... \n+ Design the content of youtube advertising clip on promotion program, product, IT \ntechnique. Link : https://youtube.com/vinahost \n+ Write an article to share SEO knowledge on knowledge base to share community. \n- Manage account, setup budget, content, keyword, optimize CTR, run Adwords advertising, \nRemarketing (GDN). \n- Perform CPC Coc Coc advertising. \n- Manage and perform setup, optimize Remarketing Facebook advertising sample. \n- Manage to perform Email Marketing campaigns for promotion program. \nOTHER ACTIVITIES \nParticipate in team building activities, listening to music, reading book, web browsing, \ntourism, playing football. \nParticipate in learning and exchanging knowledge from big SEO, ADWORD, SEM, DIGITAL \nMARKETING community in Vietnam. \n- Manage and supervise members in team to perform Digital Marketing program to keep pace \nwith progress (registration, performance, report). \n+ Build quality Backlink system from PA7-PA9, backlink from satellite web. \n+ Approve SEO standard article from editor, technique to insert keyword and backlink \neffectively in articles and website key position. \n+ Design and edit SEO standard images (name image, link image, size, type JPG or PNG) \nby Photoshop, AI resize standard of Adsense Google, Micro Ad advertising set. \n+ Design, edit Youtube SEO Video by Adobe Effect and Camsita Studio. \n+ Follow SEO competitors and find solution to keep position stable. \n+ Check competitive level to the partners. ", "educations": [{"id": 4834, "gpa": null, "major": "Kinh tế quốc tế", "school": "Foreign Trade University", "diploma": "Bachelors", "end_time": "2015-01-01T00:00:00Z", "conf_score": 0.8418756527141341, "start_time": "2010-01-01T00:00:00Z", "picklist_major": "Economical", "major_categories": "Khoa học xã hội và hành vi", "major_categories_detail": "Kinh tế học"}, {"id": 4835, "gpa": null, "major": "Hệ thống thông tin", "school": "University Finance - Marketing", "diploma": "Bachelors", "end_time": "2013-01-01T00:00:00Z", "conf_score": 0.7851615749618549, "start_time": "2010-01-01T00:00:00Z", "picklist_major": "IT - Hardware/Networking", "major_categories": "Máy tính và công nghệ thông tin", "major_categories_detail": "Máy tính"}], "experiences": [{"id": 16187, "detail": "“QUOINE is a leading fintech company that provides trading, exchange, and next generation financial services powered by blockchain technology. QUOINE believe cryptocurrencies and blockchain technology will shape the future of financial services. QUOINE is a FinTech company at heart, focused on making financial services accessible to all. QUOINE is now building Liquid by\nQUOINE a global liquidity platform backed by our QASH token.”\nJob description\n- Optimize SEO and improve ranking keyword for Homepage: Liquid.com code by PHP, App page: app.liquid.com code by Reactjs and blog.liquid.com code by Hubspot - Optimize CPA pay ads Google Adword, GDN on Global market\n- Suggest and combination with content team and design team, frontend team create “Buy page” (Buy bitcoin, Buy Ethereum with Fiat...) - Develop content on Quora, Yahoo news, Google News, Wikipedia - Structure Youtube channel\n- Research page and activitives big competitor (Binance, OKEX, Coinbase, Houbi...) - Research Data and Audience Customer and develop benefit page and optimize campaign\n- Have new idea in Digital Marketing (Ex: Suggest have extension Chrome for user, create page share ebook cryptocurrency get signup)\n- Traing SEO technical for Frontend team and Digital Marketing team\n- Plan and report campaign for Manager and Head Marketing", "company": "QUOINE VIETNAM", "end_time": "2019-05-31T00:00:00Z", "industry": "Other", "position": "Senior Performance Digital Marketing Specialist", "conf_score": 0.9309791790920914, "start_time": "2018-04-01T00:00:00Z"}, {"id": 16189, "detail": ", ( belong to Ngoc Nghia Group ) is a trading company major in local tidbits distribution which is specialized in spices and foods. Now, Thai Long is famous about spice brands in the market ( fish sauce , soy sauce , chili sauce, seasoning ,..) .Indeed, there are 2 outstanding brands : Thai Long & Kabin fish sauce .” Job description\n- Schedule plan yearly and monthly overview of work, arrange weekly the plan in detail and made result of the work and budget forecasts according to KPI running the Digital Marketing. - Collaborate with Brand Manager to bring trends and approach consumers including channel\nDigital Marketing , keyword, Promotions. - Report the performance and budget to CFO and Head Marketing. - Collaborate with Design Manager to create Landing page layout, Private Blog Network layout,\nPayment layout, Homepage layout, Template brand Facebook post.\n- List of keywords with high search volume on products, brands and topic related to facility.\n- Check the standard SEO content from the Agency. Build SEO articles, CTA content standard.\n- Protect brand on Social Network, Google search. Against the negative user behavior.\n- Optimize code, loading speed and SEO website Homepage, Landing page, Private Blog Network website, building backlink high PA/DA, TF/CF. - Optimize performance CPM, CPA, CPC, CPV, CPL increase Adword, GDN, Facebook Ads. - Set code optimize include Goal (Google) and Pixel (Facebook) get converstion rate.\n- Run big budget 3 billion VNĐ/month campaign in Vietnam and Global.", "company": "Thai Long Consumer of Ngoc Nghia Group", "end_time": "2018-04-30T00:00:00Z", "industry": "Other", "position": "Senior Digital Marketing Specialist", "conf_score": 0.8932364140130028, "start_time": "2017-08-01T00:00:00Z"}, {"id": 16191, "detail": "“ VinaHost is a company specialized in supplying services such as Hosting, Server, VPS, Domain, SSL Certificate, Colocation, server management, website design in Vietnam market.”\nJob description\n- Perform SEO of foreign key words about company services such as Server, Dedicated Server, Hosting, Domain, VPS, Email Hosting, Email Marketing on Google. Com search engine (English, Vietnamese), Google.com.vn (English, Vietnamese) - Optimize Onpage standard to be suitable with search engine such as Google, Bing, Yahoo, Yandex, Coccoc.. + Use SEO tools such as SEO Squake, SEO Doctor, Open SEO Start, IBP, analyze tags of meta, title, description, Robots.txt, sitemap.xml, RSS, Link post, Keyword, Heading, Meta languge (vi- VN, en- US), Doctype... + Competitive research of competitors about keyword, backlink by tools (Moz Bar, Ahref , SEO Power Suite ) , writing to make general marketing SEO plan.\n+ Suggest, give out solutions to prevent methods of competitors: bad link, name of brand-name + defrauded “keyword” to protect tradename on social network channels.\n+ Optimize W3C standard website source code: HTML, CSS. + Build satellite site system for specific product by Wordpress code source, heighten\nGoogle standard user’s experience.\n+ Consider for approval of SEO (SmallSEOTool, DMCA) articles from content staff and instruct staff content how to write an article.\n+ Design google standard banner, resize banner and professional admicro for Google AdSense advertising, run digital marketing by Photoshop, AI,Xara 3D Text... + Design the content of youtube advertising clip on promotion program, product, IT technique. Link : https://youtube.com/vinahost\n+ Write an article to share SEO knowledge on knowledge base to share community.\n- Manage account, setup budget, content, keyword, optimize CTR, run Adwords advertising,\nRemarketing (GDN). - Perform CPC Coc Coc advertising.\n- Manage and perform setup, optimize Remarketing Facebook advertising sample.\n- Manage to perform Email Marketing campaigns for promotion program.\n- Manage and supervise members in team to perform Digital Marketing program to keep pace with progress (registration, performance, report).\n+ Build quality Backlink system from PA7-PA9, backlink from satellite web.\n+ Approve SEO standard article from editor, technique to insert keyword and backlink effectively in articles and website key position.\n+ Design and edit SEO standard images (name image, link image, size, type JPG or PNG) by Photoshop, AI resize standard of Adsense Google, Micro Ad advertising set.\n+ Design, edit Youtube SEO Video by Adobe Effect and Camsita Studio. + Follow SEO competitors and find solution to keep position stable.\n+ Check competitive level to the partners.", "company": "VinaHost Co.,LTD", "end_time": "2017-08-31T00:00:00Z", "industry": "Other", "position": "Digital Marketing Specialist", "conf_score": 0.9309791790920914, "start_time": "2015-04-01T00:00:00Z"}], "address": null}