{"skills": ["search", "recruiting", "team management", "project estimation", "java", "typescript", "github", "testing", "agile", "automation", "babel", "firebase", "java technology", "python", "jira", "reactjs", "cypress", "e learning", "redis", "design pattern", "automation testing", "ubuntu", "mysql", "symfony", "wordpress", "oracle", "kanban", "software design pattern", "security", "project management", "product management", "django", "marketing", "selenium", "learning management system", "clarify", "sales", "phpstorm", "html5", "oop", "strut", "make decision", "website development", "postcss", "performance optimization", "mobile application", "sales and marketing", "crm", "pwa", "laravel", "implementation", "cache", "mobile apps", "ams", "docker", "restful", "workflow", "jenkins", "hibernate", "php", "sdlc", "puppeteer", "system design", "mongodb", "tester", "vuejs", "centos", "sentry", "spring", "management", "aws", "gitlab", "redmine"], "fulltext": "Product Manager - Engineering Team Lead\nNAM DAU\n//  CAREER OJECTIVE\nAs a tech-savvy product manager, I am seeking opportunities to work in a \nprofessional and fast-growing environment where I can utilize my skills and \nput my maximum effort into building and shipping cutting-edge quality \nproducts that help solving real-world problems.\n//   CONTACT\nMobile\n+84 901 380 659\nEmail namdq.nu@gmail.com\nSkype n_uuuuuuuu\nLinkedin https://www.linkedin.com/in/namdq\nGithub https://github.com/namdau\n//  PERSONAL SUMMARY\nI have been producing and deploying web-based and mobile applications for \nmore than 8 years.\nI'm currently leading a team of talented engineers, designers and testers to \nhelp building an exclusive tech talents platform in Vietnam.\nI have relevant experience of building up and maintaining engineering teams.\nI'm obsessed with process and workflow optimizations.\nI admire open-minded people and healthy working environments where \neveryone should be encouraged to express their ideas and contribute as a \nteam.\n//  TECH SKILLS\nPHP, Javacript, TypeScript, \nES2015-2018, Nodejs, Python\nSymfony, Laravel, Django, Wordpress, \nVuejs, Reactjs\nHTML5, SASS, Pug, Stylus, PostCSS, \nWebpack, Babel, PWA\nMySQL, Postgres, Redis, MongoDB, \nFirebase\nAWS services: S3, Elastic Beanstalk, \nEC2, Route5, Cloudfront, VPC, RDS, \nElastic Cache, Elastic Container \nService, Elastic Search\nDocker, GitlabCI, CirleCI, Jenkins, \nUbuntu, CentOS\nAutomation testing: Selenium, \nCypress, Puppeteer\n//   SPECIALITIES\nManage the complete SDLC for software projects\nExperience in designing and building up RESTful web services, API, \nwebsites, portals, CMS\nBuild up and maintain sustainable engineering team, provide mentorship \nin career path development, as well as resolve conflicts and conduct \nperformance reviews.\nDesign and setup assessment framework for hunting, hiring and \nnurturing tech talents.\nWork with non-technical and management teams to clarify product \nscopes, vision and business goals\nSoftware design patterns, OOP, SOLID, best security pratices\nAgile team management using Scrum and Kanban\n//   TOOLS\nEditor: VS Code, Sublime Text, \nPHPStorm, Vim, iTerm2\nProject management: Jira, Confluence, \nPivotalTracker, Google Apps, Redmine\nSCM: Github, self-hosted Gitlab \nCommunication: Google Apps, Slack, \nError monitoring: Sentry\nWireframing: Sketch, InvisionApp, \nBalsamiq, Userflow, Marvelapp\nPencil & paper\n//  EXPERIENCES\n02/2018 - Current\nSaigon\nProduct Manager\nPangara AB\nOversee product development and run the engineering \nteam in Vietnam, responsibles include:\nDefine product scope, roadmap and release plans\nRecruit and mentor development team members\nWork with designers to create product design system\nTypical product management activites: sprint planning and \nreviewing, wireframing, code reviewing, release demo\nProvide technical strategy for measuring sales and \nmarketing efforts\nProvide technical consultancy and help creating materials \nfor setting up assessment solution to qualify freelace \ndevelopers, as part of the company's business model\nCo-organise the first Vuejs Vietnam Meetup as I'm of the \nfounding member of the community in Vietnam\nPangara AB\n09/2016 - 01/2018\nSaigon\nTechnical Lead\nJoin as the first product team member and has been in charge \nof it ever since.\nManage development team\nAssess and make decisions on technical choices\nParticipate in recruiting and interviewing freelance \ndevelopers\nEtablish product developement strategy and setup CI/CD \nworkflow\nHeld code review sessions and workshops for improving \nquality and productivity\nConstruct Digital\n12/2015 - 08/2016\nSaigon\nTech Lead cum Chief Representative\nResponsible for the production team in Vietnam, take part in \nclient consulting as well as project estimation, provide \ntechnical guidance and training on a daily basis. Featured \nprojects:\nGain City: develop and maintain the ecommerce website \nfor Gain City – one of the biggest electronic devices \nretailers in Singapore\nhttps://www.gaincity.com\nTupperware: develop and maintain the CMS and API \nthat built on top of Django for Tupperware Brands \nmobile apps, which has been deployed on Singapore, \nMalaysia, Indonesia and Philippines markets.\nLamitak: rebuild the website for a laminates \nmanufacturer.\nhttps://www.lamitak.com\n//  EXPERIENCES\n11/2013 - 11/2015\nSingapore\nSenior Web Developer\nConstruct Digital\nAs a member of production team, I work accross multiple \nclient's projects various in different categories: CMS, marketing \ntool, CRM, micro-sites, landing pages. I'm also assigned to \nserveral UX and performance optimization cases. Featured \nprojects:\nIKEA - Experience the power of a bookbook™: an Apple-\nparody campaign, which instantly went viral on YouTube \nand got featured on Time, Telegraph, Mashable, \nTodayOnline, as well as a bunch of other magazines.\nShinyoen: a worldwide e-learning management system for \nan international Buddhist organisation that serves \ncustomers in many locations (Singapore, Taiwan, Japan)\nCoastCyles: online store for an outdoor gears manufacturer, \nbuilding everything from scratch\nStudent Connect: a career platform for young professional \nin Singapore, Hong Kong and Indonesia.\n08/2011 - 08/2013\nDa Nang\nCo-founder Revo21\nCo-create and operate a start-up provides an advanced \npublishing platform to help authors, publishers, designers and \nartists deliver their works to the readers like never before by \nturning the content into interactive apps that run on mobile \ndevices.\n09/2010 - 06/2011\nSaigon\nAssociate Software Engineer\nCSC (now DXC Technology)\nStart my career as an Associate Software Engineer (got \npromoted to Software Engineer before I left). I work mostly \nwith Java technologies, participate in implementation and \nmaintainance activites for client's projects using Spring, \nHibernate, Struts and Oracle.\n//  EDUCATION\nVietnam National University HCMC- International University\nBachelor of Engineering, Computer Science\nhttps://hcmiu.edu.vn\n//  OPEN SOURCE\nA core member of the official Vuejs Vietnam group\nhttps://github.com/orgs/vuejs-vn/people\nCo-organise and give a speak at the first Vuejs Vietnam meetup\nhttps://www.meetup.com/vuejs-vietnam/events/247572268/", "educations": [{"id": 4836, "gpa": null, "major": "Khoa học máy tính", "school": "Vietnam National University HCMC - International University", "diploma": "Bachelors", "end_time": null, "conf_score": 0.740186394012631, "start_time": null, "picklist_major": "IT - Hardware/Networking", "major_categories": "Máy tính và công nghệ thông tin", "major_categories_detail": "Máy tính"}], "experiences": [{"id": 16186, "detail": "Oversee product development and run the engineering team in Vietnam, responsibles include:\nDefine product scope, roadmap and release plans\nRecruit and mentor development team members\nWork with designers to create product design system\nTypical product management activites: sprint planning and reviewing, wireframing, code reviewing, release demo\nProvide technical strategy for measuring sales and marketing efforts\nProvide technical consultancy and help creating materials for setting up assessment solution to qualify freelace developers, as part of the company's business model\nCo-organise the first Vuejs Vietnam Meetup as I'm of the founding member of the community in Vietnam", "company": "Pangara AB", "end_time": "2023-04-13T00:00:00Z", "industry": "Other", "position": "Product Manager", "conf_score": 0.9542271074073599, "start_time": "2018-02-01T00:00:00Z"}, {"id": 16188, "detail": "Join as the first product team member and has been in charge of it ever since.\nManage development team\nAssess and make decisions on technical choices\nParticipate in recruiting and interviewing freelance developers\nEtablish product developement strategy and setup CI/CD workflow\nHeld code review sessions and workshops for improving quality and productivity", "company": "Pangara AB", "end_time": "2018-01-31T00:00:00Z", "industry": "Other", "position": "Technical Lead", "conf_score": 0.9664944150740037, "start_time": "2016-09-01T00:00:00Z"}, {"id": 16190, "detail": "Responsible for the production team in Vietnam, take part in client consulting as well as project estimation, provide technical guidance and training on a daily basis. Featured projects:\nGain City: develop and maintain the ecommerce website for Gain City - one of the biggest electronic devices retailers in Singapore https://www.gaincity.com\nTupperware: develop and maintain the CMS and API that built on top of Django for Tupperware Brands mobile apps, which has been deployed on Singapore, Malaysia, Indonesia and Philippines markets.\nLamitak: rebuild the website for a laminates manufacturer. https://www.lamitak.com", "company": "Construct Digital", "end_time": "2016-08-31T00:00:00Z", "industry": "High Technology", "position": "Tech Lead cum Chief Representative", "conf_score": 0.9664944150740037, "start_time": "2015-12-01T00:00:00Z"}, {"id": 16192, "detail": "As a member of production team, I work accross multiple client's projects various in different categories: CMS, marketing tool, CRM, micro-sites, landing pages. I'm also assigned to serveral UX and performance optimization cases. Featured projects:\nIKEA - Experience the power of a bookbookTM: an Apple- parody campaign, which instantly went viral on YouTube and got featured on Time, Telegraph, Mashable, TodayOnline, as well as a bunch of other magazines.\nShinyoen: a worldwide e-learning management system for an international Buddhist organisation that serves customers in many locations (Singapore, Taiwan, Japan) CoastCyles: online store for an outdoor gears manufacturer, building everything from scratch\nStudent Connect: a career platform for young professional in Singapore, Hong Kong and Indonesia.", "company": "Construct Digital", "end_time": "2015-11-30T00:00:00Z", "industry": "High Technology", "position": "Senior Web Developer", "conf_score": 0.9665185576724751, "start_time": "2013-11-01T00:00:00Z"}, {"id": 16193, "detail": "o-create and operate a start-up provides an advanced publishing platform to help authors, publishers, designers and artists deliver their works to the readers like never before by turning the content into interactive apps that run on mobile devices.", "company": "Revo21", "end_time": "2013-08-31T00:00:00Z", "industry": "Other", "position": "Co - founder", "conf_score": 0.9522414576104914, "start_time": "2011-08-01T00:00:00Z"}, {"id": 16194, "detail": "Start my career as an Associate Software Engineer (got promoted to Software Engineer before I left). I work mostly with Java technologies, participate in implementation and maintainance activites for client's projects using Spring, Hibernate, Struts and Oracle.", "company": "CSC (now DXC Technology)", "end_time": "2011-06-30T00:00:00Z", "industry": "High Technology", "position": "Associate Software Engineer", "conf_score": 0.8948419004195385, "start_time": "2010-09-01T00:00:00Z"}], "address": null}