{"skills": ["warehousing", "recruiting", "administration", "analysis", "automation", "parcel", "strategic planning", "vendor management", "human resources", "market research", "sales", "lms", "mobile application", "preparing business plan", "implementation", "recruitment", "market analysis", "management"], "fulltext": "NGUYEN MANH TRUONG \n(JOHN NGUYEN) \nE-COMMERCE LOGISTICS PROFESSIONAL \nVietnamese | (+84) 983190831 | johnnguyen3636@gmail.com \nSummary \nJohn is an E-commerce logistics professional with 6+ years of working experiences in the industry across South East Asia. \nHe is expert in Logistics Management including Warehousing, Own-Fleet Delivery, Third Party Logistics and On-demand \nLogistics. Moreover, John has worked with different systems (from startup to big corporation), and with different points of \nview (from client to service provider to middle-man). He is able to drive the business in both operation and sales toward \ncompany targeted goals. \nAREAS OF EXPERTISE: \n•  Experience with all Logistics aspect from warehousing to delivery, especially within E-commerce industry. \n• Functionally strong experience on Order Managing System, Warehouse Inventory Master, Routing Systems and other \nsupportive system. \n• Projecting PnL and setup strategic planning \n• Forecast Demand and Supply and balance it through peak time \n• Establishing new entity and mange it \nWork History \nMar 2018 - Present \nVietnam Country Manager \nDOSTAVISTA GLOBAL \nEstablish MrSpeedy Vietnam and operate it from Day 1: including localizing product to fit with \nVietnam situation, recruitment of team, support technical and legal setup, prepare PnL and \nstrategic planning… Also, as the business starts, manage both sales and operation to ensure the \ndemand and supply matched.   \nMay 2016 – Feb 2018 \nVietnam Country Manager \nSENDIT AISA \nSet up a new branch in Vietnam specialized in E-commerce Logistics Solution including 2-stage \nand on-demand service. Being responsible for all activities of the company including working with \nLegal to set up company in Vietnam, recruiting employees, preparing business plan for investors, \ndoing market research, performing initial sale… \nDec 2015 – May 2016 \nHead Of Transportation \nACOMMERCE ASIA \nResponsible for all transportation activities of aCommerce Thailand including managing Third \nParty Logistics companies (3PLs) and Own Fleet delivery. Establish, develop and managing good \nrelationship with 3PLs; Manage own fleet delivery with good routing for both motorbikes and \ntrucks; Enable Same Day Delivery for Bangkok, Next Daly Delivery for nationwide; Support \nWarehouse on new warehouse layout, Warehouse Automation with Handset and Conveyer Belt… \n• \nIncrease Own Fleet delivery capacity from 200 orders/day to 800 orders/day with productivity \nof 25 drops/bike and 21 drops/truck \n• \nDecrease backlog and long pending orders from >5% to be below 1% within 1 month. \n• \nSelectively enable Same Day Delivery for Bangkok and Next Day Delivery for some clients. \n• \nBring cost/order down by 15% in Q1 2016, compared to Q4 2015. \nApr 2015 – Nov 2015 \nSenior Logistics Associate \nLAZADA SINGAPORE \nManage 3PL’s performance on Pickup and Delivery on a daily, weekly and monthly basis. \nEstablish, develop and managing own fleet delivery with appropriate human resources and cost \nbalance. Collaborate with Marketplace Operations team and Partner Support team to provide \ncustomer the best experience while buying at Lazada. Work with regional office on new projects \nto enhance delivery service (Same Day Delivery, N+1 Delivery, 3PL API Connection, Network \nIntelligence, Differentiated Shipping Options...). Support Warehouse on new projects (Warehouse \nMove, Return SOP, Postal Delivery...) \n• \nFacilitated the successful development of Lazada Own Fleet Delivery (increase the \ncontribution from <5% to >20% of Lazada volume). \n• \nPush delivery cost per parcel down by 250% for Own Fleet Delivery and 20% for 3PL \ndelivery. \n• \nSuccessfully manage to roll-out Same Day Delivery and Postal Delivery ontime with high \ncustomer satisfaction (Net Promoter Score >85%). \n• \nDrive Network Intelligence projects - getting more status from 3PLs’ systems to provide \ncustomer transparency on the delivery (getting 40% of statuses from 3PL systems). \nMar 2013 – Mar 2015 \nLogistics Development Manager \nLAZADA VIETNAM \nDevelop Lazada Own Fleet delivery with more hub opening, franchising, pickup routing, mobile \napplication and implement Logistics Management System (LMS). Creating and develop 3PL \nmanagement, including building KPIs, SOP for managing 3PL’s performance, status updates and \ncost control. Support Logistics Directors and COO with strategic planning and analysis. \nCollaborate with Warehouse team with cost driven projects (new packaging materials and box \nsizes, new warehouse movement, universal airway bill implementation...). Work with regional \noffice on new projects to enhance delivery service (Express Delivery, Promised Leadtime, 3PL \nAPI Connection, Network Intelligence, Vendor Management Squad...) \n• \nSuccessfully manage the development of Lazada Own Fleet Delivery (with 20 delivery Hubs \nin 13 cities, 200 drivers, 30 trucks, cover 75% of Vietnam and account for 45% of Lazada \nvolume) with competitive cost. \n• \nDrive new packaging material and box sizes project to save 100mil VND delivery cost every \nmonth. \n• \nContribute to the fast development of warehouse (move from 3,000 m2 warehouse to a 7,000 \nm2 warehouse with regional blueprint applied). \n• \nEstablish and monitor 3PL API connection with all logistics companies including state-owned \ncompanies like VNPost and Viettel. \n• \nProvide Express Delivery for main cities (Ho Chi Minh and Ha Noi) with high customer \nsatisfaction. \nApr 2012 – Dec 2012 \nAssistant Distribution Development Manager \nMICHELIN VIETNAM \nAssist DDM on managing sales report of retailers and wholesalers. Create and maintain daily, \nweekly and monthly KPIs for sales team. Calculate bonus for merchants, conduct market analysis \nand competitor evaluation. Support DDM on preparing monthly reports for regional director \nEducation \nForeign Trade University Ho Chi Minh City Campus \nMajor: International Business Administration \nReferences \nMrs. Phan Ngoc Mai Phuong \nDistribution Development Manager of Michelin Vietnam \nngocmaiphuong.phan@vn.michelin.com \nPhone: +84906883554 \nMr. Nguyen Hai Duong \nVice President Operation of Lazada Vietnam \nduong.nguyen@lazada.vn \nPhone: +84932082280 \nMs. Phensiri Sithianvongnusar \nRegional Operation Director of aCommerce Asia \nphensiri@acommerce.asia \nPhone: +66896905882 \nMr. Mark Cleaver \nGroup CEO of Sendit ASIA \nmark@sendit.asia \nPhone: +66970790003 ", "educations": [{"id": 4830, "gpa": null, "major": "Kinh tế công nghiệp", "school": "Foreign Trade University Ho Chi Minh City Campus", "diploma": "Bachelors", "end_time": null, "conf_score": 0.8316410973592406, "start_time": null, "picklist_major": "Technical", "major_categories": "Công nghệ kỹ thuật", "major_categories_detail": "Quản lý công nghiệp"}], "experiences": [{"id": 16171, "detail": "Establish MrSpeedy Vietnam and operate it from Day 1: including localizing product to fit with\nVietnam situation, recruitment of team, support technical and legal setup, prepare PnL and strategic planning... Also, as the business starts, manage both sales and operation to ensure the demand and supply matched.", "company": "DOSTAVISTA GLOBAL", "end_time": "2023-04-13T00:00:00Z", "industry": "Other", "position": "Vietnam Country Manager", "conf_score": 0.9124711261573154, "start_time": "2018-03-01T00:00:00Z"}, {"id": 16172, "detail": "Set up a new branch in Vietnam specialized in E-commerce Logistics Solution including 2-stage and on-demand service. Being responsible for all activities of the company including working with\nLegal to set up company in Vietnam, recruiting employees, preparing business plan for investors, doing market research, performing initial sale...", "company": "SENDIT AISA", "end_time": "2018-02-28T00:00:00Z", "industry": "High Technology", "position": "Vietnam Country Manager", "conf_score": 0.9124711261573154, "start_time": "2016-05-01T00:00:00Z"}, {"id": 16173, "detail": "Responsible for all transportation activities of aCommerce Thailand including managing Third Party Logistics companies (3PLs) and Own Fleet delivery. Establish, develop and managing good relationship with 3PLs; Manage own fleet delivery with good routing for both motorbikes and trucks; Enable Same Day Delivery for Bangkok, Next Daly Delivery for nationwide; Support Warehouse on new warehouse layout, Warehouse Automation with Handset and Conveyer Belt... • Increase Own Fleet delivery capacity from 200 orders/day to 800 orders/day with productivity of 25 drops/bike and 21 drops/truck\n• Decrease backlog and long pending orders from >5% to be below 1% within 1 month.\n• Selectively enable Same Day Delivery for Bangkok and Next Day Delivery for some clients.\n• Bring cost/order down by 15% in Q1 2016, compared to Q4 2015.", "company": "ACOMMERCE ASIA", "end_time": "2016-05-31T00:00:00Z", "industry": "Trade", "position": "Head Of Transportation", "conf_score": 0.9004514612842877, "start_time": "2015-12-01T00:00:00Z"}, {"id": 16174, "detail": "Manage 3PL’s performance on Pickup and Delivery on a daily, weekly and monthly basis.\nEstablish, develop and managing own fleet delivery with appropriate human resources and cost balance. Collaborate with Marketplace Operations team and Partner Support team to provide customer the best experience while buying at Lazada. Work with regional office on new projects to enhance delivery service (Same Day Delivery, N+1 Delivery, 3PL API Connection, Network Intelligence, Differentiated Shipping Options...). Support Warehouse on new projects (Warehouse Move, Return SOP, Postal Delivery...) • Facilitated the successful development of Lazada Own Fleet Delivery (increase the contribution from <5% to >20% of Lazada volume).\n• Push delivery cost per parcel down by 250% for Own Fleet Delivery and 20% for 3PL delivery.\n• Successfully manage to roll-out Same Day Delivery and Postal Delivery ontime with high customer satisfaction (Net Promoter Score >85%).", "company": "LAZADA SINGAPORE", "end_time": "2015-11-30T00:00:00Z", "industry": "High Technology", "position": "Senior Logistics Associate", "conf_score": 0.8878736814268848, "start_time": "2015-04-01T00:00:00Z"}, {"id": 16175, "detail": "Develop Lazada Own Fleet delivery with more hub opening, franchising, pickup routing, mobile application and implement Logistics Management System (LMS). Creating and develop 3PL management, including building KPIs, SOP for managing 3PL’s performance, status updates and cost control. Support Logistics Directors and COO with strategic planning and analysis.\nCollaborate with Warehouse team with cost driven projects (new packaging materials and box sizes, new warehouse movement, universal airway bill implementation...). Work with regional office on new projects to enhance delivery service (Express Delivery, Promised Leadtime, 3PL API Connection, Network Intelligence, Vendor Management Squad...) • Successfully manage the development of Lazada Own Fleet Delivery (with 20 delivery Hubs in 13 cities, 200 drivers, 30 trucks, cover 75% of Vietnam and account for 45% of Lazada volume) with competitive cost.\n• Drive new packaging material and box sizes project to save 100mil VND delivery cost every month.\n• Contribute to the fast development of warehouse (move from 3,000 m2 warehouse to a 7,000 m2 warehouse with regional blueprint applied).\n• Establish and monitor 3PL API connection with all logistics companies including state-owned companies like VNPost and Viettel. • Provide Express Delivery for main cities (Ho Chi Minh and Ha Noi) with high customer satisfaction.\nAp", "company": "LAZADA VIETNAM", "end_time": "2015-03-31T00:00:00Z", "industry": "High Technology", "position": "Logistics Development Manager", "conf_score": 0.8878736814268848, "start_time": "2013-03-01T00:00:00Z"}, {"id": 16176, "detail": "ssist DDM on managing sales report of retailers and wholesalers. Create and maintain daily, weekly and monthly KPIs for sales team. Calculate bonus for merchants, conduct market analysis and competitor evaluation. Support DDM on preparing monthly reports for regional director", "company": "MICHELIN VIETNAM", "end_time": "2012-12-31T00:00:00Z", "industry": "Other", "position": "Assistant Distribution Development Manager", "conf_score": 0.8878736814268848, "start_time": "2012-04-01T00:00:00Z"}], "address": null}