{"skills": ["search", "networking", "sourcing applicants", "recruiting", "database", "recruitment", "teamwork", "testing", "analysis", "banking", "marketing", "excel", "finance", "banking sales", "management", "market research", "sales"], "fulltext": "OBJECTIVES \n- To obtain a position in which my knowledge and organization can be utilized \n- To gather experience and knowledge in a new, exciting and professional \nwork environment \n- To develop my skills and be a part of team in a challenging workplace \nand service. \nWORK EXPERIENCES \n1. NFQ Asia/ 8bit Rockstars – Senior Talent Acquisition \nPerior: 05/2018 – current \n- Effectively supporting full cycle recruiting including sourcing, applicant  \ntesting, interviewing, etc. \n- Sourcing, approaching and attracting potential candidates quickly candidates from all \nchannel: Vietnamworks, LinkedIn, Social networks, etc. \n- Screen, interview to shortlist the qualified candidates for the right position and coordinate \nwith project managers to arrange interview and follow up the offer. \nCURRICULUM VITAE \nVO NGOC THANH TRUC \nAddress: Tan Phu District, Ho Chi \nMinh City \n- Update and maintain candidate database, headcount tracking and staff movement records. \n- Keeping the hiring manager up-to-date throughout the process and overtime building a \ncredible and collaborative relationships \n- Provide analysis and other recruitment related topics to HR Manager. \n- Encourage teamwork, build team spirit, in charge of team building, event organization \n- In charge of recruiting campaigns & branding. \n2. NHN Entertainment – Senior Recruiter \nPerior: 06/2016 – 05/2018 \n- Specialize in IT Recruiting, be in charge of all IT and non-IT positions \n- Implement recruiting plan to ensure company’s man power resource \n- Complete detailed job description with the hiring manager to determine position \nspecifications \n- Review, select qualified applicants and organize test, interview \n- Develop and recommend recruiting strategies to ensure successful searches of active and \npassive candidates; Establish and maintain a strong network of contacts helps HR \nDepartment identify and source quality candidates \n3. Glandore Systems – IT Recruitment Researcher Lead \nPerior: 10/2013 – 06/2016 \n- Industry to focus: IT, Marketing, Design, Sales, Banking and Finance… \n- Sourcing, recruiting candidates from Job-boards, social networking sites, networking and \nsome headhunting such as: LinkedIn, Facebook, Monster, Dice,… \n- Screening and short-listing CV’s base on the remit provided \n- Doing some project tasks such as doing career market research, building customer \ndatabase… \nSKILLS \n- Language: English (TOEIC 785) \n- Computer skills: Windows, MS Word, MS Excel, MS Power Point, Google Drive, ect. \n- Management skills \n- Interviewing \n- Negotiation \n- Communication \nSai Gon University, Ho Chi Minh City, Vietnam \nBachelor of Finance and Banking (2010-2013) \nQUALIFICATIONS/EDUCATIONS ", "educations": [{"id": 4864, "gpa": null, "major": "Tài chính – Ngân hàng", "school": "Sai Gon University", "diploma": "Bachelors", "end_time": "2013-01-01T00:00:00Z", "conf_score": 0.8958972760036915, "start_time": "2010-01-01T00:00:00Z", "picklist_major": "Finance/Investment", "major_categories": "Kinh doanh và quản lý", "major_categories_detail": "Tài chính – Ngân hàng – Bảo hiểm"}], "experiences": [{"id": 16300, "detail": "- Effectively supporting full cycle recruiting including sourcing, applicant testing, interviewing, etc.\n- Sourcing, approaching and attracting potential candidates quickly candidates from all channel: Vietnamworks, LinkedIn, Social networks, etc.\n- Screen, interview to shortlist the qualified candidates for the right position and coordinate with project managers to arrange interview and follow up the offer.\n- Update and maintain candidate database, headcount tracking and staff movement records.\n- Keeping the hiring manager up-to-date throughout the process and overtime building a credible and collaborative relationships\n- Provide analysis and other recruitment related topics to HR Manager. - Encourage teamwork, build team spirit, in charge of team building, event organization\n- In charge of recruiting campaigns & branding.", "company": "NFQ Asia/ 8bit Rockstars", "end_time": "2023-04-13T00:00:00Z", "industry": "High Technology", "position": "Senior Talent Acquisition", "conf_score": 0.9542271074073599, "start_time": "2018-05-01T00:00:00Z"}, {"id": 16302, "detail": "- Specialize in IT Recruiting, be in charge of all IT and non-IT positions\n- Implement recruiting plan to ensure company’s man power resource\n- Complete detailed job description with the hiring manager to determine position specifications\n- Review, select qualified applicants and organize test, interview\n- Develop and recommend recruiting strategies to ensure successful searches of active and passive candidates; Establish and maintain a strong network of contacts helps HR Department identify and source quality candidates", "company": "NHN Entertainment", "end_time": "2018-05-31T00:00:00Z", "industry": "Other", "position": "Senior Recruiter", "conf_score": 0.9664944150740037, "start_time": "2016-06-01T00:00:00Z"}, {"id": 16304, "detail": "- Industry to focus: IT, Marketing, Design, Sales, Banking and Finance... - Sourcing, recruiting candidates from Job-boards, social networking sites, networking and some headhunting such as: LinkedIn, Facebook, Monster, Dice,... - Screening and short-listing CV’s base on the remit provided\n- Doing some project tasks such as doing career market research, building customer database...", "company": "Glandore Systems", "end_time": "2016-06-30T00:00:00Z", "industry": "Real Estate", "position": "IT Recruitment Researcher Lead", "conf_score": 0.9542271074073599, "start_time": "2013-10-01T00:00:00Z"}], "address": "Tan Phu District, Ho Chi Minh City"}