{"skills": ["linux", "stack", "unix", "tdd", "c++", "error rate", "cli", "search engine", "studio", "io", "service layer", "file sharing", "equity", "finance", "bdd", "structure", "ruby", "lighting", "medium", "solaris", "swift", "android", "search", "data structure", "algorithm", "testing", "objective c", "ui component", "class", "lead a team", "blackberry", "query processing", "agile"], "fulltext": "NGUYEN HUY CUONG \n35 LANG HA STREET, BA DINH DISTRICT, HA NOI \n(+84) 969032266 \nciminuv@gmail.com \nSummary \n●\nOver 7 years experience in IT industry and working as a Lead Developer (at East Agile) for \nalmost 3 years. \n●\nAbility to lead a team and/or work independently and manage multiple tasks concurrently. \n●\nAbility to learn and work on new technologies quickly. \n●\nGreat attention to detail. \nSkills \n●\nStrong OO design, project architecture design,  and programming skills.  \n●\nAgile methodology skills: process, testing (TDD, BDD), tools, etc. \n●\nFluent programming languages: Objective-C, Swift. \n●\nFamiliar with programming languages: Ruby, C/C++, Bash shell script. \n●\nFamiliar with Unix (Mac OS, Solaris, or Linux command line). \n●\nData structures & algorithms. \nExperience \n2017 - PRESENT \nEast Agile - BBM Messenger \nBBM is one of the largest mobile messaging applications. Moving beyond BlackBerry devices, the \napp now has over 100 million installs on Android, iOS, and Windows. \nEastAgile with a team of 40 engineers managed many teams focusing on each part of the application \n(there are more than 200 members in the development team) and I was the tech lead of Asset \nSharing team focusing on reducing the error rate on file sharing, migrate file sharing infrastructure \ninto the new one. I have worked closely with the teams distributed in Canada, Singapore and \nIndonesia to develop new features, improve performance and deal (refactor) with the legacy code \nbase. \n2016 - 2017 \nEast Agile - CLI Studios \n2 \nCLI Studios is an online dance program that provides online dance classes from top choreographers \nto dancers around the world. They also helps connect dancers and dance studios in USA. \nI worked directly with the Product Owner, in charge of developing new features for web application \nand maintaining legacy code base, then developing iOS version from scratch. \n2016 \nEast Agile - MealPass \nThe application allows users to order and get lunch every weekday from a participating restaurant \nvia smartphone. \nI worked closely with the Product Owner, built the whole app from back-end (API) to front-end (iOS) \nfrom scratch. \n2015 \nEast Agile - Philadelphia Media Network \nThe website allows users to invest in athletes, help finance athletes’ expenses in exchange for equity \nin their season earnings. \nI started the web app from scratch, building pages to view athletes information and calculate equity \nwith chart illustration. \n2014 \nEast Agile - Stack Lighting \nStack Lighting is a smart bulb application, the company is building a truly smart light bulb - the Alba - \nin addition to being controllable via mobile apps, the bulb uses environmental factors and proximity \ndetection to customize interior lighting automatically. \nEastAgile with a team of 10 engineers developed a hub controller and iOS & Android apps to control \nthe Alba smart bulbs. I was in charge of developing an iOS client to communicate with the hub as \nwell as focusing on bulb’s UI components controller. \n2014 \nEast Agile - Mingle \nMingle is a dating site for singles and people who are interested in meeting singles.  \nEastAgile with a team of 8 engineers built the whole app from back-end (API) to front-end (both \nAndroid and iOS) from scratch. I was in charge of developing new features as well as maintaining the \niOS application. \n2012 - 2014 \nNHN Viet Nam - Naver \nNaver is Korea base search engine company  wanted to create a search engine that understands \nVietnamese language better than any other. \n3 \nI implemented search application service layer which integrates with core search layer, caching \nlayer, etc. Depending on each type of search service (news, content, dictionary, etc) we decided \nwhich algorithms to use for query processing, ranking to return the most relevant search results. \nEducation \nMay  2013 - August 2013 \nNHN Korea - Search Engine Technology. \nMarch  2010 - April  2013 \nFPT-APTECH - Information Technology. ", "educations": [{"id": 4873, "gpa": null, "major": "Công nghệ thông tin", "school": "FPT - APTECH", "diploma": "Other", "end_time": "2013-04-01T00:00:00Z", "conf_score": 0.8878736814268848, "start_time": "2010-03-01T00:00:00Z", "picklist_major": "IT - Hardware/Networking", "major_categories": "Máy tính và công nghệ thông tin", "major_categories_detail": "Công nghệ thông tin"}, {"id": 4872, "gpa": null, "major": "Công nghệ kỹ thuật giao thông", "school": "NHN Korea", "diploma": "Other", "end_time": "2013-08-01T00:00:00Z", "conf_score": 0.8878736814268848, "start_time": "2013-05-01T00:00:00Z", "picklist_major": "Technical", "major_categories": "Công nghệ kỹ thuật", "major_categories_detail": "Công nghệ kỹ thuật kiến trúc và công trình xây dựng"}], "experiences": [{"id": 16325, "detail": "BBM is one of the largest mobile messaging applications. Moving beyond BlackBerry devices, the app now has over 100 million installs on Android, iOS, and Windows. EastAgile with a team of 40 engineers managed many teams focusing on each part of the application (there are more than 200 members in the development team) and I was the tech lead of Asset Sharing team focusing on reducing the error rate on file sharing, migrate file sharing infrastructure into the new one. I have worked closely with the teams distributed in Canada, Singapore and\nIndonesia to develop new features, improve performance and deal (refactor) with the legacy code base.", "company": "BBM Messenger", "end_time": "2023-04-13T00:00:00Z", "industry": "Other", "position": "East Agile", "conf_score": 0.8531877442427502, "start_time": "2017-01-01T00:00:00Z"}, {"id": 16326, "detail": "CLI Studios is an online dance program that provides online dance classes from top choreographers to dancers around the world. They also helps connect dancers and dance studios in USA. I worked directly with the Product Owner, in charge of developing new features for web application and maintaining legacy code base, then developing iOS version from scratch.", "company": "East Agile - CLI Studios", "end_time": "2017-01-31T00:00:00Z", "industry": "Other", "position": null, "conf_score": 0.6905021871308187, "start_time": "2016-01-01T00:00:00Z"}, {"id": 16327, "detail": "is a dating site for singles and people who are interested in meeting singles.\nEastAgile with a team of 8 engineers built the whole app from back-end (API) to front-end (both\nAndroid and iOS) from scratch. I was in charge of developing new features as well as maintaining the\niOS application.", "company": "East Agile - Stack Lighting", "end_time": "2014-12-31T00:00:00Z", "industry": "Other", "position": null, "conf_score": 0.6905021871308187, "start_time": "2014-01-01T00:00:00Z"}, {"id": 16328, "detail": "Naver is Korea base search engine company wanted to create a search engine that understands\nVietnamese language better than any other.\nI implemented search application service layer which integrates with core search layer, caching layer, etc. Depending on each type of search service (news, content, dictionary, etc) we decided which algorithms to use for query processing, ranking to return the most relevant search results.", "company": "NHN Viet Nam - Naver", "end_time": "2014-01-31T00:00:00Z", "industry": "Other", "position": null, "conf_score": 0.7279805419571904, "start_time": "2012-01-01T00:00:00Z"}, {"id": 16329, "detail": "", "company": "NHN Korea", "end_time": "2013-08-31T00:00:00Z", "industry": "Other", "position": null, "conf_score": 0.7425130679890735, "start_time": "2013-05-01T00:00:00Z"}, {"id": 16330, "detail": "", "company": "FPT - APTECH", "end_time": "2013-04-30T00:00:00Z", "industry": "High Technology", "position": null, "conf_score": 0.7635053372851461, "start_time": "2010-03-01T00:00:00Z"}], "address": "35 Lang Ha Street, Ba Dinh District, Ha Noi"}