{"skills": ["css", "testing", "analysis", "customer relationship management", "strategic sourcing", "process development", "integrated data", "mai", "marketing", "sales", "le", "bug fixing", "crm system", "smoke test", "crm", "ams", "enterprise", "teamwork", "business analyst", "relationship management", "analyst", "management", "dtl", "communication skill"], "fulltext": "PHUONG, LE THI MAI\nBUSINESS ANALYST (BA)\nI have three years of experience: 2 years as a Business Analyst and 1 year as a Customer \nSpecialist Advocate. I am known as an enthusiastic individual in my work. I am customer-oriented \nand goal-oriented in my daily job. Additionally, I am a team-player and I know the how to \nharmonize my opinions with others' and I am willing to listen to colleagues' ideas. \nMy favorite quote is \"Get busy living or get busy dying\".\nEDUCATION\nHanoi University \nOctober 2012 - June 2016\nFaculty of Information and Technology \n( English base ) \nKm9 Nguyen Trai Street, Thanh Xuan, Hanoi\nWORKING EXPERIENCE\nFPT SOFTWARE\nJUNE 2016 - JUNE 2017\n17 Duy Tan, Cau Giay, Ha Noi\nProject : \nDescription : \nCustomer: \nTeam size:\nCommunication: \nPosition:\nDTL-TEMANDO \nResponsibility: \nAn integration shipping platform for commerce Connecting carriers with \nretailers and retailers to people \nTEMANDO \n15 members ( 1 PM, 3 BA, 1 TL, 11 DEVs)\nVietnamese and English\nBusiness Analyst\nRequirements management and communication between Vietnam team \nand Temando team in Australia. \nRequirements analysis and organization  \nRequirements translation and simplification. \nPlanning and monitoring project's progress  \nCarry out testing after developers have deployed; verify bugs (if any) and \nreport to team and customers. \nWORKING EXPERIENCE\nTEK EXPERTS\nSEP 2017 - MAY 2018\n54 Lieu Giai, Cong Vi, Ba Dinh, Ha Noi\nProject : \nDescription : \nCustomer: \nTeam size:\nCommunication: \nPosition:\nDynamics 365 - CRM\nResponsibility: \nCRM stands for customer relationship management. It's a category of \nintegrated, data-driven software solutions that improve how you interact \nand do business with your customers. CRM systems help you manage and \nmaintain customer relationships, track sales leads, marketing, and pipeline, \nand deliver actionable data. \nAPAC ( users and enterprise) \n9 members ( 1 SME, 8 CSS)\nEnglish\nTechnical Support Engineer\nContact customers as the primary contact of the issues. \nDeliver advanced technical troubleshooting and solutions. \nEscalated to higher level of management if requested. \nCollaborate on cross-team technical issues. \nManage critical issues by setting customer expectations, devise and \nimplement action plans and professionally communicate to all parties \ninvolved. \nWORKING EXPERIENCE\nLARION COMPUTING \nJUL 2018 - APR 2019\nQTSC Bulidng 1, Quang Trung Software City, Ho Chi Minh\nProject : \nDescription : \nCustomer: \nTeam size:\nCommunication: \nPosition:\nMSS (Meperia Strategic Sourcing)\nResponsibility: \nAn integration healthcare system which provides control to the med-surg \nspend, this is also considered as the warehouse for hospitals.\nMeperia\n9 members ( 1SM, 1 BA, 2 QC, 5 DEV)\nVietnamese and English\nBusiness Analyst\nReceive tasks as Work Items ( Enhancement or Bugs fixing) from PO, then \ncarry out initial Investigation and Analyst. \nConfirm requirements from Customer via meetings, then create \nrequirement documents ( UI Prototype, BR, ML..). \nHold meeting with team to distribute logic and requirements, also break \ndown features of task so that Dev and QC can base on that to create detailed \nestimation. During development process, support team in clarifying \nrequirement and investigating bugs. \nReview Test case for QC based on BA's view (logic only) \nVerify requirement of released WI. Sometimes, support QC in doing smoke \ntest. \nDemonstrate of released WI for customers \nADDITIONAL INFORMATION\nWrite and speak in quite fluent English. \nAble to translate complex text into easily \nreadable material. \nAble to read and understand documents \nquickly with skimming and scanning skills. \nBeginner level with basic words, grammar \nand usage of the Spanish. \nAble to read and understand simple \ncontext and documents. \nOCCUPATION OBJECTIVES\nTo work in a modern, active, youthful and competitive environment, which provides \nme opportunities to work and explore the possibilities and potential of myself. English speaking \nenvironment is more preferred.  \nTo accumulate and learn a lot of knowledge, experiences and skills from this job \nTo succeed in a stimulating and challenging environment; building the success of the company \nwhile I experience advancement opportunities. \nTo have a suitable rewarding career where I can use my skills and knowledge to help the company \nand my co-worker be successful. \nKEY SKILLS\nCOMMUNICATION\nCREATIVITY  \nTEAMWORK\nLANGUAGE\nSELF-MOTIVATION\nPRESSURE-HANDLING", "educations": [{"id": 4907, "gpa": null, "major": "Công nghệ thông tin", "school": "Hanoi University", "diploma": "Bachelors", "end_time": "2016-06-01T00:00:00Z", "conf_score": 0.9125410427045302, "start_time": "2012-10-01T00:00:00Z", "picklist_major": "IT - Hardware/Networking", "major_categories": "Máy tính và công nghệ thông tin", "major_categories_detail": "Công nghệ thông tin"}], "experiences": [{"id": 16463, "detail": "eceive tasks as Work Items ( Enhancement or Bugs fixing) from PO, then carry out initial Investigation and Analyst. Confirm requirements from Customer via meetings, then create requirement documents ( UI Prototype, BR, ML..). Hold meeting with team to distribute logic and requirements, also break down features of task so that Dev and QC can base on that to create detailed estimation. During development process, support team in clarifying requirement and investigating bugs.\nReview Test case for QC based on BA's view (logic only)\nVerify requirement of released WI. Sometimes, support QC in doing smoke test.\nDemonstrate of released WI for customers\nWrite and speak in quite fluent English. Able to translate complex text into easily readable material.\nAble to read and understand documents quickly with skimming and scanning skills.\nBeginner level with basic words, grammar and usage of the Spanish. Able to read and understand simple context and documents.", "company": "LARION COMPUTING", "end_time": "2019-04-30T00:00:00Z", "industry": "Other", "position": "MSS (Meperia Strategic Sourcing)", "conf_score": 0.8245935395270719, "start_time": "2018-07-01T00:00:00Z"}, {"id": 16464, "detail": "54 Lieu Giai, Cong Vi, Ba Dinh, Ha Noi Project : Description : Customer: Team size:\nCommunication: Position: Dynamics 365 - CRM Responsibility: CRM stands for customer relationship management. It's a category of integrated, data-driven software solutions that improve how you interact and do business with your customers. CRM systems help you manage and maintain customer relationships, track sales leads, marketing, and pipeline, and deliver actionable data.\nAPAC ( users and enterprise)\n9 members ( 1 SME, 8 CSS) English Technical Support Engineer Contact customers as the primary contact of the issues.\nDeliver advanced technical troubleshooting and solutions.\nEscalated to higher level of management if requested.\nCollaborate on cross-team technical issues.\nManage critical issues by setting customer expectations, devise and implement action plans and professionally communicate to all parties involved.", "company": "TEK EXPERTS", "end_time": "2018-05-31T00:00:00Z", "industry": "Other", "position": null, "conf_score": 0.7072786810336025, "start_time": "2017-09-01T00:00:00Z"}, {"id": 16465, "detail": "-TEMANDO Responsibility: An integration shipping platform for commerce Connecting carriers with retailers and retailers to people\nTEMANDO 15 members ( 1 PM, 3 BA, 1 TL, 11 DEVs) Vietnamese and English Business Analyst Requirements management and communication between Vietnam team and Temando team in Australia. Requirements analysis and organization\nRequirements translation and simplification.\nPlanning and monitoring project's progress\nCarry out testing after developers have deployed; verify bugs (if any) and report to team and customers.", "company": "FPT SOFTWARE", "end_time": "2017-06-30T00:00:00Z", "industry": "High Technology", "position": "DTL", "conf_score": 0.8741580372175363, "start_time": "2016-06-01T00:00:00Z"}], "address": null}