{"skills": ["core data", "aws", "workflow", "payment", "java", "mobile client", "implementation", "rest", "management", "unit test", "io", "market research", "material design", "analysis", "swift", "elearning", "android", "le", "github", "making decision", "objective c", "socket io", "cocoa", "teamwork", "problem solving"], "fulltext": "lebuiduc@gmail.com\n0938.564.645\nLe Bui Duc\nProject Lead\nE34 Hoang Quoc Viet, Ho Chi Minh, Viet Nam\nIt's better to make half a product than a half-assed\nproduct!\nWORK EXPERIENCE\nProject/Product Manager/Senior Mobile Development\nLudiino Ltd\n12/2015 – Present\nHo Chi Minh City, Vietnam\nSMS Integrity Project at ECOM means focusing on improving farm productivity and product qual-\nity, leading in turn to lower costs and higher incomes. ECOMs goal is for farmers to better coffee,\ncocoa, and cotton farming and to provide opportunities for dignified and profitable livelihoods for\ngenerations to come. GolfConnect24 is a cool app that makes everything simple & convenient for\ngolfers to better enjoy the game. Vidoori is a outsourcing customer that focused on providing\nProgram Management, IT and Engineering support for Government and commercial clients.\nAchievements/Tasks\nLead team Product which in more than 10 developers, designers, BAs and\ntechnicians included local team, distributed team and outsourcing team.\nCreate Product Road-map and improve user experience in app and website as\nwell. Work out a detailed planning monitoring implementation with the Global\nMIS office to deploy a new application to the Profit Centers in Asia.\nWork with existing clients and other members of the team to uncover business\nneeds and objectives, craft appropriate overall strategies and plans to achieve\nclients’ business objectives. Reporting to regional manager\nBuilding, planning and leading teams for applications, mentoring other\nprogrammers and contributing to improved processes and workflow.\nAttend application training sessions and start-up events at Costa Rica, US,\nVietnam, Indonesia, China, India, PNG. (Hatch-FAIR, TechInAsia, Web-Submit...)\nContact:Dean Luong - Business Intelligent - thien.luong@ecomtrading.com–\nPhuong Nguyen - Product Lead - https://www.behance.net/baobao36\nSenior Mobile Development (iOS and Android)\nSoftfoundry Ltd\n06/2013 – 11/2015\nHo Chi Minh City, Vietnam\nSoft-foundry proudly presents Momeet, your mobile video conference and collaboration solution.\nTaking your productivity to the next level and revolutionize the vision of business operations,\nmarket development and maintaining customer relationships. Combining with VMEET ®\nTelepresence to delivers face-to-face conference experience with perfect HD quality and\ninteractions, improving productivity by accelerating decision making.\nAchievements/Tasks\nBring out this application to App Store & Google Play, can work independent to\ncreate a mobile application. Keep on research and good ability of self-study\nDesign and develop XMPP, WebSocket, REST APIs... to support mobile client both\nAndroid and iOS.\nUsing framework such as XCode SDK, Anddroid SDK, Cocoa Pod, Social SDK, Com-\nmand Line, Material Design, AWS, Parse, SNS, Core Data, AddessBook, XMPP,\nSocket IO, Fire-base, Google SDK, Facebook SDK...\nContact:Nhat Nguyen * Team Leader - nhat.nguyen@sf.com\niOS Developer\nSynova Ltd\n07/2012 – 05/2013\nHo Chi Minh City, Vietnam\nMobexo Project as a new payment method, Mobexo is a smartphone’s application that is currently\navailable on iPhone and android. With Mobexo, you can use your smartphone to do transactions in\nseconds without additional reader or terminal required. Mobexo provides money transfer services\nfor individuals, merchants and corporates.\nAchievements/Tasks\nBring out this application to App Store\nDevelop source code based on design specification document, Do Unit Test, fix\nbugs, Research technology, Report directly to PM about new issues.\nContact:Phuc Tran * Team Leader–https://github.com/phuc0302\nSKILLS\nLeadership TeamWork Analysis\nNegotiation Communication\nProblem Solving\nTime Management\nMarket Research\nCustomer Service\nJava Objective-C Swift\nOTHER PROJECTS\nQC VietNam (08/2015 – 12/2017)\nManage outsourcing team, manage and release new\nversion for Apple Store and Google Play\nContact: Son Le * Director of Lazada VN -\nlevinhson@gmail.com\nInventory QRcode Tracking\n(10/2017 – 01/2018)\nThe solution should help to record detail info of a unit\nsuch as: source, inbound time, quality, weight, ... and\nlocation. This will help ECOM to manage inventory\nbetter, reduce human error, and increase productivity.\nThe solution will implement scan stations for all\nactivities that may change unit location/status/info\nContact: Son Le * Director of Lazada VN -\nlevinhson@gmail.com\nACHIEVEMENTS\nScholarship\nAchieve Scholarship for good students of Van Lang University\nin 2009, 2010, 2011, 2012.\nBoeing Scholarship\nBoeing awarded 10 scholarships in HCM, Vietnam, on (2009,\n2010, 2011) to students enrolled in the Software\nEngineering and Information Systems programs of the\nSoftware Engineering Group of Vietnam (SEGVietnam).\nCarnegie Mellon University Certificate\n(09/2008 – 07/2012)\nhttp://strategic.isri.cmu.edu/elearning/val/home (My Student\nID: T088145)\nLANGUAGES\nEnglish\nVietnamese\nINTERESTS\nSustainability\nPhysics\nVideo Games\nBooks Sports Travelling\nEDUCATION\nBachelor of Software Engineering\nVan Lang University\n09/2008 – 07/2012\nHo Chi Minh City", "educations": [{"id": 4921, "gpa": null, "major": "Kỹ thuật phần mềm", "school": "Van Lang University", "diploma": "Bachelors", "end_time": "2012-07-01T00:00:00Z", "conf_score": 0.8331203744046224, "start_time": "2008-09-01T00:00:00Z", "picklist_major": "IT - Hardware/Networking", "major_categories": "Máy tính và công nghệ thông tin", "major_categories_detail": "Máy tính"}], "experiences": [{"id": 16492, "detail": "Ho Chi Minh City, Vietnam SMS Integrity Project at ECOM means focusing on improving farm productivity and product qual- ity, leading in turn to lower costs and higher incomes. ECOMs goal is for farmers to better coffee, cocoa, and cotton farming and to provide opportunities for dignified and profitable livelihoods for generations to come. GolfConnect24 is a cool app that makes everything simple & convenient for golfers to better enjoy the game. Vidoori is a outsourcing customer that focused on providing\nProgram Management, IT and Engineering support for Government and commercial clients.\nAchievements/Tasks Lead team Product which in more than 10 developers, designers, BAs and technicians included local team, distributed team and outsourcing team.\nCreate Product Road-map and improve user experience in app and website as well. Work out a detailed planning monitoring implementation with the Global MIS office to deploy a new application to the Profit Centers in Asia. Work with existing clients and other members of the team to uncover business needs and objectives, craft appropriate overall strategies and plans to achieve clients’ business objectives. Reporting to regional manager\nBuilding, planning and leading teams for applications, mentoring other programmers and contributing to improved processes and workflow.\nAttend application training sessions and start-up events at Costa Rica, US, Vietnam, Indonesia, China, India, PNG. (Hatch-FAIR, TechInAsia, Web-Submit...) Contact:Dean Luong - Business Intelligent - thien.luong@ecomtrading.com-\nPhuong Nguyen - Product Lead - https://www.behance.net/baobao36", "company": "Ludiino Ltd", "end_time": "2023-04-13T00:00:00Z", "industry": "Other", "position": "Project/Product Manager/Senior Mobile Development", "conf_score": 0.9664944150740037, "start_time": "2015-12-01T00:00:00Z"}, {"id": 16493, "detail": "Ho Chi Minh City, Vietnam Soft-foundry proudly presents Momeet, your mobile video conference and collaboration solution.\nTaking your productivity to the next level and revolutionize the vision of business operations, market development and maintaining customer relationships. Combining with VMEET ® Telepresence to delivers face-to-face conference experience with perfect HD quality and interactions, improving productivity by accelerating decision making.\nAchievements/Tasks Bring out this application to App Store & Google Play, can work independent to create a mobile application. Keep on research and good ability of self-study\nDesign and develop XMPP, WebSocket, REST APIs... to support mobile client both\nAndroid and iOS. Using framework such as XCode SDK, Anddroid SDK, Cocoa Pod, Social SDK, Com- mand Line, Material Design, AWS, Parse, SNS, Core Data, AddessBook, XMPP, Socket IO, Fire-base, Google SDK, Facebook SDK... Contact:Nhat Nguyen * Team Leader - nhat.nguyen", "company": "Softfoundry Ltd", "end_time": "2015-11-30T00:00:00Z", "industry": "Other", "position": "Senior Mobile Development (", "conf_score": 0.8741430586257647, "start_time": "2013-06-01T00:00:00Z"}, {"id": 16494, "detail": "Ho Chi Minh City, Vietnam Mobexo Project as a new payment method, Mobexo is a smartphone’s application that is currently available on iPhone and android. With Mobexo, you can use your smartphone to do transactions in seconds without additional reader or terminal required. Mobexo provides money transfer services for individuals, merchants and corporates.\nAchievements/Tasks Bring out this application to App Store Develop source code based on design specification document, Do Unit Test, fix bugs, Research technology, Report directly to PM about new issues.\nContact:Phuc Tran * Team Leader-https://github.com/phuc0302", "company": "Synova Ltd", "end_time": "2013-05-31T00:00:00Z", "industry": "Other", "position": "iOS Developer", "conf_score": 0.9512303155325736, "start_time": "2012-07-01T00:00:00Z"}], "address": "E34 Hoang Quoc Viet, Ho Chi Minh, Viet Nam"}