{"skills": ["supply chain", "user interface", "css", "analysis", "project management software", "ea", "html", "problem solving", "project management", "microsoft", "navigation", "marketing", "sales", "html5", "pop", "make decision", "risk analysis", "data collection", "ecs", "ams", "workflow", "teamwork", "management", "medium", "risks"], "fulltext": "TRAN KIM THOA\nUI/UX PRODUCT DESIGNER\nl am the Ux/UI product designer.\n| was born on March 14th, 1984 in Ho Chi Minh City, Viet Nam.\nStarting working with multigraphic designs serve for Marketing\nDept. and Branding ldentify .\nI found myself by each project with love, passionate, competitive,\nconstancy and explore creative way, especially through several long\nterm UX design projects of website and applications in few months.\n5 years experience at designer position and over 2 years at UI/UX\nproduct designing position in Software Dept, its not very strong\nbackground but I had been trained very good many skills in my\nmajor, solving problem or manage teamwork. I learnt them in field\nsources as university, companies-courses, the upper managers and\nfrom my failures, too.\nPROFILE\nI have studied in Arena Multimedia University,\nEDUCATION\nFPT on 2012\nMy major is Graphic design suite for website, applications on mobile, anima-\ntion, video & design products related with printing industry.\nIllustrator in graphic / Multimedia & Advertising Field\nSKILLS\nPhotoshop\nIllustrator\nDreamweaver\nSketch storyboarb\nIllustrator in UI/ux website / Application & Software Field\nDreamweaver/NotepadPlus\nHTML5\nCSS\nIllustrator in management / Management Field\nTiming\nDealine Task/Project\nPeople\nSolving problem\nAnalysis\nPredict Risk\nQuality\nSoftware project management\nUI/UX PRODUCT DESIGNER\nDicentral\nPresent - From Sep 2017\nDiCentral is a leading global provider of EDI and supply chain solutions\nheadquartered in Houston, Texas, with 10 offices worldwide supporting\ncustomers across multiple sectors in over 35 countries.\nIhave responsible:\nLayout website and application on website & mobile.\nCustomize user experience lets more easier to interactively using by\nuser's habits, new trend colour, buttons, navigation menu, display\ncontent, tables, pop up ...\nSupproting front end team, BA, developer programmer even PO.\nWork with marketing team to develop products with Microsoft partner or\nsomeone else by video, clips and event designing relevant.\nBrainstorm with team to improve products' brand and tailored them\nmore effective by stronger tools\nDevelop idea or document request from BA/PO into graphic simple\ninteractive and respond them my opinion in need.\nAchievements:\nBuild DiMed interface, application website of Steward Hospital group in\nUS.\nModify user interface DiAutomotive, the application of serving logistics\nSupporting to improve new interface for SmartTurn, DiwMS applications,\nthe app provide to manage warehouse for wholesale, logistic, warehouse.\n3PL and some other industries..\nBesides that i have tailored new user interface for DiMetric as well, the\napplication web for creating roles, people, contact list to link between\nother applications on DiCentral-EDI system.\nVu Thao Computer\nPresent - From Oct 2016\nVu Thao Computer is the one of first company design Project Manage-\nment applications, develop from Sitepoint, a software of Microsoft.\nLhave responsible:\nLayout website and application on website & mobile.\neC\nCommunication with clients to deal best product solution.\neS\nSupport CSS team in HTML and CSS on front end.\nDesign products insight to develop Vu Thao brand.\nManage my project by management software which product Vu thao\ndeveloping.\nAchievements:\neA\nAchieve the goal of making the web better, lasted technology and intuition\neN\nManage risks, issue or analysis Ux when client run our applications.\nPROFESIONAL\nEXPERIENCE\nCustomize user expe-\nrience lets more\neasier to interactively\nusing by user' shabits,\nnew trend colour,\nbuttons, navigation\nmenusislayconten\ntables, pop up ...\nUI/UX MAPSTYLE & BRAND - DESIGN LEADER\nWonav Corp\nFrom Dec 2015 - Sep 2016\nThey designed and developed the mapstyle to commercial B2C by GIS\nplatform.\nIhave responsible:\n* Work with developers to build the style of map in HTML.\nDesign sale kits to advertise insight the Wonav brand on social medias\nthrough posts , mini game or small campaigns.\nAchievements:\nLearn skill on collection data from GIs flatform and how to build mapstyle.\nBuilt a part of website.\nManage team work out smoothly and effective when campaign is lauch-\ning, get more potential clients to contact us.\nUI/UXWEBSITE & APPLICATION - LEADER DESIGNER\nMivisions International\nFrom Aug 2015 - Nov 2015\nThe company is focus on the client's critical needs including targets and\ndesired growth rate in their market of choice as consulting of education\nand staff, IT support ..B2C and B2B as well.\nIhave responsible:\nDesign commercial website is market place site.\nManage design stuff for brand identify.\nManage team to prepare materials to support Marketing Dept for educa-\ntion campaign, workshop,..\nAchievements:\nKnowledge what workflow in education field.\nKnowledge what trend and sense of European and their habit also.\nPROFESIONAL\nEXPERIENCE\nSENIOR GRAPHIC DESIGN\nThe Al Frescos Group, Viet Nam Branch\nFrom Jan 2012 to Aug 2015\nTheir business in F & Bindustry, very popular and famous with pizza and\nBBQ rib. There have over 10 restaurants in HCMC and over 20 in Ha Noi\nCity, some in Da Nang, also arround 800 staff during Viet Nam.\nhave responsible:\nDesigning stuff\nDesign almost kinds of menu, new layout event.\nDesign a master page through South, Middle and North then designers\nper each area will apply multimedia (menu, poster, flier, standee, mock\nup, cap, polos, vouchers...\nResponsible maintain, develop identify brands through all designs: colour,\nimage, uniform, font style and culture company\nTake photos of food for special menu, main menu, website, event, party\nManagement campaign, partner support and dealine stuf as supervisor\nPlanning and organize design stuff when have new promotion / deal / flier\n/ campaign.\nWork out and follow up costing, process with supplier\nLiaise with marketing team, social media team, data system team, web\nserver, outlets to update, pop up all new in same time\nAchievements:\nEffectively manage the workflow and dealine in short time even other\nproject/task/people cross.\nFexible make decision when trouble happen suddenly.\nAnalysis risk appear at the beginning start project/campaign...\nThank you for reading!\nIf you want to collaborate on crafting amazing experience\nfor people - you are very welcome to contact me.\nTran Kim Thoa\n0902.472.199 - hcm.kimthoa@gmail.com\nPROFESIONAL\nEXPERIENCE", "educations": [{"id": 4926, "gpa": null, "major": "Thiết kế đồ họa", "school": "Arena Multimedia University,\nFPT", "diploma": "Bachelors", "end_time": "2012-01-01T00:00:00Z", "conf_score": 0.7764426007516669, "start_time": null, "picklist_major": "Art/Design", "major_categories": "Nghệ thuật", "major_categories_detail": "Mỹ thuật ứng dụng"}], "experiences": [{"id": 16519, "detail": "DiCentral is a leading global provider of EDI and supply chain solutions headquartered in Houston, Texas, with 10 offices worldwide supporting customers across multiple sectors in over 35 countries.\nIhave responsible:\nLayout website and application on website & mobile.\nCustomize user experience lets more easier to interactively using by user's habits, new trend colour, buttons, navigation menu, display content, tables, pop up ... Supproting front end team, BA, developer programmer even PO. Work with marketing team to develop products with Microsoft partner or someone else by video, clips and event designing relevant.\nBrainstorm with team to improve products' brand and tailored them more effective by stronger tools\nDevelop idea or document request from BA/PO into graphic simple interactive and respond them my opinion in need.\nAchievements: Build DiMed interface, application website of Steward Hospital group in\nUS. Modify user interface DiAutomotive, the application of serving logistics\nSupporting to improve new interface for SmartTurn, DiwMS applications, the app provide to manage warehouse for wholesale, logistic, warehouse.\n3PL and some other industries..\nBesides that i have tailored new user interface for DiMetric as well, the application web for creating roles, people, contact list to link between other applications on DiCentral-EDI system.", "company": "Dicentral", "end_time": "2023-04-13T00:00:00Z", "industry": "Other", "position": "UI/UX PRODUCT DESIGNER", "conf_score": 0.9166535282364164, "start_time": "2017-09-01T00:00:00Z"}, {"id": 16520, "detail": "Vu Thao Computer is the one of first company design Project Manage- ment applications, develop from Sitepoint, a software of Microsoft. Lhave responsible:\nLayout website and application on website & mobile.\neC Communication with clients to deal best product solution.\neS Support CSS team in HTML and CSS on front end.\nDesign products insight to develop Vu Thao brand.\nManage my project by management software which product Vu thao developing.\nAchievements: eA Achieve the goal of making the web better, lasted technology and intuition\neN Manage risks, issue or analysis Ux when client run our applications.", "company": "Vu Thao Computer", "end_time": "2023-04-13T00:00:00Z", "industry": "Other", "position": null, "conf_score": 0.8086621310791741, "start_time": "2016-10-01T00:00:00Z"}, {"id": 16521, "detail": "They designed and developed the mapstyle to commercial B2C by GIS platform.\nIhave responsible:\n* Work with developers to build the style of map in HTML. Design sale kits to advertise insight the Wonav brand on social medias through posts , mini game or small campaigns.\nAchievements: Learn skill on collection data from GIs flatform and how to build mapstyle.\nBuilt a part of website.\nManage team work out smoothly and effective when campaign is lauch- ing, get more potential clients to contact us.", "company": "Wonav Corp", "end_time": "2016-09-30T00:00:00Z", "industry": "Other", "position": "UI/UX MAPSTYLE & BRAND - DESIGN LEADER", "conf_score": 0.9256580526889115, "start_time": "2015-12-01T00:00:00Z"}, {"id": 16522, "detail": "The company is focus on the client's critical needs including targets and desired growth rate in their market of choice as consulting of education and staff, IT support ..B2C and B2B as well.\nIhave responsible:\nDesign commercial website is market place site.\nManage design stuff for brand identify.\nManage team to prepare materials to support Marketing Dept for educa- tion campaign, workshop,..\nAchievements: Knowledge what workflow in education field.\nKnowledge what trend and sense of European and their habit also.", "company": "Mivisions International", "end_time": "2015-11-30T00:00:00Z", "industry": "Other", "position": "UI/UXWEBSITE & APPLICATION - LEADER DESIGNER", "conf_score": 0.9174648511369632, "start_time": "2015-08-01T00:00:00Z"}, {"id": 16523, "detail": "Their business in F & Bindustry, very popular and famous with pizza and\nBBQ rib. There have over 10 restaurants in HCMC and over 20 in Ha Noi City, some in Da Nang, also arround 800 staff during Viet Nam. have responsible:\nDesigning stuff\nDesign almost kinds of menu, new layout event.\nDesign a master page through South, Middle and North then designers per each area will apply multimedia (menu, poster, flier, standee, mock up, cap, polos, vouchers...\nResponsible maintain, develop identify brands through all designs: colour, image, uniform, font style and culture company\nTake photos of food for special menu, main menu, website, event, party\nManagement campaign, partner support and dealine stuf as supervisor\nPlanning and organize design stuff when have new promotion / deal / flier\n/ campaign.\nWork out and follow up costing, process with supplier\nLiaise with marketing team, social media team, data system team, web server, outlets to update, pop up all new in same time\nAchievements: Effectively manage the workflow and dealine in short time even other project/task/people cross.\nFexible make decision when trouble happen suddenly.\nAnalysis risk appear at the beginning start project/campaign...", "company": "The Al Frescos Group, Viet Nam Branch", "end_time": "2015-08-31T00:00:00Z", "industry": "Other", "position": "SENIOR GRAPHIC DESIGN", "conf_score": 0.9174648511369632, "start_time": "2012-01-01T00:00:00Z"}], "address": "City"}