{"skills": ["brand marketing", "strategic planning", "supply chain", "investments", "marketing communications", "market research", "marketing strategy", "wing", "analysis", "marketing", "finance", "accounting", "management", "medium", "sales", "communication skill", "new product development"], "fulltext": "TRAM TRAN (Ms.) \nEmail: tranbichtram.87@gmail.com    Contact No.: (+84)-902-465-325 \nMARKETING MANAGER \nDynamic, fact-based analytical mind, result-oriented marketing professional with over 9-year \nexperience in strategic planning, developing and rolling out marketing strategy with the ability to read \ninto consumers’ insight and market trends using marketing communication skills. \nProven ability to drive record-high marketing campaign and roll out successful product launch. \nWORKING EXPERIENCE \nQSR VIETNAM – Jan 2015 to present \n(No. 1 F&B Franchise Company in Vietnam) \nMARKETING MANAGER \n• Take care of 5 brands: Dairy Queen, DQ Grill & Chill, Buffalo Wild Wings (aka. B-Dubs), The Pizza \nCompany and Swensen’s brands. In-charged of developing brand strategy, marketing planning and \nimplementing nation-wide campaigns for all brands. \no Internal:  \n§ Conduct market research to identify new trends and opportunities in the market to \ncome up with new product innovations, new campaign ideas to generate sales.  \n§ Lead design team in artwork developments and ensure all are within brand \nguidelines.  \n§ Lead brand marketing team in marketing campaign, from beginning to end, including \ncampaign idea, launch out and post campaign analysis.  \n§ Coordinate with respective departments (Operations, R&D, Supply Chain, \nAccounting, IT, Site Development, etc) to ensure the Excellent in Operation of all the \nbrands.  \n§ Responsible for budget allocation, effective spending and the overall performance of \nbrands to report directly to the Board.  \n§ Coach team members to ensure 100% on-target performance.  \no External: \n§ Work with franchisor in all brand initiatives (yearly marketing campaign, new \nproduct developments and other activities). \n§ Lead and monitor external advertising agencies.  \n§ Identify and explore new business opportunities, such as tie-up with other business \npartners, developing new business platform and exploring new streams of revenue \nfor the business.   \n• Expand QSR’s franchise portfolio by bringing successful international brands into Vietnam. Lead all \nthe dealings with Franchisor, regarding market opportunities, brand strategy when entering \nVietnam, menu development and roll-out plan.  \nSelected Accomplishments:  \n• The Pizza Company: \no Build The Pizza Company as number 1 pizza brand in Vietnam. \no Year-on-year sales double, store network increased by 12 times (from 3 stores to 50 \nstores) in only 3 years.  \n• Buffalo Wild Wings (B-Dubs) \no Transform the business by utilizing 3rd party platform to drive sales. \no Build B-Dubs as one-of-a-kind entertaining experience in Vietnam by cooperating with \nlifestyles brands.  \n• Successfully generate new stream of revenue for the company without any investment. \nWALL STREET ENGLISH CO. LTD. – Jan 2014 to Jan 2015 \n(World-wide Chain of English center) \nBRAND MANAGER \n\u0097 In-charged of leading creative team and creative agencies for content direction and developing \nintegrated communication plan, incorporating PR, Marketing and Social activities.  \nSelected Accomplishments:  \n• Increased lead-to-sales conversion rate by 20% by optimizing channels and fine-tune content \ndirection. \n• Achieved a strong and visible brand presence across various media channels, including traditional \nmedia (press, telemarketing, OOH) and digital channels. \n• Successfully launched the 2nd and 3rd center of Wall Street English, with more than 3000 attendant \nand hit 110% sales target in 3 consecutive months (Sep, Oct, Nov 2014). \nVIET THAI INTERNATIONAL JSC. – Apr 2012 – Jan 2014 \n(Multimillion dollar business of Vietnamese F&B Brand – Highlands Coffee and Pho 24) \nBRAND MANAGER – HIGHLANDS COFFEE \n• Worked closely with General Manager to build short and long term marketing strategy for \nHighlands Coffee.  \n• Directed new product launch. Initiated and executed brand building campaigns and promotional \ncampaigns.  \nSelected Accomplishments:  \n• Strategically re-position Highlands Coffee as a Vietnamese Coffee chain. Initiate 3rd-generation \nHighlands store concept with the pay-and-claim service type, which helped to jump start the brand \nto a whole new level.  \n• Led the development of Highlands’ famous Coffee Freeze. Successfully launch the product to signify \nHighlands as an inspiring Vietnamese Coffee chain.  \n• Led the Festive Campaign, cooperated with Ford, Piaggio and Nokia to the biggest promotional \ncampaign in F&B – allowing customers to have a chance to win a Ford car at Highlands Coffee.  \nEDUCATION \n• Singapore Management University \nBachelor of Business Management – Double Degree in Marketing and Finance \nPowered by TCPDF (www.tcpdf.org)", "educations": [{"id": 4929, "gpa": null, "major": "Tài chính – Ngân hàng", "school": "Singapore Management University", "diploma": "Bachelors", "end_time": null, "conf_score": 0.7598505228161437, "start_time": null, "picklist_major": "Finance/Investment", "major_categories": "Kinh doanh và quản lý", "major_categories_detail": "Tài chính – Ngân hàng – Bảo hiểm"}], "experiences": [{"id": 16536, "detail": "• Take care of 5 brands: Dairy Queen, DQ Grill & Chill, Buffalo Wild Wings (aka. B-Dubs), The Pizza Company and Swensen’s brands. In-charged of developing brand strategy, marketing planning and implementing nation-wide campaigns for all brands. o Internal: § Conduct market research to identify new trends and opportunities in the market to come up with new product innovations, new campaign ideas to generate sales.\n§ Lead design team in artwork developments and ensure all are within brand guidelines.\n§ Lead brand marketing team in marketing campaign, from beginning to end, including campaign idea, launch out and post campaign analysis.\n§ Coordinate with respective departments (Operations, R&D, Supply Chain, Accounting, IT, Site Development, etc) to ensure the Excellent in Operation of all the brands.\n§ Responsible for budget allocation, effective spending and the overall performance of brands to report directly to the Board. § Coach team members to ensure 100% on-target performance. o External: § Work with franchisor in all brand initiatives (yearly marketing campaign, new product developments and other activities).\n§ Lead and monitor external advertising agencies.\n§ Identify and explore new business opportunities, such as tie-up with other business partners, developing new business platform and exploring new streams of revenue for the business.\n• Expand QSR’s franchise portfolio by bringing successful international brands into Vietnam. Lead all the dealings with Franchisor, regarding market opportunities, brand strategy when entering\nVietnam, menu development and roll-out plan.\nSelected Accomplishments: • The Pizza Company: o Build The Pizza Company as number 1 pizza brand in Vietnam. o Year-on-year sales double, store network increased by 12 times (from 3 stores to 50 stores) in only 3 years.\n• Buffalo Wild Wings (B-Dubs) o Transform the business by utilizing 3rd party platform to drive sales. o Build B-Dubs as one-of-a-kind entertaining experience in Vietnam by cooperating with lifestyles brands.\n• Successfully generate new stream of revenue for the company without any investment.", "company": "QSR VIETNAM", "end_time": "2023-04-13T00:00:00Z", "industry": "Other", "position": "MARKETING MANAGER", "conf_score": 0.922486353517566, "start_time": "2015-01-01T00:00:00Z"}, {"id": 16539, "detail": "In-charged of leading creative team and creative agencies for content direction and developing integrated communication plan, incorporating PR, Marketing and Social activities.\nSelected Accomplishments: • Increased lead-to-sales conversion rate by 20% by optimizing channels and fine-tune content direction.\n• Achieved a strong and visible brand presence across various media channels, including traditional media (press, telemarketing, OOH) and digital channels.\n• Successfully launched the 2nd and 3rd center of Wall Street English, with more than 3000 attendant and hit 110% sales target in 3 consecutive months (Sep, Oct, Nov 2014).", "company": "WALL STREET ENGLISH CO. LTD.", "end_time": "2015-01-31T00:00:00Z", "industry": "Education", "position": "BRAND MANAGER", "conf_score": 0.9391390844877173, "start_time": "2014-01-01T00:00:00Z"}], "address": null}