{"skills": ["call center", "marketing", "channel sales", "ams", "customer relationship management", "sales", "management", "self learning", "analysis", "leadership skill", "investments", "data analysis", "business activity", "testing", "global marketing", "managing information", "data management", "management activity", "problem solving", "operations management", "relationship management"], "fulltext": "CURRICULUM VITAE \nBUI THI NGOC TRINH \nYear of birth: 1989 \nGender: \nFemale \nMarital status: Married \nCountry: \nVietnam \nMobile: \nEmail: \nAddress: \nPhu Nhuan District, Ho Chi Minh City \nLife philosophy \n“You must be the change you wish to see in the world” – Mahatma Gandhi \nCareer path highlight \nI have more than 3 year experiences in operation management in retail industry and 2 years \nworking in F&B industry as Marketing and Customer Service Director. \nBesides, I used to establish my own business in fashion retail industry that I am really \npassionate about. Working on clothing is my favorite one. \nEducation \n Master of Business (July 2012 – June 2013)\nCharles Sturt University, Sydney, Australia \nMajor: Marketing management \n Bachelor of Economics (September 2007 – August 2011)\nUniversity of Economics Ho Chi Minh City \nMajor: Planning & Investment \n Planning a business project\n\n Analyzing cost and benefit of project\nScholarship \n Institute of Potential Leaders – IPL (August 2015 – July 2016)\nIPL is the scholarship program founded by a group of dedicated \nentrepreneurs, intellectuals and the PACE Institute of Management with the \npurpose of finding “talent seeds” to cultivate, becoming new leader \ngeneration. \nThree parts: \n Liberal Education\n Leadership Development\n Professional Development\n\n\nExperience \nMay 2017 – Present: OFOOD Trading & Service JSC \nJob Title: Marketing and Customer Service Director \n Taking responsibility for all strategic and operational marketing activities to achieve \nyearly sales target of 2 restaurant store chains which are Ga Nuong O O O (totally 10 \nstores in HCMC & Hanoi) and Bò-Lế-Rồ (totally 9 stores in HCMC & Hanoi).\n\n Working and negotiating with another business partners (Foody, Adayroi, Grab, Go \nViet, Ahamove, Lalamove, Jamja, Cling Me, Super Vip,…) to expand sales channels \nand increase revenue for company\n\n Managing all customer service activities, including call center, delivery service, \ncustomer complain settlement, B2B customer relationship management\n\n Setting up and managing all new business projects of the company\nAchievement: \n Total company revenue in 2018 increased 160% vs 2017\n\n Completed brand strategic guideline for Bò-Lế-Rồ\n\n Successfully operated 2 big marketing campaign with Foody (“Delivery grilled \nchicken only 89k”, increase daily revenue 41%) and Jamja (“Mediterranean grilled \nchicken with hot chilli only 99K”, increase daily revenue 38%)\n\n Rearranged working hour of customer service staffs and saved 25% salary cost of \nCustomer Service Department\n\n Successfully setting up customer relationship management software and saved 30% \ntime of making delivery order\nAugust 2016 – March 2018: Plus N (Clothing Brand) \nTitle: Business Owner & Project Manager \nPlus N was the clothing brand with the simple and elegant style. The mission of Plus N is to \nprovide the most suitable outfit and make women more confidence. Plus N’s target \ncustomers are young and modern women from 22 – 28 year olds living Ho Chi Minh City. \nI was the project manager - managing all the business activities, including purchasing, \nproduction, marketing and customer service. I started this business project from 2016 and be \nsorry of closing it in the early 2018. \nLearning point: \n Know how to manage the business with the limited resources\n\n Know how to recruit the suitable person for the project\n\n Gained much knowledge in clothing manufacturing\n\n Understand customer insight in purchasing clothes\nSep 2014 – May 2017: Nguyen Kim Trading JSC \nJob Title: Executive Assistant to COO \n Following up sales budget monthly, quarterly and yearly of Nguyen Kim store chain\n\n Following up all operation activities in details and updating to COO\n\n Be the point of contact between COO and other directors in the company, managing \ninformation flow\n\n Directly updating and reporting all internal management activities to COO\n\n Organizing materials and activities to accomplish goals efficiently and effectively\n\n Coordinating & managing company’s internal projects\nOct 2013 – Sep 2014: Ecount ERP company \nJob Title: Global Marketing Executive \n Being one of first staffs of Ecount in Vietnam, participating in all works to establish \nthe business in the early days in Vietnam\n\n Building strategy, planning and executing all marketing activities for Ecount \nVietnam  \n Working with agencies to organize company commercial events\n\n Setting up company website in Vietnam, ensuring that all visitors were provided \nenough information about company’s service & product\n\n Testing an effects of website and software interface, suggesting a modification if it is \nnecessary, ensuring the most convenient for users\n\n Managing Google adwords to keep stable traffic for Ecount Vietnam’s website\nSkills \nLanguages: English (Advanced User) \nSoft skills: leadership, problem solving, time management, data analysis, self-learning, \ncommunication, training ", "educations": [{"id": 4959, "gpa": null, "major": "Marketing", "school": "Charles Sturt University, Sydney, Australia", "diploma": "Masters", "end_time": "2013-06-01T00:00:00Z", "conf_score": 0.8122306558073306, "start_time": "2012-07-01T00:00:00Z", "picklist_major": "Marketing", "major_categories": "Kinh doanh và quản lý", "major_categories_detail": "Kinh doanh"}, {"id": 4960, "gpa": null, "major": "Planning & Investment", "school": "University of Economics Ho Chi Minh City", "diploma": "Bachelors", "end_time": "2011-08-01T00:00:00Z", "conf_score": 0.9048312760225512, "start_time": "2007-09-01T00:00:00Z", "picklist_major": "Other", "major_categories": "", "major_categories_detail": ""}], "experiences": [{"id": 16613, "detail": "Taking responsibility for all strategic and operational marketing activities to achieve yearly sales target of 2 restaurant store chains which are Ga Nuong O O O (totally 10 stores in HCMC & Hanoi) and Bò-Lế-Rồ (totally 9 stores in HCMC & Hanoi). Working and negotiating with another business partners (Foody, Adayroi, Grab, Go Viet, Ahamove, Lalamove, Jamja, Cling Me, Super Vip,...) to expand sales channels and increase revenue for company\nManaging all customer service activities, including call center, delivery service, customer complain settlement, B2B customer relationship management\nSetting up and managing all new business projects of the company\nAchievement: Total company revenue in 2018 increased 160% vs 2017 Completed brand strategic guideline for Bò-Lế-Rồ Successfully operated 2 big marketing campaign with Foody (“Delivery grilled chicken only 89k”, increase daily revenue 41%) and Jamja (“Mediterranean grilled chicken with hot chilli only 99K”, increase daily revenue 38%) Rearranged working hour of customer service staffs and saved 25% salary cost of\nCustomer Service Department Successfully setting up customer relationship management software and saved 30% time of making delivery order", "company": "OFOOD Trading & Service JSC", "end_time": "2023-04-13T00:00:00Z", "industry": "Trade", "position": "Marketing and Customer Service Director", "conf_score": 0.9665822115856685, "start_time": "2017-05-01T00:00:00Z"}, {"id": 16614, "detail": "Plus N was the clothing brand with the simple and elegant style. The mission of Plus N is to provide the most suitable outfit and make women more confidence. Plus N’s target customers are young and modern women from 22 - 28 year olds living Ho Chi Minh City.", "company": "Plus N (Clothing Brand)", "end_time": "2018-03-31T00:00:00Z", "industry": "Other", "position": "Business Owner & Project Manager", "conf_score": 0.9542271074073599, "start_time": "2016-08-01T00:00:00Z"}, {"id": 16615, "detail": "en Kim Trading JSC Job Title: Executive Assistant to COO Following up sales budget monthly, quarterly and yearly of Nguyen Kim store chain\nFollowing up all operation activities in details and updating to COO Be the point of contact between COO and other directors in the company, managing information flow\nDirectly updating and reporting all internal management activities to COO Organizing materials and activities to acco", "company": "Nguyen Kim Trading JSC", "end_time": "2017-05-31T00:00:00Z", "industry": "Trade", "position": "Executive Assistant to COO", "conf_score": 0.9371357429935756, "start_time": "2014-09-01T00:00:00Z"}, {"id": 16616, "detail": "Being one of first staffs of Ecount in Vietnam, participating in all works to establish the business in the early days in Vietnam Building strategy, planning and executing all marketing activities for Ecount Vietnam Working with agencies to organize company commercial events\nSetting up company website in Vietnam, ensuring that all visitors were provided enough information about company’s service & product\nTesting an effects of website and software interface, suggesting a modification if it is necessary, ensuring the most convenient for users\nManaging Google adwords to keep stable traffic for Ecount Vietnam’s website", "company": "Ecount ERP company", "end_time": "2014-09-30T00:00:00Z", "industry": "Other", "position": "Global Marketing Executive", "conf_score": 0.9665822115856685, "start_time": "2013-10-01T00:00:00Z"}], "address": "Phu Nhuan District, Ho Chi Minh City"}