{"skills": ["search", "enterprise", "business skill", "relationship management", "problem solving", "customer relationship management", "business environment", "freight forwarding", "excel", "internet", "microsoft", "management", "cost estimation", "corporate culture", "sales", "risks"], "fulltext": "HA DINH THANG (Mr. Tony) \nPERSONAL INFORMATION \nDOB \n: \nGender \n: \nMarital \nStatus  \nNationality \n: \n09 May 1989 \nMale \nSingle \nVietnamese \nCareer \nObjective \nShort-term goal: I want to work in a dynamic, highly specialized \nenvironment to enhance the professionalism and promote co-operation, \nsupport, and help of colleagues to achieve well-defined work goals. I \nhave the spirit of positive work, happy, learning, responsibility in work. \nLong-term goals: My goals in company rise up a challenging leadership \nposition that applies creative management skills and make the most of \nthe resources and get maximum profits. Use my skills and experience \nwhile enhancing the company's productivity and reputation. I can move \nand drive a car on business when requested by the superiors \n. \nINTERVIEWER’S COMMENTS \nProfessional Summary: \n- \n2 years 2 months as Sale Manager Logistics, Import And Export for VOSA HANOI \n- \n4 years 4 months as Sale Manager Logistics, Import And Export for Bach Viet Group \nCompany \n- \n5 months as Sales Staff for Vinatraco Trading And Import Export Joint Stock Company \n- \n1 year as Sales Staff for Vinacom Vietnam Joint Stock Company \n- \n8 months as Sales for Supermarket Topcare \n- \n4 months as Customer Care Center for Viettel  \nRecommendation: \nThang has more than 8 years of working experience in Sales, and 7 years working in \nForwarding/ Logistics/ Import – Export field. He has a proven track record to support the \nsales performance as well as exceed the target and ensure the good relationship with clients. \nThang has successfully improved and contributed to the sales volume of the enterprises has \nworked for. He is experienced in planning and costing estimation sales price, create sale \nstrategy and training/ coaching the staff.  \nHe has good communication, power negotiation, and strong sales skill, Thang is now ready \nfor a new challenge in Import/ Export/ Logistic industry. He believes that he can contribute \nto the company’s development. \nEMPLOYMENT HISTORY \n05/2017 - Now \nMain duties: \nVOSA CORPORATION- VOSA HANOI \nSale Manager Logistics, Import And Export \n\nManage : 4 staffs \n\nReport to : Sales Director \n1. Sales \nSales Air, Sea freight, Forwarding services, and domestic. \nPromote the brand, service of the company \nTake care of existing customers, develop a network of customers, find new customers \nConsultant solutions on international transportation, customs procedures. \nResponsible for the recovery of debts, responsible for settling the work arising after the \ncustomer shipped. \n2. Set Up team sales \no Guide and train sales process, help sales men quickly create value for the company and \ncustomers. \no More than 8 experience years in the sales. Recognized for contributions to establishing \nsales records, expanding markets and developing new customers. \no Ability to lead the sales team to achieve sales. Provide a deep understanding of the sales \nprocess. \n3. Relationship management. \no Establish and expand all Partners like Air, Sea, Customs, Trucking. \no Create trust and build relationships with customers through good service quality and \ncompetitive price. \n04/2013 - 05/2017 BACH VIET GROUP COMPANY \nSale Manager Logistics, Import And Export \nMain duties: \nManage: 4 staffs \nReport to : Sales Director \n1. Sales \n- \nCarry out customer care \n- \nDirect contact with customers \n- \nAir, Sea freight, freight forwarding, domestic and international freight. \n- \nPromoting brand name, company's services \n- \nTake care of existing customers, develop a network of customers, find new \ncustomers \n- \nConsultant solutions on \ninternational freight, customs procedures ... tailored to the \nneeds of each customer \n- \nCoordinate with customer care staff to regularly monitor and update the status of \ngoods for customers/partners about shipment details, arrival date, departure date \n- \nCorporate culture aims to be fair, democratic, transparent, win-win and continually \nimproved. \n- \nHave a dedicated Customs and Dock Service team to ensure the highest levels of service \nand quality of service. \n- \nEfforts to complete sales and target revenue while providing customers with the best \nquality of service. \n- \nAnalyze customers and markets to propose appropriate sales policies \n- \nResponsible for debt collection, responsible for solving problems arising after delivery. \n2.  Management. \n- \nManage relationships with the carriers \n- \nManage relationship with the trucking \n- \nManage relationship with the customs \n- \nManage relationship with the Client \n- \nGuide and train new sales process, help new sale man quickly adapt and quickly shine. \n- \nSet up a sales team and decentralize democratically, with the policy of not shy, even \nbrazen, blatant asking difficult questions for the manager. Help people grow fast and \nmotivate sales. \n- \nRecognized for contributions in setting sales records, expanding markets and developing \nnew customers. \n- \nCombining business management skills to increase revenue, market share and profitability. \n- \nAbility to lead the sales team to achieve sales. Provides insight into the process of the sales \ncycle and always focuses on customer satisfaction. \n04/2011- \n03/2013 \nMain duties: \nVINATRACO TRADING AND IMPORT EXPORT JSC. \nSales Staff \n- \nThe company is an importer and retailer of retail rice products. \n- \nPlanning, surveying the market with the department head. \n- \nSearch for potential customers. \n- \nOffer and convince customers. \n- \nBuild partnerships. \n- \nMake sales efforts that reach sales, exceed the target of bringing profits to the company and \nincrease your income. \n- \nMaintain and develop the customer network of the company. \n- \nPerform sales operations to obtain orders from customers. \n- \nMonitor and supervise orders to ensure delivery time from production to delivery to \ncustomers. \n06/2010 - \n4/2011 \nMain duties: \nVIETTEL \nCustomer Care Center \n- \nGet professional training on counseling skills and customer care for Viettel. \n- \nAnswer and advice customers in a friendly way. \n- \nProvide a service with the most pleasing communication. \nEDUCATIONAL HISTORY \nHanoi University of Industry - Bachelor – IT \nOTHER SKILLS & ACHIEVEMENTS \n- \nProficiency in Microsoft Word, Excel, PowerPoint and Internet Environment \n(Commerce). \n- \nHard work, know the job arrangements \n- \nEnglish training facility. \n- \nGood communication and business skills. \n- \nAbility to work under high pressure. \n- \nEasy to adapt to new environment. \n- \nBusiness development \n- \nManage Risk \n- \nCreate the final strategy \n- \nExecutive management \n- \nCare Customer \n- \nCustomer relationship management \n- \nTraining and development staff \n- \nContract negotiation \n- \nPlanning and cost estimation, selling price ", "educations": [{"id": 4997, "gpa": null, "major": null, "school": "Hanoi University of Industry", "diploma": "Bachelors", "end_time": null, "conf_score": 0.6981244904084882, "start_time": null, "picklist_major": "Other", "major_categories": "", "major_categories_detail": ""}], "experiences": [{"id": 16733, "detail": "Manage : 4 staffs\nReport to : Sales Director 1. Sales Sales Air, Sea freight, Forwarding services, and domestic.\nPromote the brand, service of the company\nTake care of existing customers, develop a network of customers, find new customers\nConsultant solutions on international transportation, customs procedures.\nResponsible for the recovery of debts, responsible for settling the work arising after the customer shipped.\n2. Set Up team sales o Guide and train sales process, help sales men quickly create value for the company and customers. o More than 8 experience years in the sales. Recognized for contributions to establishing sales records, expanding markets and developing new customers. o Ability to lead the sales team to achieve sales. Provide a deep understanding of the sales process.\n3. Relationship management. o Establish and expand all Partners like Air, Sea, Customs, Trucking. o Create trust and build relationships with customers through good service quality and competitive price.", "company": "VOSA CORPORATION - VOSA HANOI", "end_time": "2023-04-13T00:00:00Z", "industry": "Other", "position": "Sale Manager Logistics, Import And Export", "conf_score": 0.9473723865789515, "start_time": "2017-05-01T00:00:00Z"}, {"id": 16735, "detail": "Main duties:\nManage: 4 staffs\nReport to : Sales Director 1. Sales - Carry out customer care\n- Direct contact with customers\n- Air, Sea freight, freight forwarding, domestic and international freight.\n- Promoting brand name, company's services\n- Take care of existing customers, develop a network of customers, find new customers\n- Consultant solutions on international freight, customs procedures ... tailored to the needs of each customer\n- Coordinate with customer care staff to regularly monitor and update the status of goods for customers/partners about shipment details, arrival date, departure date\n- Corporate culture aims to be fair, democratic, transparent, win-win and continually improved.\n- Have a dedicated Customs and Dock Service team to ensure the highest levels of service and quality of service.\n- Efforts to complete sales and target revenue while providing customers with the best quality of service.\n- Analyze customers and markets to propose appropriate sales policies\n- Responsible for debt collection, responsible for solving problems arising after delivery.\n2. Management. - Manage relationships with the carriers\n- Manage relationship with the trucking\n- Manage relationship with the customs\n- Manage relationship with the Client - Guide and train new sales process, help new sale man quickly adapt and quickly shine.\n- Set up a sales team and decentralize democratically, with the policy of not shy, even brazen, blatant asking difficult questions for the manager. Help people grow fast and motivate sales.\n- Recognized for contributions in setting sales records, expanding markets and developing new customers.\n- Combining business management skills to increase revenue, market share and profitability.\n- Ability to lead the sales team to achieve sales. Provides insight into the process of the sales cycle and always focuses on customer satisfaction.", "company": "BACH VIET GROUP COMPANY", "end_time": "2017-05-31T00:00:00Z", "industry": "Other", "position": "Sale Manager Logistics, Import And Export", "conf_score": 0.9473723865789515, "start_time": "2013-04-01T00:00:00Z"}, {"id": 16737, "detail": "- The company is an importer and retailer of retail rice products.\n- Planning, surveying the market with the department head.\n- Search for potential customers.\n- Offer and convince customers.\n- Build partnerships.\n- Make sales efforts that reach sales, exceed the target of bringing profits to the company and increase your income.\n- Maintain and develop the customer network of the company.\n- Perform sales operations to obtain orders from customers.\n- Monitor and supervise orders to ensure delivery time from production to delivery to customers.", "company": "VINATRACO TRADING AND IMPORT EXPORT JSC.", "end_time": "2013-03-31T00:00:00Z", "industry": "Trade", "position": "Sales Staff", "conf_score": 0.9260889292191576, "start_time": "2011-04-01T00:00:00Z"}, {"id": 16738, "detail": "- Get professional training on counseling skills and customer care for Viettel. - Answer and advice customers in a friendly way.\n- Provide a service with the most pleasing communication.", "company": "VIETTEL\nCustomer Care Cente", "end_time": "2011-04-30T00:00:00Z", "industry": "High Technology", "position": null, "conf_score": 0.6981244904084882, "start_time": "2010-06-01T00:00:00Z"}], "address": null}