{"skills": ["conflict management", "customer marketing", "payment", "multitasking", "investments", "recruitment", "human resources", "civil drafting", "positive attitude", "work ethic", "management", "marketing", "sales", "rss"], "fulltext": "CAO THI HAI YEN \nLEGAL GENERALIST CUM PROJECT ASSISTANT TO CEO \nPhone : (0) 914 222 353 \nEmail : yencao214@gmail.com \n75081  \nSUMMARY \nMore than 2 years working in assistant roles to CEO, Directors and Managers of various levels and 1 year working in Human \nResources services in multiple major corporations. Strong work ethics and capability to work well under pressure. Result-\noriented and solution-focused to challenges. Hardworking with a strong desire to learn and a positive attitude toward \nchallenges. Capable of working independently and multitasking. Strong commitment toward set deadline under changing \npriorities. \nPersonal philosophy: “One third of our lives is spent at work. Contribution and dedication to the workplace is, therefore, a \nnecessary endeavor to increase our personal happiness.” \nSKILLS \nStrong interpersonal \ncommunication and conflict \nmanagement skills; \nGood observational and data \nanalytical skills; \nAdaptable to dynamic working \nenvironment; \nCapable of taking on multiple roles \nsimultaneously; \nFluent in conversational English. \nEDUCATION \nPOST-EDUCATION IN \nENGLISH \nAPR 2018 – SEP 2018 \nCELLA ENGLISH, PHILLIPINES \nGRADUATE IN \nINTERNATIONAL LAW  \nAPR 2011 - SEP 2015 \nHCM UNIVERSITY OF LAW, \nVIETNAM \nMajor : International Law and Legal \nStudies \nEXPERIENCE \nASSISTANT TO PERFORMANCE & PLANNING MANAGER \nSEP 2017 – APR 2018 | Anheuser-Busch InBev Vietnam, HCMC \nAdministrate on behalf of both Regional Performance and Planning \nManagement (R-PPM) and Regional Sales Manager (RSM) in South East, \nVietnam, in details as below: \n\nEnforce payments in time for around 100 Points of Consumptions (POCs) and \nrebates for Distributors by checking performances of POCs and terms of \nconditions of investments, and giving solutions for stuck payments; \n\nPrepare Daily/Monthly/and Quarterly Sales Reports in 6 Provinces with 7 \nDistributors; \n\nEvaluate performance of Sales Team including 4 Sales Supervisors and 12 Sales \nRepresentatives and performance of Distributors by building tracking systems; \n\nDecrease customer turnover rate by 30%, making it 5% after 2 months as a \nresult; \n\nSupport releasing Free of charge (FOC) in process by examining data and \ncollating claims. submitted by Sales Team with Promotion built by Trade \nLEGAL GENERALIST CUM PROJECT ASSISTANT TO CEO \nOCT 2018 – PRESENT| Komtek Corporation, HCMC \n\nProcess legal documentations for share transfer, dissolution, and other daily \nlegal operations required by the company; \n\nLiaise with our international partners to conduct business with local customers; \n\nWork with local customers to determine their expectations of the \nproducts/services of international partners and consequently revise the proposals \nand make suitable offers to them; \n\nNegotiate with both international and local partners; \n\nDraft/Review all international and local contracts; \n\nRevise the contract template to be up-to-date and compliant with current legal \nand regulatory requirements; \n\nGive CEO updates on managed projects and provide advices on specific terms \nin project contracts which should be amended; \n\nSet up meetings for 2-way and 3-way meetings between CEO, international \npartners and local customers;  \nMarketing Team; \nCAO THI HAI YEN \nLEGAL GENERALIST CUM PROJECT ASSISTANT TO CEO \nPhone : (0) 914 222 353 \nEmail : yencao214@gmail.com \n75081  \nRECRUITMENT ASSISTANT  \nDEC 2015 - APR 2016 | TARA Corporation, HCMC \n\nWork as an assistant of Recruitment Manager; \n\nScreen & validate job applicant’s information; \n\nTake part in the recruitment’s interview process; \n\nManage & update company personnel’s information; \n\nManage Pre-Employment Processes. \nASSISTANT TO SALES DIRECTOR \nAPR 2016 - SEP 2017 | TARA Corporation, HCMC \n\nAssist Sales Director in preparing KPIs for Sales Department;  \n\nAssist Sales Director in building Regional Sales Budget by analyzing \ninvestment impact in 7 areas in Traditional Trade channel; \n\nDraft incentive policy for 10 Distributors in Modern Trade channel to boost \ntheirs performances; \n\nEvaluate nationwide sales progress of over 150 people including Promotion \nGirls (PGs), Sale Representatives, PG Team Leaders, Sales Supervisors, Area \nSales Managers and Regional Sales Managers - in both Traditional Trade and \nModern Trade channels; \n\nPerform secretary duties in weekly and monthly meetings. Replying on that, \nrequest strictly compliance from Sales Team by tracking progress, deadlines, \nand priorities of all current Sales Programs; \n\nCheck nationwide sales proposals before getting approvals from Sales Director \nand CEO; \n\nCompose, review and revise and organized B2B & partnership contracts. \nINTERNSHIP \nHUMAN RESOURCE SERVICES \nINTERN | AUG 2015 - NOV 2015 \nPhu Nhuan Jewelry Company, HCMC \n\nArranged, assisted and participated in \ngroup interviews \n\nAssisted in hosting semi-annual skills \nevaluation exam for company personnel \nLAW ASSISTANT INTERN | JUN \n2013 - MAY 2014 \nViệt Phúc Law Consulting Firm, \nHCMC \n\nAssisted in drafting Civil Contracts \n\nLearned analytical skills through \nlawsuit reviews \n\nDrafted Civil Contracts ", "educations": [{"id": 5022, "gpa": null, "major": "Thiết kế công nghiệp", "school": "HCM UNIVERSITY OF LAW, VIETNAM", "diploma": "Bachelors", "end_time": "2015-09-01T00:00:00Z", "conf_score": 0.7625990117186952, "start_time": "2011-04-01T00:00:00Z", "picklist_major": "Art/Design", "major_categories": "Nghệ thuật", "major_categories_detail": "Mỹ thuật ứng dụng"}], "experiences": [{"id": 16814, "detail": "Process legal documentations for share transfer, dissolution, and other daily legal operations required by the company;\nLiaise with our international partners to conduct business with local customers;\nWork with local customers to determine their expectations of the products/services of international partners and consequently revise the proposals and make suitable offers to them;\nNegotiate with both international and local partners;\nDraft/Review all international and local contracts;\nRevise the contract template to be up-to-date and compliant with current legal and regulatory requirements;\nGive CEO updates on managed projects and provide advices on specific terms in project contracts which should be amended;\nSet up meetings for 2-way and 3-way meetings between CEO, international partners and local customers;", "company": "Komtek Corporation, HCMC", "end_time": "2023-04-13T00:00:00Z", "industry": "High Technology", "position": "LEGAL GENERALIST CUM PROJECT ASSISTANT TO CEO", "conf_score": 0.8891934643122615, "start_time": "2018-10-01T00:00:00Z"}, {"id": 16816, "detail": "dministrate on behalf of both Regional Performance and Planning Management (R-PPM) and Regional Sales Manager (RSM) in South East, Vietnam, in details as below:\nEnforce payments in time for around 100 Points of Consumptions (POCs) and rebates for Distributors by checking performances of POCs and terms of conditions of investments, and giving solutions for stuck payments;\nPrepare Daily/Monthly/and Quarterly Sales Reports in 6 Provinces with 7 Distributors; Evaluate performance of Sales Team including 4 Sales Supervisors and 12 Sales Representatives and performance of Distributors by building tracking systems;\nDecrease customer turnover rate by 30%, making it 5% after 2 months as a result;\nSupport releasing Free of charge (FOC) in process by examining data and collating claims. submitted by Sales Team with Promotion built by Trade", "company": "Anheuser - Busch InBev Vietnam, HCMC", "end_time": "2018-04-30T00:00:00Z", "industry": "High Technology", "position": "ASSISTANT TO PERFORMANCE & PLANNING MANAGER", "conf_score": 0.9512303155325736, "start_time": "2017-09-01T00:00:00Z"}, {"id": 16818, "detail": "Assist Sales Director in preparing KPIs for Sales Department; Assist Sales Director in building Regional Sales Budget by analyzing investment impact in 7 areas in Traditional Trade channel;\nDraft incentive policy for 10 Distributors in Modern Trade channel to boost theirs performances;\nEvaluate nationwide sales progress of over 150 people including Promotion Girls (PGs), Sale Representatives, PG Team Leaders, Sales Supervisors, Area Sales Managers and Regional Sales Managers - in both Traditional Trade and\nModern Trade channels;\nPerform secretary duties in weekly and monthly meetings. Replying on that, request strictly compliance from Sales Team by tracking progress, deadlines, and priorities of all current Sales Programs; Check nationwide sales proposals before getting approvals from Sales Director and CEO; Compose, review and revise and organized B2B & partnership contracts.", "company": "TARA Corporation, HCMC", "end_time": "2017-09-30T00:00:00Z", "industry": "High Technology", "position": "ASSISTANT TO SALES DIRECTOR", "conf_score": 0.8891934643122615, "start_time": "2016-04-01T00:00:00Z"}, {"id": 16819, "detail": "; Screen & validate job applicant’s information;\nTake part in the recruitment’s interview process;\nManage & update company personnel’s information;\nManage Pre-Employment Processes.", "company": "TARA Corporation, HCMC", "end_time": "2016-04-30T00:00:00Z", "industry": "High Technology", "position": "assistant of Recruitment Manager", "conf_score": 0.8950808801970216, "start_time": "2015-12-01T00:00:00Z"}, {"id": 16820, "detail": ", HCMC Arranged, assisted and participated in group interviews\nAssisted in hosting semi-annual skills evaluation exam for company personnel", "company": "Phu Nhuan Jewelry Company", "end_time": "2015-11-30T00:00:00Z", "industry": "Other", "position": "INTERNSHIP HUMAN RESOURCE SERVICES INTERN", "conf_score": 0.894215591471374, "start_time": "2015-08-01T00:00:00Z"}, {"id": 16821, "detail": ", HCMC Assisted in drafting Civil Contracts Learned analytical skills through lawsuit reviews\nDrafted Civil Contracts", "company": "Việt Phúc Law Consulting Firm", "end_time": "2014-05-31T00:00:00Z", "industry": "Other", "position": "LAW ASSISTANT INTERN", "conf_score": 0.894215591471374, "start_time": "2013-06-01T00:00:00Z"}], "address": null}