{"skills": ["linux", "stack", "aws", "vmware vsphere", "snmp", "docker", "load balancer", "voip system", "load balancing", "network service", "automation", "backup and recovery", "apache", "implementation", "cloud", "dns", "management", "gitlab", "proxy", "oracle ebs", "postgresql", "kubernetes", "security", "ubuntu", "elasticsearch", "rsync", "devops", "tivoli", "redis", "synchronization", "docker compose", "ubuntu linux", "maintenance", "ansible", "zabbix", "nginx", "voip", "centos", "aix", "sql", "mariadb", "log management", "ibm", "ossec", "elastic stack", "oracle", "database", "rhel", "jenkins", "haproxy", "vmware esxi", "python", "teamwork", "kibana", "window server", "dhcp", "cisco", "docker swarm", "mysql", "splunk", "logstash"], "fulltext": "------------------------------------------------------------------------------------------------------------------------------------------------------ \nCHAU ANH TUAN  \n1  \nChau Anh Tuan \nSystems Administrator \nPhone: (+84) 388137900 | Email: chauanhtuandl@gmail.com \nAddress: 219/16 Ngo Tat To Street, 22 Ward, Binh Thanh District, Ho Chi Minh City. \nTHE DEGREE OF ENGINEER \nINDUSTRIAL UNIVERSITY OF \n HO CHI MINH CITY \n2011 \nGPA: 2.7/4 \nMCSA 2008 \nNhat Nghe Education JSC,  \nHo Chi Minh \n2014 \nCertificate English level C \nINDUSTRIAL UNIVERSITY OF  \nHO CHI MINH CITY \n2014 \nEducation \nCompany Name: VietCredit (2018 – Present) \nJob Description: Build platform on RHEL, AWS, Build server monitor Zabbix, network monitor PRTG, \nBuild monitor log, Vsphere ESXI, Backup data and OS, Ansible, NTP, Postfix, Elastic stack, Splunk, …. \nProject: Monitor Server – Network, Migration Domain Controler, Migration Mail Exchange to Office 365, \nLog analytic, Mail replay, Gitlab. \nSetup, Configure and maintenance: \n- Linux (Ubuntu, Centos, RHEL): DNS, DHCP, NTP, LDAP, Service: Web server (Apache, Nginx), \nDatabase (MariaDB, Postgresql, Redis, …), Load balancer (HAProxy, Nginx, Keepalive),… \n- AWS: S3, EC2, RDS, VPC, Route53, EKS, … \n- Container: Docker, Dockerfile, Docker compose, Docker Swarm, Kubernetes,… \n- DevOps: Gitlab, Jenkins, Ansible, … \n- Windows: Migrate Domain controler, VPN, AD, DHCP, DNS, Migrate Exchange to office 365. \n- Vmware: Vmware Vsphere, Vcenter. \n- Zabbix, PRTG monitor: Config Monitor Server using agent, Monitor server using script, Monitor \nnetwork, Monitor database server,…. Config mintor via SNMP, auto monitor Vmware ESXI, monitor \nmulti site via proxy, send alert to email, telegram and sms. \nExperience \n------------------------------------------------------------------------------------------------------------------------------------------------------ \nCHAU ANH TUAN  \n2  \n- ELK (Elasticsearch, Logstash, Kibana): setup and config ELK with redis and nginx. \n- Splunk: Configure analytic log and monitor server (Windows, Linux),  network device, …. \n- Backup: Setup and config bacula backup and restore on linux and windows. \n- Other: Config auto recoding command Jump – Host, Fail2ban,… \nScript written:  \n- Bash Script, Python script, Powershell script on Windows and Linux \nTroubleshoot & Other:  \n- OS, Monitor Server, error checking, export report systems, analytic log, … \nCompany Name: Hoa Sen Group (2016 – 2018) \nJob Description: Build platform on AIX for Oracle ERP, Build server monitor Zabbix, Set up network \nmonitor PRTG, Build monitor log, Vsphere, Backup data and OS, Technical support,... \nProject: ERP Oracle EBS, Monitor Server – Network. \nSetup, Configure and maintenance: \n- Linux (Ubuntu, Centos, AIX): DNS, DHCP, NTP, LDAP, Web server (Apache, Nginx), Database \n(MariaDB, Postgresql, Redis, …), load balancer Rsync, Lsync, Keepalive, Ossec, RCDev. \n- Vmware: Vmware Vsphere, Vcenter. \n- Zabbix monitor: Config Monitor Server using agent, Monitor server using script, Monitor network, \nMonitor database server, …, Config mintor via SNMP, Config auto monitor Vmware ESXI, \nConfigure monitor multi site via proxy, configure send alert to email and sms. \n- ELK (Elasticsearch, Logstash, Kibana): setup and config ELK used redis and nginx. \n- Backup: Setup and config bacula backup and restore on linux and windows. Setup and config Tivoli \nStorage Manager for System Backup and Recovery \n- HelpDesk tool: setup and config “manageengine servicedesk plus” for 50 techinician and more 3000 \nuser. Config SLA, Service catalog, Query report, …. \n- Other: Config auto recoding command Jump – Host, Fail2ban, Backup mksysb on AIX, Replication \nSQL, Pgppool, Repmgr Postgresql, … \nScript written:  \n- Bash Script, Python script, Powershell script on Windows and Linux \nTroubleshoot & Other: \n- OS, Monitor Server, error checking, export report systems, analytic log, … \nCompany Name: HHD Group (2014 – 2016) \nJob Description: Set up a Windows server, Linux, Vsphere, Cisco basic network configuration, Technical \nsupport, systems implementation manager printer, monitor server, system VoiP ... \nScript written: Powershell script, shell script and python script on Windows and Linux \nConfigure: Bacuala backup, Ossec, Rcdev, Nginx, Zabbix, Replication SQL, Load balancing web server and \ndatabase, Rsync, Lsync, Keepalive, Pgppool, Repmgr Postgresql, BDR-Postgresql, FreePBX Voip, Windows \nDomain Controler,… \nKey Skills \nBackup (Tivoli, Bacula, …) \nWeb Server \nCloud (AWS, …) \nDatabases (MS SQL, MySQL, Redis,…) \nDatabase synchronization \nLog Management (ELK, Splunk, …) \nAutomation (Jenkins, Ansible, …)  \nIndependent work and teamwork  \nVMWare \nLinux (Centos Ubuntu, RHEL…)  \nIBM system P \nIBM AIX \nMS Windows Server \nNetwork Service \nKnowledge of Security \nScript (Python, Bash, Powershell, …) \nMonitor Systems and Network   \nVOIP                                                                     \n------------------------------------------------------------------------------------------------------------------------------------------------------ \nCHAU ANH TUAN  \n3  ", "educations": [{"id": 5055, "gpa": "2.7", "major": "ENGINEER", "school": "INDUSTRIAL UNIVERSITY OF HO CHI MINH CITY", "diploma": "Bachelors", "end_time": "2011-01-01T00:00:00Z", "conf_score": 0.8315413648223192, "start_time": null, "picklist_major": "Other", "major_categories": "", "major_categories_detail": ""}], "experiences": [{"id": 16916, "detail": ") Job Description: Build platform on RHEL, AWS, Build server monitor Zabbix, network monitor PRTG, Build monitor log, Vsphere ESXI, Backup data and OS, Ansible, NTP, Postfix, Elastic stack, Splunk, .... Project: Monitor Server - Network, Migration Domain Controler, Migration Mail Exchange to Office 365, Log analytic, Mail replay, Gitlab. Setup, Configure and maintenance:\n- Linux (Ubuntu, Centos, RHEL): DNS, DHCP, NTP, LDAP, Service: Web server (Apache, Nginx), Database (MariaDB, Postgresql, Redis, ...), Load balancer (HAProxy, Nginx, Keepalive),... - AWS: S3, EC2, RDS, VPC, Route53, EKS, ... - Container: Docker, Dockerfile, Docker compose, Docker Swarm, Kubernetes,... - DevOps: Gitlab, Jenkins, Ansible, ... - Windows: Migrate Domain controler, VPN, AD, DHCP, DNS, Migrate Exchange to office 365. - Vmware: Vmware Vsphere, Vcenter. - Zabbix, PRTG monitor: Config Monitor Server using agent, Monitor server using script, Monitor network, Monitor database server,.... Config mintor via SNMP, auto monitor Vmware ESXI, monitor multi site via proxy, send alert to email, telegram and sms.\n- Other: Config auto recoding command Jump - Host, Fail2ban,... Script written:\n- Bash Script, Python script, Powershell script on Windows and Linux Troubleshoot & Other: - OS, Monitor Server, error checking, export report systems, analytic log, ...", "company": "VietCredit", "end_time": "2023-04-13T00:00:00Z", "industry": "Non-banking", "position": null, "conf_score": 0.6981244904084882, "start_time": "2018-01-01T00:00:00Z"}, {"id": 16917, "detail": "Job Description: Build platform on AIX for Oracle ERP, Build server monitor Zabbix, Set up network monitor PRTG, Build monitor log, Vsphere, Backup data and OS, Technical support,...\nProject: ERP Oracle EBS, Monitor Server - Network. Setup, Configure and maintenance:\n- Linux (Ubuntu, Centos, AIX): DNS, DHCP, NTP, LDAP, Web server (Apache, Nginx), Database (MariaDB, Postgresql, Redis, ...), load balancer Rsync, Lsync, Keepalive, Ossec, RCDev. - Vmware: Vmware Vsphere, Vcenter. - Zabbix monitor: Config Monitor Server using agent, Monitor server using script, Monitor network,\nMonitor database server, ..., Config mintor via SNMP, Config auto monitor Vmware ESXI, Configure monitor multi site via proxy, configure send alert to email and sms.\n- ELK (Elasticsearch, Logstash, Kibana): setup and config ELK used redis and nginx.\n- Backup: Setup and config bacula backup and restore on linux and windows. Setup and config Tivoli Storage Manager for System Backup and Recovery - HelpDesk tool: setup and config “manageengine servicedesk plus” for 50 techinician and more 3000 user. Config SLA, Service catalog, Query report, .... - Other: Config auto recoding command Jump - Host, Fail2ban, Backup mksysb on AIX, Replication SQL, Pgppool, Repmgr Postgresql, ... Script written:\n- Bash Script, Python script, Powershell script on Windows and Linux Troubleshoot & Other: - OS, Monitor Server, error checking, export report systems, analytic log, ...", "company": "Hoa Sen Group", "end_time": "2018-01-31T00:00:00Z", "industry": "Manufacturing", "position": null, "conf_score": 0.6981244904084882, "start_time": "2016-01-01T00:00:00Z"}, {"id": 16918, "detail": "Job Description: Set up a Windows server, Linux, Vsphere, Cisco basic network configuration, Technical support, systems implementation manager printer, monitor server, system VoiP ...", "company": "HHD Group", "end_time": "2016-01-31T00:00:00Z", "industry": "Other", "position": null, "conf_score": 0.6981244904084882, "start_time": "2014-01-01T00:00:00Z"}], "address": "219/16 Ngo Tat To Street, 22 Ward, Binh Thanh District, Ho Chi Minh City"}