{"skills": ["talent management", "payment", "analytics", "iot", "machine learning", "reporting and analysis", "management", "mobile network", "market research", "analysis", "structure", "team management", "search", "algorithm", "oop", "competitor analysis", "software development", "testing", "google analytics", "hacking", "database", "redmine", "google map"], "fulltext": "Ho Chi Minh\n+66 968 579 446\nducnguyenhuynh90@gmail.com\n linkedin.com/in/nguyenhuynhduc\nDavid Nguyen\nProduct Manager at Asia Innovations\nSummary Summary    \n1st job (Top Music Website): Top Employee of The Year: Help company growth hack by Google Adwords with\n300k daily traffic more.\n2nd job (Best Delivery For Ecommerce): Lead product team with good roadmap help company save 1 million\ndollar/month. Promote to head of product.\n3rd job: Lead an international product with big impact. Work with investor and ceo for product strategy for\nVietnam.\nEducation: Scholarship to Ajou University:  Made Smart-Chair IoT, Predicted Breast Cancer Model 98%\n(Machine Learning),...\nWork experience\nWork experience    \nProduct Manager\n2016-01 - NOW\nAsia Innovations Group\nBuilt Product Roadmap and report for CEO and investor. Write product spec, wireframe and tracking\nperformance of new feature. Designed and commissioned market research that produced data used to set\nproduct direction. Lead weekly sprints.\n_ Uplive (Livestream App)\nDefined important metric to track and analysis which help prioritize and improve product backlog.\nIncreased customer retention by 30% by redesigning Welcome screen: suggest user follow the hottest idols,\nthen the user receives notification for the app.\nOptimized landing page UX to increase conversion rate to 35%.\nIntegrated with payment partner have higher success rate help revenue increase 50%.\nRecalculated pricing structure helped increase margin and revenue.\n_ FunPepper.com (Viral Quizzes)\nProduct Backlog management and Prioritizing User Stories using Redmine\nHold daily Scrum and Backlog grooming\nCreated user stories and working with UI/UX designers for product features\nDefined short and long-term product vision and communicating it to the development team and stakeholders\nBased on viral quizzes of a competitor and our own team, define patterns that help the quizzes went viral\nagain. \nUsed A/B testing to test different UI helped increase share rate and user experience.\nPrepared ad hoc reporting and analysis metrics for the management team.\nProduct Manager\n2015-01 - 2016-01\nGiaohangnhanh. vn - Best Delivery Ecommerce\nLead 2 core products: Delivery system and Customer Happiness System. Define process and improve\noperation by metrics. Competitor Analysis and Product Strategy Deliver great feature with team help save\nmillion dollars.\n2013-01 - 2015-01\n_ On Demand Delivery (New Services): Uber for delivery project\nCalculated Feasibility of Project, Time to launch, Cost and Return on Invest.\nReviewed 150K record of delivery address, using Google Map API to calculate Avg amount orders, estimate\nAvg salary of a delivery man.\nResult: Avg salary is low the and we will have a big receives. Service will ready after one more year.\n_ Quality Ontime delivery system:\nImproved Ontime service rate from  46% to 99%. Added group detail tracking.\nAdded 10 metrics tracking breakdown by stations, by fail reason, area, client,… Operation fixes top 10 reasons\nthat we can control and simplify the process, cut cost by cut complex wasted step.\nResult: Ontime service reaches 99% in 3 continuous months. Save millions dollar monthly.\nProduct Leader\nNCT Corporation - Top Music Website\nManagement Trainee at (7 months) Studied about company structure, operation, and music industry.\nReviewed all function of company product, researched about competitors and gave an action plan to improve\nthe product.\nPromoted to Product Leader, Managed a team working on data and function of website NhacCuaTui.com to\nmake customer happier.\nMy Standout Projects:\n+ Produced best Music Search Tool: improve search ranking algorithm \nReviewed quality search feature base on Google Analytics: 20% can't find their result on the first page.\nDefined: Algorithm picks the most click result history data, suggest on the top automatically.\nResult: improved over 90% user can find the song they want in first page.\n+ Made algorithm remove cheater in Leaderboard Ranking:\nDefined new Algorithm: A song ranking formula by Facebook like/view, time(newer is better), remove under 10\nsecond view.\nResult: Leaderboard increase 27% view, automatic remove cheater, promote new talent artist\n2018 - 2018\n2008 - 2012\n2010 - 2010\nAjou University - ICT Global Program\nMachine Learning, IoT, Big Data, Mobile Network, and technology business.\nBachelor of Computer Science - University of Science Ho Chi Minh\nAlgorithm, Database, OOP Programming, Software Development.\nDeveloping Innovative Idea for New Companies - Coursera\nTalent Management Team - AIESEC\nEducation Education    ", "educations": [{"id": 5075, "gpa": null, "major": "Công nghệ kỹ thuật vật liệu xây dựng", "school": "Ajou University", "diploma": "Bachelors", "end_time": "2018-01-01T00:00:00Z", "conf_score": 0.7968341985623422, "start_time": "2018-01-01T00:00:00Z", "picklist_major": "Technical", "major_categories": "Công nghệ kỹ thuật", "major_categories_detail": "Công nghệ kỹ thuật kiến trúc và công trình xây dựng"}, {"id": 5076, "gpa": null, "major": "Khoa học máy tính", "school": "University of Science Ho Chi Minh", "diploma": "Bachelors", "end_time": "2012-01-01T00:00:00Z", "conf_score": 0.8298522713442309, "start_time": "2008-01-01T00:00:00Z", "picklist_major": "IT - Hardware/Networking", "major_categories": "Máy tính và công nghệ thông tin", "major_categories_detail": "Máy tính"}], "experiences": [{"id": 16974, "detail": "uilt Product Roadmap and report for CEO and investor. Write product spec, wireframe and tracking performance of new feature. Designed and commissioned market research that produced data used to set product direction. Lead weekly sprints.\n_ Uplive (Livestream App) Defined important metric to track and analysis which help prioritize and improve product backlog.\nIncreased customer retention by 30% by redesigning Welcome screen: suggest user follow the hottest idols, then the user receives notification for the app.\nOptimized landing page UX to increase conversion rate to 35%. Integrated with payment partner have higher success rate help revenue increase 50%. Recalculated pricing structure helped increase margin and revenue.\n_ FunPepper.com (Viral Quizzes) Product Backlog management and Prioritizing User Stories using Redmine Hold daily Scrum and Backlog grooming\nCreated user stories and working with UI/UX designers for product features\nDefined short and long-term product vision and communicating it to the development team and stakeholders\nBased on viral quizzes of a competitor and our own team, define patterns that help the quizzes went viral again.\nUsed A/B testing to test different UI helped increase share rate and user experience.\nPrepared ad hoc reporting and analysis metrics for the management team.", "company": "Asia Innovations Group", "end_time": "2023-04-13T00:00:00Z", "industry": "Other", "position": "Product Manager", "conf_score": 0.9164993257908443, "start_time": "2016-01-01T00:00:00Z"}, {"id": 16975, "detail": "est Delivery Ecommerce Lead 2 core products: Delivery system and Customer Happiness System. Define process and improve operation by metrics. Competitor Analysis and Product Strategy Deliver great feature with team help save million dollars.\n_ On Demand Delivery (New Services): Uber for delivery project\nCalculated Feasibility of Project, Time to launch, Cost and Return on Invest. Reviewed 150K record of delivery address, using Google Map API to calculate Avg amount orders, estimate\nAvg salary of a delivery man.\nResult: Avg salary is low the and we will have a big receives. Service will ready after one more year.\n_ Quality Ontime delivery system:\nImproved Ontime service rate from 46% to 99%. Added group detail tracking.\nAdded 10 metrics tracking breakdown by stations, by fail reason, area, client,... Operation fixes top 10 reasons that we can control and simplify the process, cut cost by cut complex wasted step.\nResult: Ontime service reaches 99% in 3 continuous months. Save millions dollar monthly.", "company": "Giaohangnhanh. vn", "end_time": "2016-01-31T00:00:00Z", "industry": "Transportation & Logistics", "position": "Product Manager", "conf_score": 0.9174648511369632, "start_time": "2015-01-01T00:00:00Z"}, {"id": 16976, "detail": "agement Trainee at (7 months) Studied about company structure, operation, and music industry.\nReviewed all function of company product, researched about competitors and gave an action plan to improve the product.\nPromoted to Product Leader, Managed a team working on data and function of website NhacCuaTui.com to make customer happier.\nMy Standout Projects: + Produced best Music Search Tool: improve search ranking algorithm\nReviewed quality search feature base on Google Analytics: 20% can't find their result on the first page.\nDefined: Algorithm picks the most click result history data, suggest on the top automatically.\nResult: improved over 90% user can find the song they want in first page.\n+ Made algorithm remove cheater in Leaderboard Ranking: Defined new Algorithm: A song ranking formula by Facebook like/view, time(newer is better), remove under 10 second view.\nResult: Leaderboard increase 27% view, automatic remove cheater, promote new talent artist", "company": "NCT Corporation - Top Music Website", "end_time": "2015-01-31T00:00:00Z", "industry": "Other", "position": "Product Leader", "conf_score": 0.9174648511369632, "start_time": "2013-01-01T00:00:00Z"}, {"id": 16977, "detail": "Developing Innovative Idea for New Companies - Coursera", "company": "AIESEC", "end_time": "2010-01-31T00:00:00Z", "industry": "Other", "position": "Talent Management Team", "conf_score": 0.7897513794629749, "start_time": "2010-01-01T00:00:00Z"}], "address": "Ho Chi"}