{"skills": ["integration testing", "data modeling", "networking", "git", "enterprise system", "testing", "agile", "tcp", "jira", "linux", "qtp", "strategic planning", "vast", "security", "project management", "electronics engineering", "regression testing", "microsoft", "regression", "radius", "sql", "clarify", "black box testing", "test data", "system testing", "sql database", "database", "gui testing", "protocol", "hp qtp", "dhcp", "functional testing", "crm", "wifi", "openldap", "ams", "enterprise", "critical thinking", "udp", "lifecycle", "teamwork", "hp", "maintenance", "network security", "management", "problem solving"], "fulltext": "Resume\nVO THI NGAN HUYEN\nEmail:  Mobile: \nSUMMARY:\nNearly 7 years working in the software companies such as Elca, Nash Tech and TMA Solutions in the\ndifferent business projects of FINMA, Amdocs, Avaya, I had strong experience in software testing\nmethodologies and process with a wide variety of projects in Web Application/System testing.\nExpertise in analyzing documents and identifying, creating the required Test Plan, Test Scenarios.\nExtensive Experience in software testing which includes Functional Testing, Regression Testing,\nSystem Testing, GUI Testing, Integration Testing.\nReport and tracking defect to managers using Tools like Quality Center and Jira.\nExperience in working onsite directly with clients.\nBesides that, I am critical thinking, responsible, dependable in work as well as interpersonal and team\nwork spirit in a proactive environment with friendly and effective communication.\nCAREER HISTORY AND EXPERIENCE:\nNov 2016 – Now:       BA cum QC – ELCA Vietnam\nFINMA & Federal Department of Foreign Affairs \nFINMA is Switzerland’s independent financial-markets regulator\nResponsibilities \n\nQuickly understand the project's business\n\nBusiness know-how support: organize the business transfer, \nbusiness sharing, analyze/reproduce customer’s issues.\n\nClarify unclear or inconsistent points in requirement \nReviews requirements, specifications, business processes and \nrecommendations related to the proposed solution.\n\nCreate/ Review test cases, Test plan\nPlan and estimate testing activities\n\nDevelop test cases, prepare test data, and execute the test \nmanually\n\nReport to project manager & Retain business knowledge by \norganizing documents\nTechnologies used in project\n\nEnvironment: Windows; Browser: IE, Edge, Chrome,\nFirefox\n\nDatabase: SQL server\n\nGUI, UX, Data modeling, Report, Security\n\nTool: GIT, Jira\nAchievements\n\nPlan, estimate and report on work activities with PM\n\nWork closely with the developers’ team to meet client \nexpectations\nPage:  1  of  4\nResume\n\nDocument and analyze the required information and data.\n\nCommunicate effectively with internal teams and external \nclients to deliver the expected applications \n\nTesting and delivery the high-quality application to \ncustomers on time\n\nFamiliar with Agile IT methodology\nJun.2014 – May 2016:\nSenior Engineer – Harvey Nash\nAmdocs ODC – Telkom (South Africa) and Globe (Philippines)\nAmdocs is the market leader in customer experience software solutions\nand services for the world’s largest communications, entertainment and\nmedia service providers such as AT&T, EE, Vodafone, Globe…\nTIS-Technology Integration Services is the huge part of Amdocs\nprofessional services unit; approach to the testing lifecycle delivers a\ncomplete lifecycle solution from strategic planning to execution and\nmetrics. Our services scope covers business processes, operational & non-\nfunctional processes as well as end-to-end, end user testing & customer\nexperience testing.\nResponsibilities\n\nDeveloping test scenarios for all supported area and execute TCs\n\nReview test cases and test scenarios with Internal and Clients\n\nTransfer knowledge to Teammate, new members about Business\nProcess and System \n\nConsolidate and Report the defects/ issue/ testing status daily and\nweekly\nTechnologies used in project\n\nEnvironment: Windows, Linux\n\nDatabase: SQL server\n\nCES – Customer Experience Solutions: CRM, OMS…\n\nTool: Putty, FPT, QTP , HP Quality Center\nAchievements\n\nOn-site working for business meeting, supporting with customers\n\nVast Experience in designing test plan, test case and execution \n\nGood at capturing, analyzing and resolving problem\n\nExperience in Enterprise system with many domains: CRM, OMS,\nEPC, ACC, AM, Billing…\n\nFamiliar with Scrum methodology\nFeb.2014 – Jun.2014:\nSenior Engineer – TMA Solutions\nPage  2  of  4\nResume\nB179 Conference Phone Project\nB179 Conference phone is the strategy product of Avaya about conference\nphone area. It uses SIP protocol to communicate with Avaya\ncommunication and provide the best services for conference call in many\ncall servers: Aura, IPO and CS1K \nResponsibilities\n\nDeveloping test plan for all supported area and Testing\n\nReport problems to designers\n\nInvestigate documents\nTechnologies used in project\n\nEnvironment: Windows, Linux\n\nNetworking : \nLayer 2: VLAN, LLDP\nLayer 3: IP, TCP, UDP, DHCP\nLayer 4: HTTP\nNetwork Security : HTTPS/TLS, RADIUS\nAchievements\n\nDeveloping test plan  test cases and  executing TCs\n\nInstall and configure Communication server\n\nExperience in review the QA documents (test plan, feature\nspecification, etc.)\n\nExperience in black-box testing: Functional Testing, Regression \nTesting, System Testing\nNov.2011 - Feb.2014  \nEngineer – TMA Solutions\nDECT/WIFI Project\nThis is the wireless project, uses DECT protocol to communicate between\nhandset with Avaya CM via IPBS/IPBL. \nResponsibility:\n Testing\n\nSystem installation, operation and maintenance\nTechnologies:\n\nEnvironment: Linux, Window\n\nTechnology: DECT, H323, H323 trunk, SIP trunk, PTT ( Push to\ntalk )\nAchievements:\n\nBuild up lab, install and configure DECT systems\n\nTroubleshoot the issues, report problems to designers\n\nInvestigate documents, compose test cases.\n\nSupport in training new members about background knowledge of\nDECT system\n\nSupport issue customer and work directly with designer to support\nthe issue\n\nGet a knowledge about OPENLDAP + Microsoft SQL 2008\nSKILLS:\n\nProject management\n       Have the knowledge to provide a strategy, estimation and planning for project\nPage  3  of  4\nResume\n\nCritical thinking\n       Research and analyse data which requires to think critically\n Dedication       \n      Being continually self-investigated and improved for knowledge of new technologies\nCommitment \n     Consistently accomplishing tasks on time with high responsibility\n     Be willing to work on far-mission for experience cumulating and skill improvement.\nOrganization, time management     \n      Planning, prioritizing the essentially important tasks and established the timelines.\nProblem-solving      \n          Analyzing, evaluating and finding out solutions to solve the issues as soon and efficiently \nas possible.\nTeamwork       \n      Highly dependable in work as well as good interpersonal and team work spirit in a \nproactive environment with friendly, open-minded, and cooperative qualification.\n\n\n\n\nLANGUAGES:\n\n English and Vietnamese\n\nTOEFL ibt 64/ IETLS 6.0\nEDUCATION:\n2006 – 2011\nViet Nam Aviation Academy\nCommunications- Electronics engineering technology\nPage  4  of  4", "educations": [{"id": 5091, "gpa": null, "major": "Công nghệ kỹ thuật điện tử – viễn thông", "school": "Viet Nam Aviation Academy", "diploma": "Bachelors", "end_time": "2011-01-01T00:00:00Z", "conf_score": 0.9299204431562893, "start_time": "2006-01-01T00:00:00Z", "picklist_major": "Technical", "major_categories": "Công nghệ kỹ thuật", "major_categories_detail": "Công nghệ kỹ thuật điện, điện tử và viễn thông"}], "experiences": [{"id": 17025, "detail": "FINMA is Switzerland’s independent financial-markets regulator\nResponsibilities Quickly understand the project's business\nBusiness know-how support: organize the business transfer, business sharing, analyze/reproduce customer’s issues.\nClarify unclear or inconsistent points in requirement\nReviews requirements, specifications, business processes and recommendations related to the proposed solution.\nCreate/ Review test cases, Test plan\nPlan and estimate testing activities\nDevelop test cases, prepare test data, and execute the test manually\nReport to project manager & Retain business knowledge by organizing documents\nTechnologies used in project\nEnvironment: Windows; Browser: IE, Edge, Chrome, Firefox Database: SQL server\nGUI, UX, Data modeling, Report, Security Tool: GIT, Jira Achievements Plan, estimate and report on work activities with PM Work closely with the developers’ team to meet client expectations\nDocument and analyze the required information and data.\nCommunicate effectively with internal teams and external clients to deliver the expected applications\nTesting and delivery the high-quality application to customers on time\nFamiliar with Agile IT methodology", "company": "ELCA Vietnam\nFINMA & Federal Department of Foreign Affairs", "end_time": "2023-04-13T00:00:00Z", "industry": "Other", "position": "BA cum QC", "conf_score": 0.8384022261982151, "start_time": "2016-11-01T00:00:00Z"}, {"id": 17027, "detail": "(South Africa) and Globe (Philippines) Amdocs is the market leader in customer experience software solutions and services for the world’s largest communications, entertainment and media service providers such as AT&T, EE, Vodafone, Globe... TIS-Technology Integration Services is the huge part of Amdocs professional services unit; approach to the testing lifecycle delivers a complete lifecycle solution from strategic planning to execution and metrics. Our services scope covers business processes, operational & non- functional processes as well as end-to-end, end user testing & customer experience testing.\nResponsibilities Developing test scenarios for all supported area and execute TCs Review test cases and test scenarios with Internal and Clients Transfer knowledge to Teammate, new members about Business Process and System Consolidate and Report the defects/ issue/ testing status daily and weekly\nTechnologies used in project\nEnvironment: Windows, Linux Database: SQL server\nCES - Customer Experience Solutions: CRM, OMS... Tool: Putty, FPT, QTP , HP Quality Center Achievements On-site working for business meeting, supporting with customers\nVast Experience in designing test plan, test case and execution\nGood at capturing, analyzing and resolving problem\nExperience in Enterprise system with many domains: CRM, OMS, EPC, ACC, AM, Billing... Familiar with Scrum methodology", "company": "Harvey Nash Amdocs ODC - Telkom", "end_time": "2016-05-31T00:00:00Z", "industry": "Other", "position": "Senior Engineer", "conf_score": 0.8384022261982151, "start_time": "2014-06-01T00:00:00Z"}, {"id": 17029, "detail": "B179 Conference Phone Project B179 Conference phone is the strategy product of Avaya about conference phone area. It uses SIP protocol to communicate with Avaya communication and provide the best services for conference call in many call servers: Aura, IPO and CS1K Responsibilities Developing test plan for all supported area and Testing Report problems to designers\nInvestigate documents\nTechnologies used in project\nEnvironment: Windows, Linux Networking : Layer 2: VLAN, LLDP Layer 3: IP, TCP, UDP, DHCP Layer 4: HTTP Network Security : HTTPS/TLS, RADIUS Achievements Developing test plan test cases and executing TCs Install and configure Communication server\nExperience in review the QA documents (test plan, feature specification, etc.)\nExperience in black-box testing: Functional Testing, Regression Testing, System Testing", "company": "TMA Solutions", "end_time": "2014-06-30T00:00:00Z", "industry": "High Technology", "position": "Senior Engineer", "conf_score": 0.9089868123963978, "start_time": "2014-02-01T00:00:00Z"}, {"id": 17031, "detail": "DECT/WIFI Project This is the wireless project, uses DECT protocol to communicate between handset with Avaya CM via IPBS/IPBL. Responsibility: Testing System installation, operation and maintenance\nTechnologies: Environment: Linux, Window Technology: DECT, H323, H323 trunk, SIP trunk, PTT ( Push to talk ) Achievements: Build up lab, install and configure DECT systems\nTroubleshoot the issues, report problems to designers\nInvestigate documents, compose test cases.\nSupport in training new members about background knowledge of\nDECT system\nSupport issue customer and work directly with designer to support the issue\nGet a knowledge about OPENLDAP + Microsoft SQL 2008", "company": "TMA Solutions", "end_time": "2014-02-28T00:00:00Z", "industry": "High Technology", "position": "Engineer", "conf_score": 0.9542271074073599, "start_time": "2011-11-01T00:00:00Z"}], "address": null}