{"skills": ["futures", "ams", "sales", "management", "administration", "human resources", "business requirement", "compensation and benefits", "performance management", "insurance", "recruitment", "business goal", "business strategy", "organization design", "testing", "communication skill", "database", "clarify", "class", "resource manager", "creative thinking", "system administration", "biotechnology", "training document"], "fulltext": "VO TRAN NHU TRANG\nHR Manager/Human Resources Manager\n 0909883523  trangvo312@gmail.com\n433/35/5 Le Duc Tho Street, Ward 17, Go\nVap District, Ho Chi Minh, Vietnam\nGender\n: Female\nBirthday\n: 30/12/1985\nMarital status\n: Married\nNationality\n: Vietnamese\nCountry\n: Vietnam\nPERSONAL PROFILE\nAddress\n: 433/35/5 Le Duc Tho Street, Ward 17, Go Vap District, Ho Chi Minh, Vietnam\nLevel\n: Manager\nSalary\n: Negotiable\nJob type\n: Full time\nIndustry\n: Human Resources\nLocation\n: Ho Chi Minh\nCAREER INFORMATION\nI am seeking for a career as a HR Manager at a dynamic and professional environment so that I can contribute my\nexperience, knowledge, and passion to your achievement and success in the future.\nOBJECTIVES\n9/2017 - Now : Head of HR - Leflair Vietnam (An E-commerce company)\n- Manage and administer all Human Resources activities including recruitment, onboarding, performance\nmanagement, learning and development and compensation and benefits. \n- Develop, implement, and improve the company's HR processes, policies and practices to in align with the\ndevelopment of the company’s business goals and the law. \n- Work with management and employees to improve work relationships, build morale, increase productivity and\nretention. \n- Consult with Line Managers providing HR guidance in relation to employee training and development, assessments,\npromotions and labor discipline. \n- Work with Line Managers to proceed with the periodic performance appraisal to probationers and employees. \n- Ensure accurate and timely management of payroll, benefits and tax related services. \n- Implement and review compensation and benefits system and recommend any appropriate changes. \n- Manage and resolve problems about labor relations disciplines. \n- Act as a partner and communication link between the top management and the employees. \n- Oversee and manage daily operation relating to office as well. Be responsible for such tasks as follows: \n• Manage end-to-end moving of new office, consisting of looking for new place, constructor, office fitting out,\nEXPERIENCE\nYear(s) of Experience: 11\nCurrent Level: Manager\nrental contract negotiation, office green decoration and dealing with office board management to provide at most\nconvenient path for the business operation. \n• Build, implement and improve the company’s office guidance and processes. \n• Manage and update supplier database for office needs. \n• Review all the service contracts in relating to the office. \n• Organize and manage employee outings, company trip and internal events. \n• Manage and oversee for office utilities, equipment to assure good and convenient working environment. \n• Responsible for purchasing and clearance office property, stationeries, etc. \n• Directly work with the representatives of local authorities any matters relating to business operation. \n• Plan and manage annual internal expense for the office. \n• Supervise any matters in relating to hiring expats including: visa, work permit, housing, etc.\n3/2015 - 8/2017 : HR Manager - VINGROUP\n- Manage and administer all Human Resources activities including recruitment, onboarding, performance\nmanagement, mentorship and benefits and compensation. \n- Set up company from the beginning stage, especially, HR and Administration system and supervise initial\nregistering procedures to Government. \n- Design organization chart and build up functional description of the company in general and of each department in\ndetail. \n- Plan, forecast and control annual operation financial for HR and Administration. \n- Build up, implement and update HR procedures and policies to support the achievement of the company’s\nbusiness goals and compliance to the law and regulation. \n- Monitor and review compensation and benefits system and recommend any appropriate changes. \n- Develops training and performance management program that ensures all employees are familiar with their job\nresponsibilities. \n- Manage and resolve complex employee relations issues by conducting objective investigations. \n- Act as a partner and communication link between the management and the employees. \n- Manage and organize all company events such as health check –up, Year End Party, X-Mas, company trip,\nanniversary group party, sport activities, etc. \n- Oversee and manage daily tasks relating to office management as well. \n- Manage any matters relating to hiring expats including: visa, work permit, housing, etc.\n4/2013 - 3/2015 : HR Team Leader - THANH THANH CONG GROUP (TTC GROUP)\n- Implement a full-cycle recruitment process, consisting of job posting, screening, testing, interviewing, offering and\nonboarding. \n- Work directly with hiring managers (in head office and member companies) to identify annual requisition need and\nimplement the recruitment plan to ensure providing talent promptly for group business strategies. \n- Follow and support proactively new hires during their probation and coordinate with hiring managers to implement\nperiodically check-in and performance appraisal after probation end. \n- Build up and update job description, job recruitment criteria and recruitment process in align with the changes and\nbusiness requirements. \n- Take part in PR campaigns related to recruitment activities such as university sponsorship, career fairs at some\nprovinces, seminars, etc. to foster the relationship with the agencies and build up a talent pool. \n- Take care any matters relating to hiring expats including: visa, work permit, housing, etc. \n- Work directly with line managers to identify annual training plan and implement the training plan to develop talent. \n- Be responsible for logistics supporting in-house and outdoor training courses such as: training documents, class\ndecoration, teaching tools, tea break, lunch break, etc. \n- Coordinate with HR team to celebrate monthly staff birthday parties and act as a pro-active MC in these events.\n10/2011 - 1/2013 : Senior Southern HR Executive - SAIGON – HANOI BANK (SHB)\n- Mainly be in charge of the recruitment activities in Southern area including Hochiminh City, Binh Duong, Binh Phuoc,\nand Long An province. \n- Liaise with head of each department to identify annual recruitment plan and follow up the plan after finalizing. \n- Implement induction to new employees about internal regulations, rules, and follow up their probation evaluation\nand arrange labor contract signing and renewal. \n- Execute procedures relates to SI-HI-UI to Social Insurance Authority.\n6/2008 - 9/2011 : Business Development Project Manager - GLANDORE SYSTEMS\n- Be responsible for managing many professional research projects about companies who worked in medical device,\npharmaceutical and biotechnology industry in the USA to have a chance to sale Company’s service. \n- Manage a group of five members, assign and supervise them to do the projects done well. \n- Supervise the team to screen the right candidates to provide clients for the best workforce solution and identify\nsuitable candidates to approach concluded in positive and negative candidates. \n- Work directly with American client to improve the working efficiency and quality of Vietnamese team. \n- Coach and supervise new probationers know how to clarify the jobs, use the job boards and social networks to\ntake their duties done well.\nCompletion date 7-2013\nBachelor - University of Economics, Ho Chi Minh City, BA, Business Administration\nCompletion date 6-2008\nBachelor - University of Social Sciences and Humanities, Ho Chi Minh City, BA, English\nEDUCATION\nHighest Degree Level: Bachelor\nAWARDS\nScholarship of Management Development Institute of Singapore (MDIS), 2004 - 2005\nScholarship of Japanese Business Association of Ho Chi Minh city (JBAH), 2005 - 2006\nScholarships of University of Social Sciences and Humanities \nCAREER HIGHLIGHTS\n5-star customer ambassador Skill, VinAcademy, 2015\nPublic Communication Skill, TTC Group, 2014\nPlanning Skill, VinAcademy, 2015\nCreative Thinking Skill, VinAcademy, 2015\nSKILLS\nEnglish\nLANGUAGES\n© CareerBuilder.vn", "educations": [{"id": 5095, "gpa": null, "major": "Quản lý đô thị và công trình", "school": "University of Economics, Ho Chi Minh City", "diploma": "Bachelors", "end_time": "2013-07-01T00:00:00Z", "conf_score": 0.8225550773200425, "start_time": null, "picklist_major": "Architecture / Interior Design", "major_categories": "Kiến trúc và xây dựng", "major_categories_detail": "Kiến trúc và quy hoạch"}, {"id": 5096, "gpa": null, "major": "English", "school": "University of Social Sciences and Humanities", "diploma": "Bachelors", "end_time": "2008-06-01T00:00:00Z", "conf_score": 0.8138249859480752, "start_time": null, "picklist_major": "Other", "major_categories": "", "major_categories_detail": ""}], "experiences": [{"id": 17039, "detail": "Manage and administer all Human Resources activities including recruitment, onboarding, performance management, learning and development and compensation and benefits.\n- Develop, implement, and improve the company's HR processes, policies and practices to in align with the development of the company’s business goals and the law.\n- Work with management and employees to improve work relationships, build morale, increase productivity and retention.\n- Consult with Line Managers providing HR guidance in relation to employee training and development, assessments, promotions and labor discipline.\n- Work with Line Managers to proceed with the periodic performance appraisal to probationers and employees.\n- Ensure accurate and timely management of payroll, benefits and tax related services.\n- Implement and review compensation and benefits system and recommend any appropriate changes.\n- Manage and resolve problems about labor relations disciplines.\n- Act as a partner and communication link between the top management and the employees.\n- Oversee and manage daily operation relating to office as well. Be responsible for such tasks as follows:\n• Manage end-to-end moving of new office, consisting of looking for new place, constructor, office fitting out, rental contract negotiation, office green decoration and dealing with office board management to provide at most convenient path for the business operation.\n• Build, implement and improve the company’s office guidance and processes.\n• Manage and update supplier database for office needs.\n• Review all the service contracts in relating to the office.\n• Organize and manage employee outings, company trip and internal events.\n• Manage and oversee for office utilities, equipment to assure good and convenient working environment.\n• Responsible for purchasing and clearance office property, stationeries, etc.\n• Directly work with the representatives of local authorities any matters relating to business operation.\n• Plan and manage annual internal expense for the office.\n• Supervise any matters in relating to hiring expats including: visa, work permit, housing, etc.", "company": "Leflair Vietnam (An E - commerce company)", "end_time": "2023-04-13T00:00:00Z", "industry": "Trade", "position": "Head of HR", "conf_score": 0.9366346352724929, "start_time": "2017-09-01T00:00:00Z"}, {"id": 17040, "detail": "- Manage and administer all Human Resources activities including recruitment, onboarding, performance management, mentorship and benefits and compensation.\n- Set up company from the beginning stage, especially, HR and Administration system and supervise initial registering procedures to Government. - Design organization chart and build up functional description of the company in general and of each department in detail.\n- Plan, forecast and control annual operation financial for HR and Administration. - Build up, implement and update HR procedures and policies to support the achievement of the company’s business goals and compliance to the law and regulation.\n- Monitor and review compensation and benefits system and recommend any appropriate changes.\n- Develops training and performance management program that ensures all employees are familiar with their job responsibilities.\n- Manage and resolve complex employee relations issues by conducting objective investigations.\n- Act as a partner and communication link between the management and the employees.\n- Manage and organize all company events such as health check -up, Year End Party, X-Mas, company trip, anniversary group party, sport activities, etc.\n- Oversee and manage daily tasks relating to office management as well.\n- Manage any matters relating to hiring expats including: visa, work permit, housing, etc.", "company": "VINGROUP", "end_time": "2017-08-31T00:00:00Z", "industry": "Real Estate", "position": "HR Manager", "conf_score": 0.9174648511369632, "start_time": "2015-03-01T00:00:00Z"}, {"id": 17041, "detail": "- Implement a full-cycle recruitment process, consisting of job posting, screening, testing, interviewing, offering and onboarding.\n- Work directly with hiring managers (in head office and member companies) to identify annual requisition need and implement the recruitment plan to ensure providing talent promptly for group business strategies.\n- Follow and support proactively new hires during their probation and coordinate with hiring managers to implement periodically check-in and performance appraisal after probation end.\n- Build up and update job description, job recruitment criteria and recruitment process in align with the changes and business requirements.\n- Take part in PR campaigns related to recruitment activities such as university sponsorship, career fairs at some provinces, seminars, etc. to foster the relationship with the agencies and build up a talent pool.\n- Take care any matters relating to hiring expats including: visa, work permit, housing, etc.\n- Work directly with line managers to identify annual training plan and implement the training plan to develop talent.\n- Be responsible for logistics supporting in-house and outdoor training courses such as: training documents, class decoration, teaching tools, tea break, lunch break, etc.\n- Coordinate with HR team to celebrate monthly staff birthday parties and act as a pro-active MC in these events.", "company": "THANH THANH CONG GROUP (TTC GROUP)", "end_time": "2015-03-31T00:00:00Z", "industry": "Other", "position": "HR Team Leader", "conf_score": 0.9174648511369632, "start_time": "2013-04-01T00:00:00Z"}, {"id": 17042, "detail": "- Mainly be in charge of the recruitment activities in Southern area including Hochiminh City, Binh Duong, Binh Phuoc, and Long An province.\n- Liaise with head of each department to identify annual recruitment plan and follow up the plan after finalizing.\n- Implement induction to new employees about internal regulations, rules, and follow up their probation evaluation and arrange labor contract signing and renewal.\n- Execute procedures relates to SI-HI-UI to Social Insurance Authority.", "company": "SAIGON - HANOI BANK (SHB)", "end_time": "2013-01-31T00:00:00Z", "industry": "Banking", "position": "Senior Southern HR Executive", "conf_score": 0.9174648511369632, "start_time": "2011-10-01T00:00:00Z"}, {"id": 17043, "detail": "- Be responsible for managing many professional research projects about companies who worked in medical device, pharmaceutical and biotechnology industry in the USA to have a chance to sale Company’s service.\n- Manage a group of five members, assign and supervise them to do the projects done well.\n- Supervise the team to screen the right candidates to provide clients for the best workforce solution and identify suitable candidates to approach concluded in positive and negative candidates.\n- Work directly with American client to improve the working efficiency and quality of Vietnamese team.\n- Coach and supervise new probationers know how to clarify the jobs, use the job boards and social networks to take their duties done well.", "company": "GLANDORE SYSTEMS", "end_time": "2011-09-30T00:00:00Z", "industry": "Real Estate", "position": "Business Development Project Manager", "conf_score": 0.9423521207971671, "start_time": "2008-06-01T00:00:00Z"}], "address": "433/35/5 Le Duc Tho Street, Ward 17, Go"}