{"skills": ["online game", "investments", "administration", "insurance", "leasing", "project management", "legal risk", "microsoft", "restructuring", "le", "database", "ams", "enterprise", "corporate governance", "futures", "risk management", "taxation", "management", "shipping insurance", "risks"], "fulltext": "NGUYỄN THÁI BÌNH\nSenior Legal & Compliance Executive\nGender\n: Male\nBirthday\n: 17/02/1989\nMarital status\n: Married\nNationality\n: Vietnamese\nCountry\n: Vietnam\nPhone number\n: 0387888114\nEmail\n: thaibinh.1702@gmail.com\nAddress\n: Ward 10, Tan Binh District, Ho\n PERSONAL PROFILE\nChi Minh, Vietnam\nResearch\nNegotiation\nMicrosoft Office\nCorporate law\nInternational business\n SKILLS\nLevel\n: Team Leader / Supervisor\nSalary\n: 1.400 - 1.500 USD\nJob type\n: Full time\nIndustry\n: Law / Legal Services\nLocation\n: Ho Chi Minh\nCAREER INFORMATION\nNow, I am seeking and obtaining a challenging position\nwith my major in Business Law which can utilize my\nexperience and knowledge, to develop skills in work\nfor my future career in legal.\nSummary\n- Graduated from University of Economics Ho Chi Minh\nCity with major in Business Law and Master of\nBusiness Administration. \n- With more 8 years experiences in legal and 3 years in\ncompliance on various fields such as retail, corporate,\ncontract, labor laws and international trade…\n- Specialties: Open minded, dynamic and responsible.\n OBJECTIVES\nViet Nam\nEnglish\n LANGUAGES\n5/2016 - Now : Senior Legal & Compliance Executive - Trung Nguyen International\nCorporation\nTrung Nguyen International Corporation (TNI) is established by Madame Le Hoang Diep Thao - the\nfounder and co-owner of Trung Nguyen Coffee Group. With the headquarter and two factories\nlocated in Vietnam and other representative offices in Singapore, China, US, Australia, TNI aims to\n EXPERIENCE\nYear(s) of Experience: 8\nCurrent Level: Team Leader / Supervisor\nbring reputable coffee brands from Viet Nam to the world. \nTrung Nguyen International Corporation is also developing King Coffee Chains now. \nResponsibilities: \nContracting \n• Prepare, review and modify all contracts or any other documentation provide legal opinion to the\nexecutive management's attention and reduce risk associated with contract documents. \n• Negotiate, review and draft documentation for business transactions and prepare and advise on\nthe necessary checklist to be adopted to ensure information is submitted on time. \nLegal issues \n• Review and provide legal advice on the specific cases related to corporation’s operation. \n• Manage agencies to register and get licenses of intellectual properties of Company. Suggest\nsolution to protect Company against any infringement of IP. \n• Liaise with relevant departments to ensure that where legal risks have been identified,\nappropriate courses of action have been taken. \n• Provide legal protection and risk management advice to management and other departments. \n• Provide and interpret legal information, conduct training or update appropriate legal information to\nstaff. \n• Develop in-house law database for users friendly. \n• Develop the relationship with the law firms and agencies for corporation’ activities such as\nlitigation, registering of IP, RO, Subsidiaries in overseas… \nCompliance \n• Review and advise management on legal implications of internal policies and procedures. \n• Review and draft internal policies and ensure that they are in compliance with all statutory or legal\nrequirements. Litigation \n• Review progress of outstanding litigation and liaise with external lawyers during the proceeding to\nprotect for corporation’s rights and benefits.\n9/2015 - 5/2016 : Legal Team Leader - Hoa Sen Group\nHoa Sen Group (183 Nguyen Van Troi, Ward 10, Phu Nhuan District, HCMC) \nHoa Sen Group is the market leader in Vietnam Steel sheet and now broadening in purlin, steel pipe,\nplastic pipe market. Hoa Sen Group has 7 subsidiaries, 4 manufacturing plants managed by the\nparent company, 2 representative offices and over 190 branches across the country. \nResponsibilities: \nLegal \n• Compose, review and revise all contracts entered into by the parent company and subsidiaries,\nespecially in international trade, insurance, shipping… \n• Offer suggestions for company about issues related to enterprise law, labor law, listed company,\ntax, FTA… \n• Updated and research new regulations to guarantee company activities compliance with Vietnam\nLaw and international rule. \n• Build and maintain working relationships with legal agencies. \n• Draft, get feedback, revise and finish important policies of Company such as company charter,\ninternal rules on corporate governance, Proposal and Award Policy … \nOther \n• Support in preparation of General meeting of shareholders, answer the questions of\nshareholders… \n• Support in restructuring of Group. \nOther tasks as assigned. \nReport to: Head of Legislation and Assistance division.\n8/2013 - 9/2015 : Assistant to Legal & Admin Manager - DUY ANH FASHION AND\nCOMESTIC CO., LTD (DAFC), a member of Imex Pan Pacific Group\nDAFC (3rd Floor, Centec Tower, 72-74 Nguyen Thi Minh Khai, Ward 6, District 3, HCMC) is the leading\nluxury fashion distributor in Vietnam, with many of the world’s top brands such as: ROLEX,\nBURBERRY, BVL, CARTIER, S.FERRAGAMO ... DAFC has more than 20 exclusive boutiques operating in\nboth HCMC and Hanoi, all in prime retail locations such as Diamond Plaza, Rex Arcade, Trang Tien\nPlaza, Lotte Hanoi. \nResponsibilities: \nLegal \n• Draft and prepare contracts and other legal documents related to company activities. \n• Review, negotiate, advise and amend all contracts entered into by company such as leasing\ncontract, construction contract, franchising… Tracking contract’s implements. \n• Keep company updated with Vietnam Laws, particularly in the areas of commercial law,\ninternational law, labor law, taxation, foreign investment law. \n• Research the law pertaining to company business and consult for BOD when assigned. \n• Submit and follow up submissions for licenses, approvals of company to Authorities. \n• Establish and maintain relationships with Authorities, legal agencies. \n• Other duties reasonably assigned by BOD \nAdmin & Project management \n• Follow up the progress of company’s projects, guarantee the implements of contractor abide with\nthe signed contract. \n• Review and check the final settlement for company’s projects. \n• Keep as archives all legal documents, licenses and approvals of company, maintain and organize\nthem in systematic manner. \n• Translate the English version of contracts and legal documents, note the main ideas for BOD. \nReport to: Legal & Admin Manager and Managing Director.\n10/2011 - 7/2013 : Legal staff - GOSU ONLINE CORPORATION\nGOSU (5th Floor, WASECO Tower, 10 Pho Quang St, Tan Binh Dictrict, HCMC) is a publisher and\noperator many popular online games in Vietnam: Age of Wushu, Ngao Kiem Vo Song… Besides that,\nGOSU also has a technology website at gosu.vn. \nReport to: Director of HCM representative office and CEO. \nResponsibilities: \nLegal \n• Compose, check and negotiate contracts with local and international partners. Tracking contracts’\nimplement. \n• Guarantee company’s activities abide by national laws and international rules (labor, commerce,\ncompany…) \n• Update policy of authority related to company’s activities \n• Assist Director in compliance of law in tax, labor management. \n• Consult for Board of Directors about Company Law. \n• Coordinate with administration department to developing regulation, process for business\nactivities. \nBusiness Assistant \n• Assist CEO in preparation and development documents for business and administration. \n• Coordinate with CEO Assistant for communicated network of Company (conference, meeting,\nexhibition…)\n EDUCATION\nHighest Degree Level: Postgraduate\nNo degree - Lawyer Practicing Certificate\nCompletion date 3-2016\nPostgraduate - University of Economics Ho Chi Minh City\nMaster of business Administration\nCompletion date 10-2011\nBachelor - University of Economics Ho Chi Minh City\nBachelor of Business Law\nLê Duy Hiển\n0932822400 / leduyhien0511@gmail.com\nSales Manager\nPhilips Viet Nam\n REFERENCES\n© CareerBuilder.vn", "educations": [{"id": 5118, "gpa": null, "major": "Quản lý đô thị và công trình", "school": "University of Economics Ho Chi Minh City", "diploma": "Masters", "end_time": "2016-03-01T00:00:00Z", "conf_score": 0.8564158551552462, "start_time": null, "picklist_major": "Architecture / Interior Design", "major_categories": "Kiến trúc và xây dựng", "major_categories_detail": "Kiến trúc và quy hoạch"}, {"id": 5117, "gpa": null, "major": "Luật", "school": "University of Economics Ho Chi Minh City", "diploma": "Bachelors", "end_time": null, "conf_score": 0.9538370608867096, "start_time": null, "picklist_major": "Legal", "major_categories": "Pháp luật", "major_categories_detail": "Luật"}], "experiences": [{"id": 17120, "detail": "Trung Nguyen International Corporation (TNI) is established by Madame Le Hoang Diep Thao - the founder and co-owner of Trung Nguyen Coffee Group. With the headquarter and two factories located in Vietnam and other representative offices in Singapore, China, US, Australia, TNI aims to\nYear(s) of Experience: 8 Current Level: Team Leader / Supervisor", "company": "Trung Nguyen International Corporation", "end_time": "2023-04-13T00:00:00Z", "industry": "Other", "position": "Senior Legal & Compliance Executive", "conf_score": 0.9462445267242702, "start_time": "2016-05-01T00:00:00Z"}, {"id": 17122, "detail": "Steel sheet and now broadening in purlin, steel pipe, plastic pipe market. Hoa Sen Group has 7 subsidiaries, 4 manufacturing plants managed by the parent company, 2 representative offices and over 190 branches across the country.\nResponsibilities: Legal • Compose, review and revise all contracts entered into by the parent company and subsidiaries, especially in international trade, insurance, shipping...\n• Offer suggestions for company about issues related to enterprise law, labor law, listed company, tax, FTA... • Updated and research new regulations to guarantee company activities compliance with Vietnam Law and international rule.\n• Build and maintain working relationships with legal agencies.\n• Draft, get feedback, revise and finish important policies of Company such as company charter, internal rules on corporate governance, Proposal and Award Policy ... Other • Support in preparation of General meeting of shareholders, answer the questions of shareholders...\n• Support in restructuring of Group. Other tasks as assigned.\nReport to: Head of Legislation and Assistance division.", "company": "Hoa Sen Group", "end_time": "2016-05-31T00:00:00Z", "industry": "Manufacturing", "position": "Legal Team Leader", "conf_score": 0.9098581407048126, "start_time": "2015-09-01T00:00:00Z"}, {"id": 17124, "detail": "a member of Imex Pan Pacific Group DAFC (3rd Floor, Centec Tower, 72-74 Nguyen Thi Minh Khai, Ward 6, District 3, HCMC) is the leading luxury fashion distributor in Vietnam, with many of the world’s top brands such as: ROLEX, BURBERRY, BVL, CARTIER, S.FERRAGAMO ... DAFC has more than 20 exclusive boutiques operating in both HCMC and Hanoi, all in prime retail locations such as Diamond Plaza, Rex Arcade, Trang Tien Plaza, Lotte Hanoi. Responsibilities: Legal • Draft and prepare contracts and other legal documents related to company activities.\n• Review, negotiate, advise and amend all contracts entered into by company such as leasing contract, construction contract, franchising... Tracking contract’s implements.\n• Keep company updated with Vietnam Laws, particularly in the areas of commercial law, international law, labor law, taxation, foreign investment law.\n• Research the law pertaining to company business and consult for BOD when assigned.\n• Submit and follow up submissions for licenses, approvals of company to Authorities. • Establish and maintain relationships with Authorities, legal agencies.\n• Other duties reasonably assigned by BOD Admin & Project management\n• Follow up the progress of company’s projects, guarantee the implements of contractor abide with the signed contract.\n• Review and check the final settlement for company’s projects.\n• Keep as archives all legal documents, licenses and approvals of company, maintain and organize them in systematic manner.\n• Translate the English version of contracts and legal documents, note the main ideas for BOD. Report to: Legal & Admin Manager and Managing Director.", "company": "DUY ANH FASHION AND COMESTIC CO., LTD (DAFC),", "end_time": "2015-09-30T00:00:00Z", "industry": "Other", "position": "Assistant to Legal & Admin Manager", "conf_score": 0.9264139694127339, "start_time": "2013-08-01T00:00:00Z"}, {"id": 17125, "detail": "GOSU (5th Floor, WASECO Tower, 10 Pho Quang St, Tan Binh Dictrict, HCMC) is a publisher and operator many popular online games in Vietnam: Age of Wushu, Ngao Kiem Vo Song... Besides that,\nGOSU also has a technology website at gosu.vn.\nReport to: Director of HCM representative office and CEO. Responsibilities: Legal • Compose, check and negotiate contracts with local and international partners. Tracking contracts’ implement.\n• Guarantee company’s activities abide by national laws and international rules (labor, commerce, company...)\n• Update policy of authority related to company’s activities\n• Assist Director in compliance of law in tax, labor management.\n• Consult for Board of Directors about Company Law. • Coordinate with administration department to developing regulation, process for business activities.", "company": "GOSU ONLINE CORPORATION", "end_time": "2013-07-31T00:00:00Z", "industry": "Other", "position": "Legal staff", "conf_score": 0.9120873957591761, "start_time": "2011-10-01T00:00:00Z"}], "address": "Ward 10, Tan Binh District, Ho"}