{"skills": ["supply chain", "safety system", "team management", "management", "analysis", "finance", "data warehouse", "lighting", "oracle", "leadership skill", "project management", "product management", "wealth management", "marketing", "restructuring", "sales", "balance sheet", "srs", "payment", "negotiation skill", "database", "re engineering", "banking", "excel", "crm", "implementation", "risk management", "erp system", "inventory management", "due diligence", "communication skill", "risks"], "fulltext": "1 \nLê Vũ Bằng - Master in Banking & Finance \nof CFVG, France. \nDOB: July 30th 1984.  \nAdd: E16 Road 4, Tân Sơn Nhì Ward, Tân Phú \nDistrict, Hồ Chí Minh, Việt Nam \nMB:  \nEmail:  \nCAREER OBJECTIVE \nVision: to be a business leader of a global corporation. \nMission: to be a kind person, to have a decent family, to contribute on business, to share \nand develop others.  \nHONORS AND AWARDS \nWinning Best employee prize in 2015, 2018 at Sacombank \nWinning Star of the Year 2010, British American Tobacco  \nJul 2009 - Jun 2010, wining scholarship from Institute of Potential Leader (IPL) \nGet a scholarship of a leadership & business training course for 9 months, from Institute of \nPotential Leader (IPL) Program, established by the first-rate VN business community & top \nleading Vietnamese scholars & operated by PACE Education Organization \nFor more information, please vist http://www.ipl.edu.vn/  \nOct 2006, wining bronze prize in Lighting Young Business Talent Competition - organized by \nVTV3 & Viet Nam Young Entrepreneurs Organization in Ha Noi. \nWORKING EXPERIENCE \nMarch 2011 – Present, Sacombank, Product Manager of Service & Wealth Management Product \n \nManaging product line from strategy into action of international banking remittance \nservice by coordinating the planning/forecasting process. \n \nBeing a key member of Sacombank in Due Diligence & world-wide customer \nmanagement team with international partners to develop & deploy service products \n(of internation payment & inward remittance). \n \nProject leader of building product project, including managing & defining requirement, \nbuling solution, SRS, UAT, pilot & launching term, focus on API, CRM, T24 Core \nbanking, Fee Core…. project.  \n \nDevelop and manage policy of Wealth management and behavior insight of VVIP.  \n \nDriving a solution & Advisory of Portfolio strategy through market requirements \nincludes product price, market size, share & demand... \n \nDesigning and implement new launched product knowledge training & product \nrefreshing training for Sale Forces & Marketing Teams \n \nMonitoring & Analysing the progress of product financial indicators by reports on \noperations and activities, recommending improvements and modifications. \n2 \n \nPlaning & implement promotion/activity/campaign in Sacombank nationwide’s system \nfor delivering target.  \n \nExploiting customer data warehouse/market survey to improve services frequently. \nSep 2009 – Mar 2011, British American Tobacco (BAT) Vietnam, Senoir Trade Marketing \nExecutive \n \nDevelop & Implement & Evaluate the Channel Marketing Plan to maximize Visibility, \nOff-take Volume by effectively aligning all critical elements of marketing mix to \nachieve the business objectives in strategic Convenience Channel. \n \nPlan & Implement Consumer Engagement Activities and Promotion Programs across \nall regions with optimum use of resources and materials in order to achieve \nConvenience and brand communication objectives. \n \nMaintain a Comprehensive Database of the strategic channels, Competitors’ \nCampaigns in respective region and ensure the appropriate re-action to drive the \nbusiness results. \n \nNegotiate and Management Customized Trading Terms, distribution commitments and \nmarketing services among the Convenience a based on specific needs of the \ncustomers in order to optimize availability, volume and share growth opportunities \n \nDrive continuous improvement in Convenience channel activities and merchandising \nexecutions in order to keep strong Brand Awareness and increased Off-take & Share \nof Voice. \nMar 2008 – Aug 2009, Supply Planning Assistant Manager, Unilever JV Viet Nam   \n \nMPS creation/adjustment by SAP and BPCS (ERP Systems) aligned with finish goods \nstock/Sales report/Forecast/ Category Key Performance Indicators management policy \nand materials status to achieve optimum category performance. \n \nImplement national Distribution Planning with effective cost to fulfill market demand \nand align with inventory management strategy. \n \nBalance Market Demand (company strategy, sales plan, promotion plan, launch/re-\nlaunch project) and Supplied Capacity (factory issues, material, and labor) and risk \nmanagement to ensure FGs available on time. \n \nPre-SOP (Sales and Operation Planning) Report, to analyze & create the balance of \nmarket demand vs. production capacity and propose solutions in constraint period. \n \nCooperation with 3rd-Parties factories as leading position to ensure production plan \ndelivery, Stock-take management, Balance Sheet at monthly closing period & Delivery \nPlan \n \nMaterial inventory management by managing Purchase Order/Stock Level/Delivery \nSchedule/Forecast to align with company \nguideline (stock policy, inventory \nmanagement strategy). \n \nTo be a connection of Supply Team (Manufacturing) & Business Team in management \nsupplied information and market demand. \nAug 2006 to Mar 2008, Supply Planning Officer, Unilever JV Viet Nam   \n \nPlan to supply finish goods for national distribution centers \n \nManage 3rd party in priority for production plan, stock-take, monthly closing data & \ntransferring plan after production \n \nMaintain stock policy & suggest options in risky status \nSKILLS \n \nAnalysing, Planning, Communication, Negotiation, Presentation, Project Management  \n3 \n \nEnglish: Advance level - Fluently both verbal & writing.  \nComputer: Proficiecy in Excel, Word, Power Point & exprierience in other Business \nSolutions (i.e. SAP, Oracle BI, Terminos T24, BPCS,…) \n \nEDUCATION BASIS \n \nOct 2013 – Oct 2015: Master in Banking & Finance of CFVG Institute, France \n \nJul 2009 - Jun 2015: Scholarship from Institute of Potential Leader (IPL), \nincluding 9 months education at PACE Institute of Directors & 5 years implementation \n& records. \n \nSep 2002 – Apr 2007: Engineer of HCMC University of Technology, major in \nIndustrial & System Engineering (Supply Chain Development, Optimization production \nsystem) \nAND MISCELLANIOUS  \n \nFeb 2018: Cerficate of Leadership skill \n \nFeb 2017 Certificate of Coaching Skill \n \nFeb 2015: Certificate of Company Valuation, Sacombank \n \nOct 2013: Certificate of Project Management skills by ERC Training \n \nMay 2012: Certificate of Cooporate Restructuring & Re-engineering by BDSC \nInstitude \n \nJan 2012: Certificate of Emotional Excellence for Innovative Leadership, by IDT \n \nNov 2011: Certificate of Finance Report Analysis, Sacombank \n \nNov 2010: Certificate of Selling Excellence, from Direct Sales Institute, BAT. \n \nJan 2010: Certificate of Negotiation Skills, from Lead Training Education Center. \n \nAug 2009: Certificate of Safety System for Supervisor, from Dupon Corp. \n \nNov 2008: Certificate of Communication Skills, from Lead Training Education Center. \n \nDec 2007: Certificate of Influencing Skills, from CTS Training Center. \n \nAug 2007: Certificate of Basic Coaching Skills, from Lead Training Education Center ", "educations": [{"id": 5135, "gpa": null, "major": "Tài chính – Ngân hàng", "school": "CFVG Institute", "diploma": "Masters", "end_time": "2015-10-01T00:00:00Z", "conf_score": 0.8263227818945743, "start_time": "2013-10-01T00:00:00Z", "picklist_major": "Finance/Investment", "major_categories": "Kinh doanh và quản lý", "major_categories_detail": "Tài chính – Ngân hàng – Bảo hiểm"}, {"id": 5136, "gpa": null, "major": "Kỹ thuật hệ thống công nghiệp", "school": "HCMC University of Technology", "diploma": "Engineer", "end_time": "2007-04-01T00:00:00Z", "conf_score": 0.8613163236104684, "start_time": "2002-09-01T00:00:00Z", "picklist_major": "Technical", "major_categories": "Kỹ thuật", "major_categories_detail": "Kỹ thuật cơ khí và cơ kỹ thuật"}], "experiences": [{"id": 17178, "detail": "Managing product line from strategy into action of international banking remittance service by coordinating the planning/forecasting process.\nBeing a key member of Sacombank in Due Diligence & world-wide customer management team with international partners to develop & deploy service products (of internation payment & inward remittance).\nProject leader of building product project, including managing & defining requirement, buling solution, SRS, UAT, pilot & launching term, focus on API, CRM, T24 Core banking, Fee Core.... project.\nDevelop and manage policy of Wealth management and behavior insight of VVIP. Driving a solution & Advisory of Portfolio strategy through market requirements includes product price, market size, share & demand...\nDesigning and implement new launched product knowledge training & product refreshing training for Sale Forces & Marketing Teams Monitoring & Analysing the progress of product financial indicators by reports on operations and activities, recommending improvements and modifications.", "company": "Sacombank", "end_time": "2023-04-13T00:00:00Z", "industry": "Banking", "position": "Product Manager of Service & Wealth Management Product", "conf_score": 0.9219244899197291, "start_time": "2011-03-01T00:00:00Z"}], "address": "E16 Road 4, Tân Sơn Nhì Ward, Tân Phú District, Hồ Chí Minh, Việt Nam"}