{"skills": ["stack", "aws", "angular", "workflow", "css3", "json", "javascript", "etl process", "ams", "c#", "xml", "management", "studio", "written communication skill", "security", "administration", "sql database", "enterprise", "entity framework", "window 7", "etl", "maintenance process", "svn", "html5", "ajax", "operating system", "business requirement", "vendor management", "maintenance", "management tool", "asp", "solidworks", "sql", "procurement", "design pattern", "oop", "written communication", "visual studio", "unit testing", "testing", "mvc", "microsoft", "communication skill", "oracle", "database", "sql query", "navigation", "wcf", "manual testing", "problem solving", "full stack development", "window operating system", "m sql server", "procurement management", "jquery", "scripting"], "fulltext": "THANH DOAN \nPERSONAL DETAILS \n Name  \nDoan Minh Thanh \n Gender \nMale \n Email  \n Phone  \nPROFESSIONAL SUMMARY \n 8 years of Experience in .NET and Web Application development.  \n Good Knowledge and Experience in C# .NET, ASP.NET, ADO.NET, SQL Server, AJAX, XML, \nJSON, MVC, Javascript, jQuery, Entity Framework. \n Experience in writing Database objects (Stored Procedures, Functions). \n Experience in writing SQL queries. \n Experience in  SharePoint Administrator and SharePoint Powershell Scripting. \n Experience in  SharePoint Development via .Net Visual Studio. \n Ability to work as a team member or as an individual and confident in serving the best \nresults \n Possess good verbal and written communication skills. \n Excellent analytical, problem solving, technical, interpersonal, and communication skills. \nTECHNICAL SKILLS \n Web Technologies: ASP.NET, JavaScript, HTML5, MVC, SharePoint \n Development, Design Tools: Visual Studio,PhotoShop,Turtoise SVN, TFS. \n Databases: MS SQL Server, Oracle \n Operating Systems: Windows 7/2008 Server \n Other: OOP, Three Layers, Apose, XML, AJAX, Design Patterns. \nOTHER SKILLS/QUALITIES \nForeign Languages \n English: Upper-intermediate level. \nPersonal Qualities \n Good problem solving and troubleshooting skills. \n Good in managing things.  \n Unmatchable communication skills in written and verbal both. \n Ability to produce best result in pressure situation. \n Skill to work in a team and independently. \n Ability to grasp and learn quickly new technologies. \n Good at self-studying skill. \nDoan Minh Thanh’s CV - Confidential \n1 \nEDUCATIONAL BACKGROUND \n BACHELOR OF GEOGRAPHIC INFORMATION SYSTEM – Nong Lam University – 2011 – HCM \nCity \n Microsoft 70-480 Certificate \nEMPLOYMENT HISTORY \nPeriod \nCompany \nJob Title \nAug 2015 – Present \nFPT Software \nFull-Stack Developer \nAug 2014 – Aug 2015 \nFPT IS GMC \nASP.NET Developer \n2012 –  Aug 2014 \nViet An Environment JSC \nSoftware Engineer \nPROFESSIONAL EXPERIENCE \nMar 2017 - Present \nProject: Financial Company New App Generation \nProject Description: \n Develop new system that using lastest Web technology base on .NET Core for Server \nSide, Angular for Client Side. Hosted by AWS services. \n Develop automate business workflow using lastest SharePoint online features, \nOffice365 data. \n Develop automate BI tool to report the financial data using Tableu server. \n Project focus on business related to Financial field, just as Stock, Share etc… \nProject Size: 12 persons. \nTechnologies Used: Microsoft SharePoint Online Office365, JQuery, HTML5, CSS3, Visual Studio, .NET \n4.6, Microsoft SharePoint Designer, .NET Core, Angular, Tableu Server, AWS Services . \nResponsibilities:  \n \nDevelop, Coding Layout and Function & Unit Testing, Create JavaScript scripts.  \nNov 2016 – Mar 2017 \nProject: Dupont Application Migration \nProject Description: \n Analyze the existing system which build on Lotus Note, then migrate to Microsoft \nOffice 365, via customization Javascript,SharePoint Workfow.  \n Project expand on a lot of field, make existing application become more modern, more \nfriendly. Become an collaboration environment of Dupont company world wide. \nProject Size: 10 persons. \nTechnologies Used: Microsoft SharePoint Online Office365, JQuery, HTML5, CSS3, Visual Studio, .NET \n4.5, Microsoft SharePoint Designer. \nResponsibilities:  \n \nDevelop, Coding Layout and Function & Unit Testing, Create JavaScript scripts.  \nDoan Minh Thanh’s CV - Confidential \n2 \nSep 2016 –  Nov 2016 \nProject: VMR SP Portal \nProject Description: \n The Vendor Management Request SharePoint System (VMR) is the central platform \nwhere the IT domains of RWE Supply & Trading can raise requests for any IT \nrequirements where something needs to be purchased. This is the basis for any further \nconversations with RWE IT or Procurement and later on for a purchase order (PO). A \nrequest  is for the Vendor Management to start with their work/ the next steps.  \n The  Vendor Manager organizes and controls his/her requests on this page and puts \ncomments about the current status in.  \n In addition the SharePoint represents an archive for all project documents, process \ndescriptions and conversations between the domain, Vendor Management, \nProcurement, RWE IT Suppliers budget and financial approvers. It is also possible to \ncreate different reports on this SharePoint. \nProject Size: 5 persons. \nTechnologies Used: Microsoft SharePoint Server 2010, JQuery, HTML5, CSS3, Visual Studio, .NET 4.5, \nMicrosoft SharePoint Designer. \nResponsibilities:  \n \nDevelop, Coding & Unit Testing, Create PowerShell Script.  \nMay 2016 – Sep 2016 \nProject: Structural Integrity Compliance System (SICS) \nProject Description: \n \nStructural Integrity Compliance System (SICS) is an integrity management tool, used for the \nmanagement of underwater assets. The system incorporates customized reporting, existing \ndatabase integration, and simple administration. It also integrate with others external system \nto generate report and program and compile inspection program report. \nProject Size: 9 persons. \nTechnologies Used: Microsoft ASP.NET MVC, JQuery, HTML5, CSS3, Visual Studio, .NET 4.5 \nResponsibilities:   \n \nDevelop, Coding & Unit Testing and intergrated module.  \nMar 2016 – May 2016 \nProject: TISS – Tool Info Suite Service  \nProject Description: \n Provide Services, friendly API, centralize data  for another Applications of Halliburton \nto get Technical Model Files, and Metadata of Tools from Enovia and AMS. \nProject size: 10 persons. \nTechnologies Used: WPF, C#, WCF, MS SQL Database, Caliburn, SolidWorks, MSBuild \nResponsibilities:  \n Develop Web Service, maintain and implement User Stories. \nDoan Minh Thanh’s CV - Confidential \n3 \nJan 2016 – Mar 2016 \nProject: TEMS – HCT Equipment Maintenance  \nProject Description: \n Application to manage oil and gas equipment maintenance process, help user perform \nequipment maintenance throught documents system. \nProject size: 10 persons. \nTechnologies Used: WPF, C#, WCF, MS SQL Database, Caliburn, MEF \nResponsibilities:  \n Develop modules that help Main Application can launch Component through another \nservice by URI. \n Develop Web Service, design UI to fulfil customer User Stories. \n Maintain Build Process to get update information from Build Definition that run on TFS \nBuild Agent.  \nOct 2015 – Jan 2016 \nProject: SPVB (Suntory Pepsico Vietnam Beverage) Promotions And Migration SharePoint \nProject  \nProject Description:  \n \nSPVB website is as integrated solution comprises of the LDMS website, MTO team sites, \nPromotions website. This shall help SPVB users easily to manage and share the documents and \nreports either internally or externally without having issues in the security and sensitivity. \nLDMS currently have 8 workflow process , Promotions have 5 workflow process, which \ninvolved a lot of documents and reports to be analyze before it will produce a set of final \ndocuments called as “LDMS Contracts” and currently it is manage in multiple database or \nlocation. Thus, the key value expected from this system is for it to take over document \nmanagement, and optimizing the value SPVB can provide in its deliverables. \n \nPromotions (Promotions Documents Management System) is a child of LDMS (Leagal \nDocument Management System). \n \nManaging the documents URL from the SharePoint list \n \nSite Collection Administrator need to maintain URL in SharePoint list when there are changes \nin term of document location \n \nUsers are able to mouse-over to the bricks in the IPOCS WebPart, and click on the bricks \n \nURL will redirect to the specified document library, folders, or documents. \n \nManaging content types, metadata and taxonomy, metadata navigation and filter by some \nconditions \n \nMigrate existing system (including Customizations) on SharePoint Server 2010 to new \nProduction Server on SharePoint Server 2013, keep all data and function as SharePoint \nServer 2010. \nProject Size: 15 persons. \nTechnologies Used: Microsoft SharePoint Server 2013, JQuery, HTML5, CSS3, Visual Studio, .NET 4.5 \nResponsibilities:  \n \nDevelop, Coding & Unit Testing, Migrate Module and Data via PowerShell Script.  \nDoan Minh Thanh’s CV - Confidential \n4 \nAug 2015 – Oct 2015 \nProject: TSS - Andromeda -  Equipment Maintenance  \nProject Description: \n Application to manage oil and gas equipment maintenance process, help user perform \nequipment maintenance throught documents system. \nProject size: 10 persons. \nTechnologies Used: WPF, C#, WCF, MS SQL Database, Caliburn, MEF \nResponsibilities:  \n Develop, deployment SSIS package for ETL process, pull data from Oracle SAP \ndatabase. \n Develop Web Service, design UI to fullfil customer User Stories. \n Manual test, develop change request from new customer’s requirement.  \nAug 2014 – Aug 2015 \nProject: Quang Ninh e-Government System \nProject Description: \n \nAn system that serve citizen to register and administrative work \nProject size: 100 persons. \nTechnologies Used: ASP.NET Web Forms, C#, WCF, MS SQL Database, OpenLayer \nResponsibilities:  \n Develop Store Procedure, coding Web Service, design GUI, base on URD and DDD \ndocuments. \n Integrate System, manual test, develop change request from new customer’s \nrequirement.  \n Research and develop Open Source Web GIS (Mapping) for Land Management Module.  \nJan 2012 – Aug 2014 \nProject: Water Distribution Management System \nProject Description: \n \nAn system that help user to manage the current Water Pipe Network, simulating the behaviors \nof the real system on this model. \nProject size: 10 persons. \nTechnologies Used: .NET Windows Forms, C#, MS SQL Database, Oracle, Geodatabase, ArcGIS \nEngine \nResponsibilities:  \n Gathered business requirements, provided database architecture and design prototype  \n Develop water distribution management and modeling system base on ESRI \nTechnology, integrated with Bentley WaterGEMS, perform manual testing.  \n Writing technical document, user guide.  \n Deploying software, technical supporting, training, maintainment develop new feature \nbase on new customer requirements.  \nDoan Minh Thanh’s CV - Confidential \n5 \nINTERESTS AND ACTIVITIES \n Web Mapping. \n Open Source Project/Website \n Playing volleyball, swimming, traveling, listen to music. \nCAREER OBJECTIVES \n My current objective is that I will try my best to achieve a Senior Developer position. I \nwould like to specialize in developing and training all the solutions for enterprise operation \nand personnel training management used Microsoft or OpenSource technology. \n To acquire a challenging career with a solid company utilizing the opportunity to offer \nproven and developing skills within the company.  \nDoan Minh Thanh’s CV - Confidential \n6 ", "educations": [{"id": 5137, "gpa": null, "major": "Hệ thống thông tin", "school": "Nong Lam University", "diploma": "Bachelors", "end_time": "2011-01-01T00:00:00Z", "conf_score": 0.8613163236104684, "start_time": null, "picklist_major": "IT - Hardware/Networking", "major_categories": "Máy tính và công nghệ thông tin", "major_categories_detail": "Máy tính"}], "experiences": [{"id": 17180, "detail": "", "company": "FPT Software", "end_time": "2023-04-13T00:00:00Z", "industry": "High Technology", "position": "Full - Stack Developer", "conf_score": 0.7551834254203837, "start_time": "2015-08-01T00:00:00Z"}, {"id": 17181, "detail": "Nov 2016 - Mar 2017 Project: Dupont Application Migration Project Description: Analyze the existing system which build on Lotus Note, then migrate to Microsoft Office 365, via customization Javascript,SharePoint Workfow. Project expand on a lot of field, make existing application become more modern, more friendly. Become an collaboration environment of Dupont company world wide.\nProject Size: 10 persons.\nTechnologies Used: Microsoft SharePoint Online Office365, JQuery, HTML5, CSS3, Visual Studio, .NET 4.5, Microsoft SharePoint Designer. Responsibilities: Develop, Coding Layout and Function & Unit Testing, Create JavaScript scripts.", "company": "Dupont Application", "end_time": "2017-03-31T00:00:00Z", "industry": "Other", "position": null, "conf_score": 0.8086621310791741, "start_time": "2016-11-01T00:00:00Z"}, {"id": 17182, "detail": "Project Description: The Vendor Management Request SharePoint System (VMR) is the central platform where the IT domains of RWE Supply & Trading can raise requests for any IT requirements where something needs to be purchased. This is the basis for any further conversations with RWE IT or Procurement and later on for a purchase order (PO). A request is for the Vendor Management to start with their work/ the next steps.\nThe Vendor Manager organizes and controls his/her requests on this page and puts comments about the current status in.\nIn addition the SharePoint represents an archive for all project documents, process descriptions and conversations between the domain, Vendor Management, Procurement, RWE IT Suppliers budget and financial approvers. It is also possible to create different reports on this SharePoint. Project Size: 5 persons.\nTechnologies Used: Microsoft SharePoint Server 2010, JQuery, HTML5, CSS3, Visual Studio, .NET 4.5, Microsoft SharePoint Designer. Responsibilities: Develop, Coding & Unit Testing, Create PowerShell Script.", "company": "VMR SP Portal", "end_time": "2016-11-30T00:00:00Z", "industry": "Other", "position": null, "conf_score": 0.8086621310791741, "start_time": "2016-09-01T00:00:00Z"}, {"id": 17183, "detail": "Mar 2016 - May 2016 Project: TISS - Tool Info Suite Service Project Description: Provide Services, friendly API, centralize data for another Applications of Halliburton to get Technical Model Files, and Metadata of Tools from Enovia and AMS. Project size: 10 persons.\nTechnologies Used: WPF, C#, WCF, MS SQL Database, Caliburn, SolidWorks, MSBuild Responsibilities: Develop Web Service, maintain and implement User Stories.", "company": "TISS - Tool Info Suite Service", "end_time": "2016-05-31T00:00:00Z", "industry": "Other", "position": null, "conf_score": 0.8086621310791741, "start_time": "2016-03-01T00:00:00Z"}, {"id": 17184, "detail": "Project Description: Application to manage oil and gas equipment maintenance process, help user perform equipment maintenance throught documents system.\nProject size: 10 persons.\nTechnologies Used: WPF, C#, WCF, MS SQL Database, Caliburn, MEF Responsibilities: Develop modules that help Main Application can launch Component through another service by URI. Develop Web Service, design UI to fulfil customer User Stories. Maintain Build Process to get update information from Build Definition that run on TFS Build Agent.", "company": "TEMS - HCT Equipment Maintenance", "end_time": "2016-03-31T00:00:00Z", "industry": "Other", "position": null, "conf_score": 0.8086621310791741, "start_time": "2016-01-01T00:00:00Z"}, {"id": 17185, "detail": "Project Project Description: SPVB website is as integrated solution comprises of the LDMS website, MTO team sites,\nPromotions website. This shall help SPVB users easily to manage and share the documents and reports either internally or externally without having issues in the security and sensitivity.\nLDMS currently have 8 workflow process , Promotions have 5 workflow process, which involved a lot of documents and reports to be analyze before it will produce a set of final documents called as “LDMS Contracts” and currently it is manage in multiple database or location. Thus, the key value expected from this system is for it to take over document management, and optimizing the value SPVB can provide in its deliverables.\nPromotions (Promotions Documents Management System) is a child of LDMS (Leagal Document Management System). Managing the documents URL from the SharePoint list\nSite Collection Administrator need to maintain URL in SharePoint list when there are changes in term of document location\nUsers are able to mouse-over to the bricks in the IPOCS WebPart, and click on the bricks\nURL will redirect to the specified document library, folders, or documents.\nManaging content types, metadata and taxonomy, metadata navigation and filter by some conditions\nMigrate existing system (including Customizations) on SharePoint Server 2010 to new\nProduction Server on SharePoint Server 2013, keep all data and function as SharePoint Server 2010. Project Size: 15 persons.\nTechnologies Used: Microsoft SharePoint Server 2013, JQuery, HTML5, CSS3, Visual Studio, .NET 4.5 Responsibilities: Develop, Coding & Unit Testing, Migrate Module and Data via PowerShell Script.", "company": "SPVB (Suntory Pepsico Vietnam Beverage) Promotions And Migration SharePoint", "end_time": "2016-01-31T00:00:00Z", "industry": "FMCG", "position": null, "conf_score": 0.8086621310791741, "start_time": "2015-10-01T00:00:00Z"}, {"id": 17186, "detail": "", "company": "FPT IS GMC", "end_time": "2015-08-31T00:00:00Z", "industry": "High Technology", "position": "ASP.NET Developer", "conf_score": 0.7982161229421119, "start_time": "2014-08-01T00:00:00Z"}, {"id": 17187, "detail": "", "company": "Viet An Environment JSC", "end_time": "2014-08-31T00:00:00Z", "industry": "Other", "position": "Software Engineer", "conf_score": 0.7982161229421119, "start_time": "2012-01-01T00:00:00Z"}], "address": null}