{"skills": ["stores management", "chief architect", "eye for detail", "marketing", "solidedge", "manage staff", "futures", "tester", "forums", "sell", "buy", "sales"], "fulltext": "Nguyễn Trà My\n05/10/1991  Nữ \n0972764990  nguyentramy925@gmail.com \nĐội Cấn, Ba Đinh, Hà Nội\n\nMỤC TIÊU NGHỀ NGHIỆP\n- Trau dồi kinh nghiệm, kiến thức, kỹ năng công việc đồng thời học thêm kiến thức về tuyển dụng, quản trị nhân sự,\nluật lao động, chính sách và các kỹ năng đánh giá con người, nghệ thuật dùng người \n- Mục tiêu ngắn hạn : Chủ động tiếp nhận tốt nhiệm vụ tại vị trí chuyên viên tuyển dụng trong thời gian ngắn nhất\nlên kế hoạch và mục tiêu chi tiết cho từng công việc. Hiểu rõ cũng như phát triển và tối ưu hóa các kênh tuyển\ndụng. Tạo được một đội nguồn và chăm sóc làm việc đúng quy trình với năng suất cao để thu hút được nhiều\nnhân tài với chi phí thấp nhất trong thời gian ngắn. \n- Mục tiêu dài hạn: Muốn trở thành phó phòng trong 6 tháng tới và trưởng phòng trong 2 đến 3 năm tới.\nHỌC VẤN\nĐẠI HỌC KINH DOANH VÀ CÔNG NGHỆ HÀ NỘI\nTốt nghiệp loại khá\nCHUYÊN NGÀNH: TÀI CHÍNH - NGÂN\nHÀNG\n10/2009 - 07/2013\nKINH NGHIỆM LÀM VIỆC\nCHUYÊN VIÊN TUYỂN DỤNG\n03/2016 - Hiện tại\nTỔ HỢP CÔNG  NGHÊ GIÁO DỤC TOPICA\n10/2016 - đến nay: Chuyên viên tuyển dụng\n- Liên hệ với các phòng ban khi có đơn hàng tuyển dụng để tìm\nđược ứng viên thích hợp với từng vị trí. Cùng đưa ra tiêu chí ứng\nviên và chấm điểm CV tìm người thích hợp\n- Chủ động tìm kiếm và phát triển nguồn tuyển dụng:\n+ Đăng tin tuyển dụng trên các trang jobsite tuyển dụng và viết bài\ntrên facebook, linkedin diễn đàn,.. \n+ Tìm kiếm CV qua các trang web tuyển dụng:\nvieclam24h,timviecnhanh, myword, topCV,... \n+ Chủ động tìm kiếm và phát triển nguồn, mở rộng kết nối với ứng\nviên. \n- Tham gia tuyển dụng các vi ̣trí: Marketing, sale, quản lý học tập,\njunior developer, tester...\n- Tham gia tuyển dụng các vị chí cao cấp : chuyên gia marketing\nquốc tế, chuyên gia chăm sóc khách hàng quốc tế, kế toán trưởng,\nchuyên gia nhân sự, Senior developer, Future Chief Architect, Future\nChief  Technology office.\n- Tham gia xây dựng và cải tiến quy trình tuyển dụng. Tham gia thiết\nlập mục tiêu, kế hoạch của bộ phận nhân sự.\n- Tổng hợp kết quả tuyển dụng hàng tuần/tháng để có kế hoạch và\nchiến lược phù hợp theo nhu cầu của công ty.\n- Thực hiện các công việc khác theo chỉ đạo của cấp trên\n3/2016 - 9/2016 : chuyên viên tư vấn tuyển sinh Uni\nKỸ NĂNG\nTin học văn phòng\nTiếng Anh\nKỹ năng giao tiếp, thuyết phục\nKỹ năng sử lý tình huống\nKỹ năng làm việc nhóm\nSỞ THÍCH\nDu lịch\nĐọc sách\nNghe nhạc\n- Chủ động liên hệ và tư vấn học viên tiềm năng theo danh sách\nđược cung cấp.\n- Tư vấn và thuyết phục học viên đăng ký theo học chương trình học\nĐại học trực tuyến\n- Tham gia các dự án phát triển năng suất và chất lượng tuyển sinh\nNHÂN VIÊN KINH DOANH\n5/2015 - 04/2016\nCÔNG TY HDSAISON\n- Chủ động tiếp xúc khách hàng, giới thiệu sản phẩm tài chính của\nHDSAISON đến cho khách hàng và đại lý.\n- Hướng dẫn khách hàng cung cấp các giấy tờ cần thiết & làm thủ\ntục theo quy định\n- Nhập liệu thông tin khách hàng vào hệ thống dữ liệu công ty  sau\ntheo dõi & thông báo kết quả hồ sơ đến khách hàng\n- Kiểm tra cẩn thận tất cả các giấy tờ cần thiết trước khi chuyển về\ncho Bộ phận Nghiệp vụ tại công ty.\n- Quản lý các trang thiết bị vật dụng tại Điểm giao dịch và giữ mối\nquan hệ tốt với Đại lý\n- Chủ động giải quyết và thông báo cho cấp quản lý các vấn đề phát\nsinh\n- Thực hiện các báo cáo hàng ngày/ tuần hoặc định kỳ theo quy định\nPG\n12/2013 - 04/2015\nCÔNG TY TNHH MỘT THÀNH VIÊN KỸ THUẬT VÀ KHOA HỌC\nOPPO\n- Chịu trách nhiệm quản lý doanh số và hình ảnh OPPO tại các cửa\nhàng được giao\n- Xây dựng mối quan hệ mật thiết với cửa hàng ( Quản lý, nhân viên\nbán hàng)\n- Giải quyết các vấn đề liên quan đến hoạt động mua bán, trưng bày,\nkhuyến mãi của OPPO với cửa hàng\n- Sử dụng các công cụ và các mối quan hệ để thúc đẩy cửa hàng\ntăng cường mua vào và bán ra các dòng điện thoại Oppo\n© topcv.vn", "educations": [{"id": 5147, "gpa": null, "major": "Tài chính – Ngân hàng", "school": "ĐẠI HỌC KINH DOANH VÀ CÔNG NGHỆ HÀ NỘI", "diploma": "Bachelors", "end_time": "2013-07-01T00:00:00Z", "conf_score": 0.9169645786863446, "start_time": "2009-10-01T00:00:00Z", "picklist_major": "Finance/Investment", "major_categories": "Kinh doanh và quản lý", "major_categories_detail": "Tài chính – Ngân hàng – Bảo hiểm"}], "experiences": [{"id": 17213, "detail": "", "company": "TỔ HỢP CÔNG NGHÊ GIÁO DỤC TOPICA", "end_time": "2023-04-13T00:00:00Z", "industry": "Education", "position": "CHUYÊN VIÊN TUYỂN DỤNG", "conf_score": 0.8888931379457348, "start_time": "2016-03-01T00:00:00Z"}, {"id": 17214, "detail": "- Chủ động liên hệ và tư vấn học viên tiềm năng theo danh sách được cung cấp.\n- Tư vấn và thuyết phục học viên đăng ký theo học chương trình học\nĐại học trực tuyến\n- Tham gia các dự án phát triển năng suất và chất lượng tuyển sinh", "company": "Uni", "end_time": "2016-09-30T00:00:00Z", "industry": "Other", "position": "chuyên viên tư vấn tuyển sinh", "conf_score": 0.8384022261982151, "start_time": "2016-03-01T00:00:00Z"}, {"id": 17215, "detail": "- Chủ động tiếp xúc khách hàng, giới thiệu sản phẩm tài chính của\nHDSAISON đến cho khách hàng và đại lý.\n- Hướng dẫn khách hàng cung cấp các giấy tờ cần thiết & làm thủ tục theo quy định\n- Nhập liệu thông tin khách hàng vào hệ thống dữ liệu công ty sau theo dõi & thông báo kết quả hồ sơ đến khách hàng\n- Kiểm tra cẩn thận tất cả các giấy tờ cần thiết trước khi chuyển về cho Bộ phận Nghiệp vụ tại công ty.\n- Quản lý các trang thiết bị vật dụng tại Điểm giao dịch và giữ mối quan hệ tốt với Đại lý\n- Chủ động giải quyết và thông báo cho cấp quản lý các vấn đề phát sinh\n- Thực hiện các báo cáo hàng ngày/ tuần hoặc định kỳ theo quy định", "company": "CÔNG TY HDSAISON", "end_time": "2016-04-30T00:00:00Z", "industry": "Other", "position": "NHÂN VIÊN KINH DOANH", "conf_score": 0.9335768949098548, "start_time": "2015-05-01T00:00:00Z"}, {"id": 17216, "detail": "- Chịu trách nhiệm quản lý doanh số và hình ảnh OPPO tại các cửa hàng được giao\n- Xây dựng mối quan hệ mật thiết với cửa hàng ( Quản lý, nhân viên bán hàng)\n- Giải quyết các vấn đề liên quan đến hoạt động mua bán, trưng bày, khuyến mãi của OPPO với cửa hàng\n- Sử dụng các công cụ và các mối quan hệ để thúc đẩy cửa hàng tăng cường mua vào và bán ra các dòng điện thoại Oppo", "company": "CÔNG TY TNHH MỘT THÀNH VIÊN KỸ THUẬT VÀ KHOA HỌC OPPO", "end_time": "2015-04-30T00:00:00Z", "industry": "Science", "position": null, "conf_score": 0.7334530749718071, "start_time": "2013-12-01T00:00:00Z"}], "address": "Đội Cấn, Ba Đinh, Hà Nội"}