{"skills": ["futures", "management", "networking", "problem solving"], "fulltext": "LÊ VĂN TIẾN PHÁT \nlevantienphat1289@gmail.com | Mobile: (+84) 36 323 6001 |  \nDistrict 1, Ho Chi Minh, Vietnam  \nSUMMARY \n• Two years’ experience working in \nproject / program managing roles \n• Basic knowledge of Management \nTools \n• Project Executive  \n• Event Oriented/Organization \n• Problem-solving and Personal Assistant \n• Stakeholders Communication \nEDUCATION \nUNIVERSITY OF SCIENCE, VIETNAM NATIONAL UNIVERSITY HO CHI MINH CITY - 2013 – 2017 \n• Major: Environmental Science and Management \nWORK EXPERIENCES   \nProject Coordinator – The Open House (Toong Coworking Space) – Feb 2019 – Now \nWork closely with the General Managel and Business Development Manager to executive several projects. \n• Manage project correspondence, price tender, drawings, generate scopes of work base on division, \naward contracts, create schedules, maintain quality of work, and project financial allocation which \nis up to $600K \n• Coordinate experts of landowners, Interior fit out companies, Contractor to meet requirements and \nkey deadlines. \n• Assist General Manager and Business Development Manager in numerous tasks to accomplish the \ncritical commission. \nProject officer – Center of Hands on Actions and Networking for Growth and Environment (CHANGE) – \nOct 2017 – Feb 2019 \nWorking under the Project Manager of the Climate Change Department to several executive projects in \ndifferent fields. \n• Organize the youth training course, named “Vietnam Climate Leadership Camp” which nearly 80 \nparticipants from several provinces in Viet Nam about environmental knowledge and soft skills. \n• Working with suppliers/ partners/ allies and volunteers to implement fruitful projects such as event, \nworkshop, competitions, training. \n• Assist Project Manager in numerous reasonable tasks to accomplish the routine basis. \nInternship / Assistant Project Manager - Center of Hands-on Actions and Networking for Growth and \nEnvironment (CHANGE) - Jul 2016 – Nov 2016.  \nThe project is informing the general public about ongoing environmental and social hazards at Vinh Tan 2 \ncoal plant in Vietnam.   \n• Coordinated the research and production of communication documentaries.  \n• Evaluate the pollution through the collected data and create the report. \n• Work with the community to spread the story about the impact of a thermal power plant \nVietnam Recycles Project, Reverse Logistics Group Vietnam - Mar 2017 – June 2017.  \nVietnam Recycles is run by the Vietnam Recycling Platform (VRP), a consortium of leading producers of \nelectrical and electronic equipment founded to reduce electronic waste. \nAssistant Project Director \n• Take main and direct responsibilities of supervising and evaluating the quality of Collection Point.    \n• Coordinated with worker to maintain the facilities of collection point.  \n• Report the service, personnel, infrastructure, user’ experiences in the site \nEXTRACURRICULAR ACTIVITIES \nFacilitator - Civil society meets renewable energy and energy efficiency (E-Enhance) - GreenID Vietnam & \nEU - Nov 2018 – Now. \n• Collaborate and facilitate the training for rural citizen about using Renewable Energy \n• Working with stakeholders and government departments to hold, collect, organize the participants \nfor the training.   \nPresident - Green Club, Faculty of Environment-University of Science - Nov 2013 – Aug 2016. \n• Lead, oriented and organize club which has 30 members \n• Working with partners and stakeholders to host events. \nHead of Organization Department - \"Climate change and our action\" Contest - Respond \"UN Climate \nChange Conference - COP21”, Green Generation Network, Live & Learn Viet Nam – Nov 2015.  \n• Managed the core team to organize the activities of the event.  \n• Coordinated the stakeholders and production of contest content \nOTHERS \n“East Asia Climate Leadership Camp (EACLC)” Program, 350.org East Asia – Nov 2018. \nThe program is established to serve as part of the East Asia Climate Leadership Program, which will be an \noffline training opportunity for partners in the region to learn and exchange campaign ideas to each other. \n“Sakura Exchange Program in Science 2017” Program, Japan Science and Technology Agency (JST) – Aug \n2017. \nThe program enhances exchanges between Asia and Japan of the youths who will play a crucial role in the \nfuture field of science and technology by facilitating short-term visits to Japan. \n “Be Change Agents” Training, Living and Learning Center for Environment and Community (LIVE & \nLEARN) – Sep 2014  \nThe program promotes the change agent role of young people in Vietnam for Understanding and Action for \nsustainable development and good Management \nREFERENCES \nMs. Nguyen Duc Hanh \nMr. Nguyen Dai Dung \n• Email: nguyenduchanh2289@gmail.com \n• Phone: 0988302483 \n• Email: Ngddung253@gmail.com \n• Phone: 0902468020 ", "educations": [{"id": 5172, "gpa": null, "major": "Khoa học quản lý", "school": "UNIVERSITY OF SCIENCE, VIETNAM NATIONAL UNIVERSITY HO CHI MINH CITY", "diploma": "Bachelors", "end_time": "2017-01-01T00:00:00Z", "conf_score": 0.9104963430749222, "start_time": "2013-01-01T00:00:00Z", "picklist_major": "Administrative/Clerical", "major_categories": "Kinh doanh và quản lý", "major_categories_detail": "Quản trị – Quản lý"}], "experiences": [{"id": 17300, "detail": "Work closely with the General Managel and Business Development Manager to executive several projects.\n• Manage project correspondence, price tender, drawings, generate scopes of work base on division, award contracts, create schedules, maintain quality of work, and project financial allocation which is up to $600K • Coordinate experts of landowners, Interior fit out companies, Contractor to meet requirements and key deadlines.\n• Assist General Manager and Business Development Manager in numerous tasks to accomplish the critical commission.", "company": "The Open House (Toong Coworking Space)", "end_time": "2023-04-13T00:00:00Z", "industry": "Other", "position": "Project Coordinator", "conf_score": 0.9089868123963978, "start_time": "2019-02-01T00:00:00Z"}, {"id": 17301, "detail": "Working under the Project Manager of the Climate Change Department to several executive projects in different fields.\n• Organize the youth training course, named “Vietnam Climate Leadership Camp” which nearly 80 participants from several provinces in Viet Nam about environmental knowledge and soft skills.\n• Working with suppliers/ partners/ allies and volunteers to implement fruitful projects such as event, workshop, competitions, training.\n• Assist Project Manager in numerous reasonable tasks to accomplish the routine basis.", "company": "Center of Hands on Actions and Networking for Growth and Environment (CHANGE)", "end_time": "2019-02-28T00:00:00Z", "industry": "High Technology", "position": "Project officer", "conf_score": 0.9089868123963978, "start_time": "2017-10-01T00:00:00Z"}, {"id": 17302, "detail": "• Take main and direct responsibilities of supervising and evaluating the quality of Collection Point. • Coordinated with worker to maintain the facilities of collection point.\n• Report the service, personnel, infrastructure, user’ experiences in the site", "company": "Reverse Logistics Group Vietnam", "end_time": "2017-06-30T00:00:00Z", "industry": "Transportation & Logistics", "position": "Assistant Project Director", "conf_score": 0.8925785995197242, "start_time": "2017-03-01T00:00:00Z"}, {"id": 17303, "detail": "he project is informing the general public about ongoing environmental and social hazards at Vinh Tan 2 coal plant in Vietnam. • Coordinated the research and production of communication documentaries.\n• Evaluate the pollution through the collected data and create the report.\n• Work with the community to spread the story about the impact of a thermal power plant", "company": "Center of Hands - on Actions and Networking for Growth and Environment (CHANGE)", "end_time": "2016-11-30T00:00:00Z", "industry": "High Technology", "position": "Internship / Assistant Project Manager", "conf_score": 0.9089868123963978, "start_time": "2016-07-01T00:00:00Z"}], "address": "District 1, Ho Chi Minh, Vietnam"}