{"skills": ["administration", "analysis", "wheat", "internet", "interpersonal skill", "self learning", "information exchange", "bidding", "mechanical engineering", "data analysis", "leadership skill", "problem solving", "blitz", "lean six sigma", "making decision", "industrial engineering", "marketing", "sales", "six sigma", "commodities", "cost management", "excel", "corporate governance", "quality management", "teamwork", "lean", "corn", "dmaic", "strategic thinking", "management", "communication skill", "risks"], "fulltext": "       RALPH THAI \nDate of Birth \nMar 20, 1991 \nAddress \nVinh Loc A Commune, Binh Chanh District, Ho Chi Minh City, Viet Nam  \nEmail  thanhcuong.thai@gmail.com \nMobile  +84901185659 \nSkype  Thanhcuong.thai \nLinkedin  https://vn.linkedin.com/in/cuong-thai-084762ab \ns \nCAREER OBJECTIVE \nTaking challenges where I can demonstrate and enhance my abilities, skills, connections and market \nknowledge to efficiently complete multiple assignments: Sales, marketing, organization, negotiation, \nproactive problem solving, and enthusiasm in establishing effective working relationships for increasing \nmarket share and the success of organization. \nPROFESSIONAL EXPERIENCES \n09/2016 – Now \n Grain Trader/broker (at Harvest Commodities): \nDevelop and expand grain, feed materials business (Wheat, Corn, DDGS, Canola Meal,…) and cashew nuts: \n Develop and expand feed materials business for many International Traders: keep approaching new \nCustomers for the business, discuss with Traders on the sale plans, suggest new trade opportunities \nand product development. \n Developing Objectives and Strategies: Establishing long-range objectives and specifying the \nstrategies and actions to achieve them. \n Responsible for Sales: Follow the Customer’s demand, price targets and the sources from \nInternational Traders to execute the sales. \n Manage Customer, Suppliers relationships: Be the middle man to comply Customer expectations \nand Supplier’s best acceptance.  \n Ensure optimal Buyers satisfaction: by sharing with/consulting Customers about market \ninformation/insights, market trend, market fundamentals of both local and CNF. \n Selling or Influencing Others: Influence Customers to buy merchandise/goods or to otherwise \nchange their minds or actions, create the demand. Convince Supplier to aggressive in sales. \n Responsible for handling of Buyer’s commercial issues/complaints. \n Market, information, data, trend analysis: Closely observe international and local market \ninformation to take the advantages in sale opportunities or risk assessment. \n Self-learning: Keep tracking of the results and take corrective action plans, actions. \n Contributes to continuously improve the marketing plan: Improve the marketing plan to approach to \nnew Customers, and strengthen the relationship with exist Customers. Visits existing as well as \npotential Customers. \n Making Decisions and Solving Problems: Analyzing information and evaluating results to choose \nthe best solution and solve problems. \n Interpersonal Relationships: Establishing and Maintaining Interpersonal by communicating with \nCustomers and Suppliers.  \n Organizing, Planning, and Prioritizing Work: Developing specific goals and plans to prioritize, \norganize, and accomplish the work. \n Information exchange, planning within the team. \n Loading, shipping, quality checking, report (for Cashew Kernel) \n Business Staff at Itochu Vietnam: \nAssisting Section Manager (SM) for purchasing and sales coordination of the products (woodchip) in \nVietnam: \n Business support: Update, analyze market information, price trend, supply and deploy the reports. \n Ensure the quality in accordance with Customer’s quality requirements: Supplier’s factories \nchecking, defects analysis, improvement plans propose/following. \n Delivery operation smoothly: Work with suppliers and staffs from Head Office for all shipment \npreparations. Self planning/arranging to attend ship loading, visit Suppliers. \n Planning, arranging Customer’s visits. \n Take the responsibilities of the South and the Middle market. \n To be in charge of: GSAP system and Paper section \n Team work: working with colleagues in Hanoi office, HCM office, and overseas office for all \nshipment readiness. \n  Head of Workcell Production Supervisor at Jabil Vietnam: \n Head of Sierra Wireless Workcell Production: Leaded Manufacturing from start-up to sustaining \nmanufacturing excellence emphasizing the principals of safety, quality, productivity. \n Management: Motivating, coaching, and disciplining Production team and activities to ensure \nsmoothly continuous running with high performance of quality, productivity, revenue from start-up \nto more than 1.5 million. \n Demonstrate commitment to customer: Anticipates, meets and exceeds customer’s customizations \nand highly achieve all OTD with 10 working months. \n Give technical expertise: Working with the various teams on maximizing machine capacity and \nplanning efficiency, utilizing manpower and standardize work environment.  \n11/2014- 10/2015 \n04/2016- 09/2016 \n Accomplishes manufacturing staff results by communicating job expectations: planning, allocating \npersonnel, monitoring and appraising job results. \n Team working: Initiating and fostering a spirit of cooperation within and between departments. \n Monitor and enhance Production performance by reviewing and creating Production reports. \n Cost management: Continuous improve to save cost for Workcell by reducing defects, scrap… \n Taking over 3 shifts of the biggest Workcell (Ingenico Workcell): Possess proven tracking records to \nmonitor New Procducts, Quality, productivity, Supervisor’s performance. \n To be in charge of: New Product Introduction, quality, productivity, Work In Process control, and \nrelated Projects. \n Followed to ensure Production Supervisors and Supervisors in Training are working effectively in \ntheir roles. \n Set expectations and guide the Production Supervisors to meet the expectations of continuous \nimprovement. \n Training/ Activate New Leaders. New leader was the best employee. \n Directly report to Top Managers. Daily, Weekly, monthly report to Managers. \n EIT-Production Supervisor at Jabil Vietnam:  \nExecuted all manufacturing and relevant departments scopes as a Manufacturing support team member.  \n Human management: Supervised 140 employees. \n Create Production procedures and training materials. \n Plan achievement: Execute the daily production to ensure products are delivered on time and resolve any \nproduction issues. \n Improve production activities, ensure a proper process quality management: Organizes the lines for \nmaximum efficiency, seek continued improvement in lowering line and plant defects per million (DPM). \n Keep improving on manufacturing by doing Blitz, A3, and DMAIC projects. \n Data analysis: Resolving problems by gathering, analyzing manufacturing reports (yield, scrap, \ndowntime, Quick Respond Quality Control, and Overall Labor Efficiency data); investigating issues; \nidentifying solutions and recommending actions to maximize productivity. \n Mastering in creating professional manufacturing report by using MS Office to figure out manufacturing \nissues and propose the improvement plans. \n Project team leader: Taking lead in applying new changes and systems for HCM site (Shop Floor \nMonitor, E-Pull…). Leading other teams in HCM site to improve manufacturing processes, and deploy \nNew Products Introduction.  \n Bidding vendor team leaders: Involve in Bidding process, quality checking… \n11/2013–11/2014 \nSKILLS \n Strong communication skills \n Interpersonal skill with high ability to convince, and negotiate \n Customer segmentation understanding. \n Knowledge of export / import. \n Management skills: Strong strategic thinking, flexible, good problem/conflict solving ability, decision \nmaking skills, effective team working as well as individual working. \n Self-learning: Keep the eager to learn and create the ambitiousness to improve myself. \n Strong motivational and leadership skills. \n Computer skills: SAP, MS (word, excel, Power Point …), internet savvy. \nCAPABILITIES \n Highly motivated, fast-learner and eager to learn new things. \n Excellent communication skills in written and verbal. \n Sense of responsibility, carefulness in working, strong analytical and organizational,  \n Team working: Contributes to success of whole team by accomplishing related results, constructive \nfeedback, willing to share knowledge and experiences with peers.  \n Quick adaptability and able to work well independently or teamwork even under high pressure. \nEDUCATIONAL BACKGROUNDS \n Bachelor of Industrial Engineering. Faculty of mechanical engineering – Ho Chi \nMinh city University of Technology and Education. \n Studied 8 additional subjects of Business Administration in University of \nEconomics Ho Chi Minh city: Marketing, Management, Quality management, corporate governance,... \n09/2009 - 09/2013 \n09/2015 – 04/2016 \nCERTIFICATION \nLEAN Six Sigma – Bronze Certified: From Jul 17-2015 to Jul 17-2018 \nEXTRA CURRICULAR ACTIVITIES \n Take part in support for University Entrance Exam (2011). \n Being officer the examination at The University of Technical Education HCM City. \n Part time for my lecturer in interior decoration field as his assistant. ", "educations": [{"id": 5182, "gpa": null, "major": "Kỹ thuật cơ khí", "school": "Ho Chi Minh city University of Technology and Education", "diploma": "Bachelors", "end_time": "2013-09-01T00:00:00Z", "conf_score": 0.8381705469392253, "start_time": "2009-09-01T00:00:00Z", "picklist_major": "Technical", "major_categories": "Kỹ thuật", "major_categories_detail": "Kỹ thuật cơ khí và cơ kỹ thuật"}, {"id": 5183, "gpa": null, "major": "Quản lý đô thị và công trình", "school": "University of Economics Ho Chi Minh city", "diploma": "Bachelors", "end_time": "2016-04-01T00:00:00Z", "conf_score": 0.9007656883663064, "start_time": "2015-09-01T00:00:00Z", "picklist_major": "Architecture / Interior Design", "major_categories": "Kiến trúc và xây dựng", "major_categories_detail": "Kiến trúc và quy hoạch"}], "experiences": [{"id": 17327, "detail": "): Develop and expand grain, feed materials business (Wheat, Corn, DDGS, Canola Meal,...) and cashew nuts:\nDevelop and expand feed materials business for many International Traders: keep approaching new\nCustomers for the business, discuss with Traders on the sale plans, suggest new trade opportunities and product development.\nDeveloping Objectives and Strategies: Establishing long-range objectives and specifying the strategies and actions to achieve them.\nResponsible for Sales: Follow the Customer’s demand, price targets and the sources from\nInternational Traders to execute the sales.\nManage Customer, Suppliers relationships: Be the middle man to comply Customer expectations and Supplier’s best acceptance.\nEnsure optimal Buyers satisfaction: by sharing with/consulting Customers about market information/insights, market trend, market fundamentals of both local and CNF. Selling or Influencing Others: Influence Customers to buy merchandise/goods or to otherwise change their minds or actions, create the demand. Convince Supplier to aggressive in sales.\nResponsible for handling of Buyer’s commercial issues/complaints.\nMarket, information, data, trend analysis: Closely observe international and local market information to take the advantages in sale opportunities or risk assessment.\nSelf-learning: Keep tracking of the results and take corrective action plans, actions.\nContributes to continuously improve the marketing plan: Improve the marketing plan to approach to new Customers, and strengthen the relationship with exist Customers. Visits existing as well as potential Customers. Making Decisions and Solving Problems: Analyzing information and evaluating results to choose the best solution and solve problems.\nInterpersonal Relationships: Establishing and Maintaining Interpersonal by communicating with\nCustomers and Suppliers. Organizing, Planning, and Prioritizing Work: Developing specific goals and plans to prioritize, organize, and accomplish the work.\nInformation exchange, planning within the team.\nLoading, shipping, quality checking, report (for Cashew Kernel)", "company": "Harvest Commodities", "end_time": "2023-04-13T00:00:00Z", "industry": "Other", "position": "Grain Trader/broker", "conf_score": 0.9174648511369632, "start_time": "2016-09-01T00:00:00Z"}, {"id": 17330, "detail": ": Assisting Section Manager (SM) for purchasing and sales coordination of the products (woodchip) in\nVietnam: Business support: Update, analyze market information, price trend, supply and deploy the reports.\nEnsure the quality in accordance with Customer’s quality requirements: Supplier’s factories checking, defects analysis, improvement plans propose/following.\nDelivery operation smoothly: Work with suppliers and staffs from Head Office for all shipment preparations. Self planning/arranging to attend ship loading, visit Suppliers. Planning, arranging Customer’s visits.\nTake the responsibilities of the South and the Middle market.\nTo be in charge of: GSAP system and Paper section\nTeam work: working with colleagues in Hanoi office, HCM office, and overseas office for all shipment readiness.", "company": "Itochu Vietnam", "end_time": "2016-09-30T00:00:00Z", "industry": "Other", "position": "Business Staff", "conf_score": 0.9380559850414887, "start_time": "2016-04-01T00:00:00Z"}, {"id": 17333, "detail": ": Head of Sierra Wireless Workcell Production: Leaded Manufacturing from start-up to sustaining manufacturing excellence emphasizing the principals of safety, quality, productivity.\nManagement: Motivating, coaching, and disciplining Production team and activities to ensure smoothly continuous running with high performance of quality, productivity, revenue from start-up to more than 1.5 million.\nDemonstrate commitment to customer: Anticipates, meets and exceeds customer’s customizations and highly achieve all OTD with 10 working months.\nGive technical expertise: Working with the various teams on maximizing machine capacity and planning efficiency, utilizing manpower and standardize work environment.\n11/2 Accomplishes manufacturing staff results by communicating job expectations: planning, allocating personnel, monitoring and appraising job results.\nTeam working: Initiating and fostering a spirit of cooperation within and between departments.\nMonitor and enhance Production performance by reviewing and creating Production reports.\nCost management: Continuous improve to save cost for Workcell by reducing defects, scrap...\nTaking over 3 shifts of the biggest Workcell (Ingenico Workcell): Possess proven tracking records to monitor New Procducts, Quality, productivity, Supervisor’s performance.\nTo be in charge of: New Product Introduction, quality, productivity, Work In Process control, and related Projects. Followed to ensure Production Supervisors and Supervisors in Training are working effectively in their roles.\nSet expectations and guide the Production Supervisors to meet the expectations of continuous improvement.\nTraining/ Activate New Leaders. New leader was the best employee.\nDirectly report to Top Managers. Daily, Weekly, monthly report to Managers.", "company": "Jabil Vietnam", "end_time": "2015-10-31T00:00:00Z", "industry": "Other", "position": "Head of Workcell Production Supervisor", "conf_score": 0.9125776658202421, "start_time": "2014-11-01T00:00:00Z"}, {"id": 17335, "detail": "Executed all manufacturing and relevant departments scopes as a Manufacturing support team member.\nHuman management: Supervised 140 employees.\nCreate Production procedures and training materials.\nPlan achievement: Execute the daily production to ensure products are delivered on time and resolve any production issues.\nImprove production activities, ensure a proper process quality management: Organizes the lines for maximum efficiency, seek continued improvement in lowering line and plant defects per million (DPM). Keep improving on manufacturing by doing Blitz, A3, and DMAIC projects.\nData analysis: Resolving problems by gathering, analyzing manufacturing reports (yield, scrap, downtime, Quick Respond Quality Control, and Overall Labor Efficiency data); investigating issues; identifying solutions and recommending actions to maximize productivity.\nMastering in creating professional manufacturing report by using MS Office to figure out manufacturing issues and propose the improvement plans.\nPr", "company": "Jabil Vietnam", "end_time": "2014-11-30T00:00:00Z", "industry": "Other", "position": "Production Supervisor", "conf_score": 0.9416426740117372, "start_time": "2013-11-01T00:00:00Z"}], "address": "Vinh Loc A Commune, Binh Chanh District, Ho Chi Minh City, Viet Nam"}