{"skills": ["java technology", "process management", "redis", "iot", "design pattern", "mysql", "log4j", "cyber security", "nginx", "mvc", "bootstrap", "operating system", "rest", "search", "testing", "apache spark", "jtest", "software architecture", "spring mvc", "security", "eauthentication", "project management", "restructuring", "le", "netbeans", "sell", "sales", "strut", "payment", "apache", "jdbc", "iot application", "npm", "cloud", "hibernate", "sales activities", "soapui", "management", "security issue", "management tool", "java", "git", "css", "maven", "internet", "access control system", "desktop", "html", "mocha", "jquery", "ssa", "pop", "banking", "spring boot", "jsp", "xpath", "oauth2", "junit", "mongodb", "apache maven", "postgresql", "restful", "cors", "json", "svn", "tomcat", "maturity", "structure", "j2ee", "linux", "oracle", "angular", "class", "unit test", "sql", "postman", "java application", "javascript", "xml", "quality management", "spring", "aws"], "fulltext": "Le Khac Viet \n29th Jan, 1986 \nPhone: 0905 055 863 | Email address: kv.netcoding@gmail.com \nSolution Architect/Technical Architect \nSummary \n• \nOver 9 years of professional experience in development of web-based applications using Java \ntechnology. \n• \nOver 3 years of professional experience in development of web-based applications using NodeJS, \nAngular JS technology. \n• \nOver 1 year of professional experience in development of IoT applications using Predix platform. \n• \nAbility to communicate directly with abroad customer using English \n• \nMastering in design, structure source code for web-based applications using Java and NodeJS. \n• \nExperienced using design patterns. \n• \nWorking as Solution Architect, Technical Architect, Senior Fullstack developer for both Java and NodeJS \ntechnology. \n• \nExperienced in restructuring existing system. \n• \nA lot of maintained experience \n• \nExperienced using content management tools: Git, SVN or VSS. \n• \nExperienced using digest authentication, OAuth2, CORS. \n• \nAbility to adapt to new technologies/environment quickly. \nTechnical Skill \n• \nProgramming languages, Tools and Frameworks \no Java, J2EE, Servlet/JSP \no Javascript, Node JS, Angular JS 2/4, ExpressJS and relevant libraries. \no Spring Core, Spring MVC, Spring Boot, Struts 2, Hibernate, Apache Spark \no Web Service: RESTful, SOAP \no SQL \no Quartz Scheduler \no Apache POI, Jasper Report \n• \nApplication servers \no Tomcat, Websphere, NgInx, PM2 \n• \nDatabases \no Oracle, PostgreSQL, MySQL \no Elastic Search, Redis, MongoDB \n• \nIDE \no Netbeans, Eclipse, Intellij, Visual Code Insider \n• \nOthers \no Maven, XML, XPath, JSON, Jackson Mapper, Bootstrap, Jquery, NPM \n• \nContent Management Tools \no Git, SVN, VSS \n• \nOperating Systems \no Windows, Mac OSX, Linux \nProfessional experience \nDec 2016 – Present \nSolution Architect at FPT Software Hochiminh \nClient: General Electric, StarHub, Wurldtech, Shiseido, Airbus \nProjects: Wind Farm Management, ChatBot, Cyber Security and Manufacturing Executive System. \nI'm responsible for: \n• \nPre-sale activities (Provide proposals, estimations) \n• \nProvide Software Architecture Documents \n• \nTechnology consulting \n• \nArchitect, design, structure source code for projects \n• \nSupport critically technical issues \nOn \n• \nGE Predix Cloud platform \n• \nAWS Cloud platform \n• \nIoT-based applications \n• \nMicroservice-based, monolithic-based applications \nProjects descriptions \n• \nWind Farm Management (WFM) application is an IoT based application.  In America, there’re a lot of turbines \nthat need to be tracked, monitored to check whether any issues occurred. In WFM, for example we used the \nTimeSeries service that provided by GE Predix Platform to do the tracking or monitoring data that pushed by \nsensors. Data after that visualized for web users for controlling. \n• \nChatbot application is an NLP (Natural Language Processing) application. StarHub has a lot of template email \nthat will be sent to customer for confirmation, ask question, run survey campaign,… Therefore, they want to \nbuild an software which supports to communicate directly with their customer instead of people interception. \n• \nCyber Security Standard Assessment (SSA) application is a micro service-based application. Wurldtech customer \nusing SSA (Security Standard Assessment) application to assess the security maturities then provide the \nassessment results to customer for improving or fixing security issues that shouldn’t be existed in the system. \nWe’ve decided to use Java Spring Boot, NodeJS and Angular JS 2 for the solution approach. \n• \nMES (Manufacturing Executive System) is not only a application but huge system. It is center layer in Industry \n4.0. In which, they can control, monitor, intercept, … entire manufacturing processes, ranging from logistic, ERP, \nproduction control, production processes, packaging,…  \nTechnologies used  \n• \nProgramming languages and frameworks: \no Spring Boot, Hibernate, Maven, Apache POI, NodeJS, Express JS, Angular JS 2, Bootstrap, PostgreSQL, GE \nPredix services, NPM libraries \n• \nDeployment Server \no Tomcat 9, NgInx, PM2, Electron \n• \nTest \no Junit, Istanbul, Mocha \no PostMan – a Chrome REST client \nApr 2016 – Dec 2016 \nTechnical Leader at CMC Software \nClient: Vietinbank \nProjects: Loyalty portal \nI’m responsible for: \n• \nDesign, architect and structure the source code from the scratch \n• \nCoding \n• \nConduct daily meeting for tracking tasks, issues \n• \nTechnology consulting for other Java applications that implementing by other teams \n• \nSupport critically technical issues \nProject descriptions \n• \nThe customer (a bank in Vietnam) wants to build a web-based application which delivers Loyalty functionality to \ntheir customers (bank customers). Whenever a bank customer done a transaction, they have a change which \ncounted by points, then they can used those points and get the items they desire. \n• \nThe item catalogue which the bank provided in the application comes from their partners. The bank doesn’t \nmanage those catalogues but partners. And they are using the code interpreter to make the business work. \nThus, after the item is changed completely, the bank customer can use the generated code and go to partner’s \nstore and get that item. \n• \nThe bank has 3 existing applications and they want Member Portal developers integrate all of them together. \nThey are Internet Banking, Loyalty and SOA application.  \nTechnologies Used: \n• \nProgramming languages and frameworks: \no Java, Spring 4, Log4j2, RESTful, SOAP, Angular JS 2, HTML, CSS \n• \nDeployment servers: \no Tomcat 8 \n• \nTest \no Junit \no PostMan – a Chrome REST client \nJuly 2014 – Mar 2016 \nTechnical Leader at CMC Software \nClient: SISTIC \nProjects: Ticketing System \nI’m responsible for: \n• \nCapture requirement, revise the solution and send this to customer for confirmation.  \n• \nResearch new technologies which client needs. \nRestructure the system. \nCoding. \nConduct daily meeting. \nSupport team members to fix critical issues. \nReview code for members before committing. \nSupport project team members for technical issues. \nMerge code. \n• \n• \n• \n• \n• \n• \n• \nProject descriptions \n• \nThis is not only project, but also an operational work. SISTIC is a largest ticketing service and solution provider in \nSingapore. It sells tickets ranging from pop concerts, musical, theatre, family entertainment and sports. SISTIC’s \nAuthorised Agents are located in Singapore, Malaysia, Indonesia, India, Taiwan, Vietnam and Thailand. \n• \nThe project consists of 3 parts, a booking engine network, a main backend application and an ACS (Access \nControl System) network. The architecture is just simple, 3 parts are communicated with each other via \nSOAP/RESTful services (SOAP is for back-compatible functionalities).  \n• \nEnd users can do the booking directly on the web. They can choose seats visually; choose the promotion price, \nexpected delivery, payment methods and ticket protector etc. \n• \nVenue, seat map, price, delivery methods, all of the things can be configured in the backend application and \nserving to booking engine apps via RESTful services. \n• \nNew business will be configured in properties file for adhoc deployments. \nTechnologies Used: \n• \nProgramming languages and frameworks: \no Java, JSP/Servlet, Spring 4, Spring MVC 4, Hibernate 4, Struts 1.2, Jasper Report 4.6.1, Quartz, Log4j, \nApache POI, HTML, CSS, Jquery \no Web Services: SOAP, REST. \n• \nDeployment server: \no Websphere 8, Tomcat 7. \n• \nTest \no JUnit. \no SoapUI, REST Advanced Client for testing web services. \nJan 2013 – June 2014 \nSenior Java Developer at FPT Software Danang \nClient: HITACHI \nProject: Population Management \nI’m responsible for: \n• \nUsing design patterns, best practices and common usage, build abstract classes as well as interfaces for project \nteam. \n• \nConduct a daily meeting \n• \nCompose/modify common documents (convention docs, business docs, comment docs) \n• \nWeb meeting with BrSE to clear requirement \n• \nBe a member of team lead meetings to solve difficult issues \n• \nDo a super review for deliverables. \n• \nSupport project team members for technical issues. \n• \nDo unit test before merge the code into SVN for deliverables. \n• \nCreate assistant documents (time management, issue management, bug trends management, quality \nmanagement, resources management) \nProject descriptions \n• \nThis project is a migration project. Client wants to migrate an desktop-based application to web-based \napplication \n• \nThe project is population management in Japan; some domains are Japanese citizenship, marriage process, all \nabout population management processes. \n• \nThe hardest point of the project is from the migration, VB6 is migrated to Java, learn basic VB6 code, read and \nunderstand code, create code categories and put each line of code into right category, and then do the \nmigration. \nTechnologies Used: \n• \nProgramming languages and frameworks: \no Java, JSP/Servlet, Struts 1, Log4j, JDBC, HTML, CSS, Jquery \n• \nDeployment Server \no Tomcat 7, Cosminexus \n• \nTest \no Junit, JTest \no Maula coverage \nJan 2010 – Dec 2012 \nA lot of small applications… \nEducation & Certification \n• \nHigher Diploma in Software Engineering at Aptech Global. \nThanks for watching, \nLe Khac Viet ", "educations": [{"id": 5185, "gpa": null, "major": "Kỹ thuật phần mềm", "school": "Aptech Global", "diploma": "Other", "end_time": null, "conf_score": 0.7371610175952168, "start_time": null, "picklist_major": "IT - Hardware/Networking", "major_categories": "Máy tính và công nghệ thông tin", "major_categories_detail": "Máy tính"}], "experiences": [{"id": 17339, "detail": "Client: General Electric, StarHub, Wurldtech, Shiseido, Airbus Projects: Wind Farm Management, ChatBot, Cyber Security and Manufacturing Executive System. I'm responsible for:\n• Pre-sale activities (Provide proposals, estimations)\n• Provide Software Architecture Documents • Technology consulting\n• Architect, design, structure source code for projects\n• Support critically technical issues", "company": "FPT Software Hochiminh", "end_time": "2023-04-13T00:00:00Z", "industry": "High Technology", "position": "Solution Architect", "conf_score": 0.9171087048027518, "start_time": "2016-12-01T00:00:00Z"}, {"id": 17340, "detail": "Client: Vietinbank Projects: Loyalty portal\nI’m responsible for:\n• Design, architect and structure the source code from the scratch\n• Coding • Conduct daily meeting for tracking tasks, issues\n• Technology consulting for other Java applications that implementing by other teams\n• Support critically technical issues\nProject descriptions\n• The customer (a bank in Vietnam) wants to build a web-based application which delivers Loyalty functionality to their customers (bank customers). Whenever a bank customer done a transaction, they have a change which counted by points, then they can used those points and get the items they desire.\n• The item catalogue which the bank provided in the application comes from their partners. The bank doesn’t manage those catalogues but partners. And they are using the code interpreter to make the business work.\nThus, after the item is changed completely, the bank customer can use the generated code and go to partner’s store and get that item.\n• The bank has 3 existing applications and they want Member Portal developers integrate all of them together.\nThey are Internet Banking, Loyalty and SOA application.\nTechnologies Used: • Programming languages and frameworks: o Java, Spring 4, Log4j2, RESTful, SOAP, Angular JS 2, HTML, CSS • Deployment servers: o Tomcat 8 • Test o Junit o PostMan - a Chrome REST client", "company": "CMC Software", "end_time": "2016-12-31T00:00:00Z", "industry": "High Technology", "position": "Technical Leader", "conf_score": 0.9089868123963978, "start_time": "2016-04-01T00:00:00Z"}], "address": null}