{"skills": ["linux", "internal audit", "payment management", "iot", "sales", "mongodb", "monitoring server", "risks", "it service provider", "data warehouse", "business analysis", "business continuity planning", "analysis", "devops", "clojure", "service management", "visualization", "microservices", "vendor management", "governance risk", "iso", "testing", "oracle", "virtualizations", "pascal", "relationship management", "system architecture", "business process reengineering", "java", "futures", "cloud", "business expansion", "virtualization", "dns", "smart home", "banking", "kubernetes", "administration", "enterprise", "enterprise resource planning", "finance", "project management", "it infrastructure", "team management", "maintenance", "scheduling", "reengineering", "document control", "accounting", "supply chain", "risk management", "le", "network infrastructure", "data governance", "problem solving", "dhcp", "agile", "workflow", "operation system", "payment", "resource planning", "xml", "management", "cloud storage", "social impact", "ruby", "business requirement", "business activity", "antivirus", "lean", "kaizen", "process reengineering", "business goal", "supply chain management", "business intelligence", "community development", "making decision", "change management", "system administration", "auditing", "enterprise resource", "people management", "html", "jboss", "customer relationship management", "implementation", "disaster recovery", "system monitoring", "enterprise architecture", "credit sales", "itil", "security", "blockchain", "agile development methodology", "project execution", "structure", "investments", "cic", "repairs and maintenance", "sql", "regulatory compliance", "information security", "symantec", "it service management", "regulatory risk management", "software development", "data visualization", "microsoft", "communication skill", "senior management", "python", "networking", "online community", "php", "mysql", "data collection", "it strategy"], "fulltext": "CV_TUAN LE \nSUMMARY Over 21-years experience IT leader with a demonstrated history of working in \nbanking / financial services industry, practically in business and technology setup, operation, \ninnovation, and transformation. Passionate in FinTech, Digital Transformation, Ecosystem and \nPlatform Development.  Skilled in IT Strategy, IT Management, IT Governance, Enterprise \nArchitecture, ITIL, IT Service Management, and Project Management. Strong professional with \na Bachelor of Engineering focused in Electronics and Telecommunications from Ho Chi Minh \nUniversity of Technology (Dai Hoc Bach Khoa Tp. HCM).  \nSKILLS  \n• IT Governance  \n• IT Management  \n• IT Strategy  \n• IT Operations  \n• IT Service Management/ITIL  \n• Information Security  \n• Disaster Recovery  \n• Vendor Management  \n• Project Management  \n• Business Continuity Plan  \n• Relationship Mgmt  \n• Enterprise Architecture  \n• System Architecture  \n• Business Analysis  \n• Software Development Life Cycle  \n• Agile / DevOps  \n• Change Management  \n• Data Governance  \n• Data Warehouse  \n• Business Intelligence  \n• Data Visualization  \n• Product Design  \n• Banking  \n• Financial Services  \n• Loans  \n• Credit  \n• Business Transformation  \n• Digital Transformation  \n• Business Process Reengineering & Improvement  \n• Organizational Design / Development  \n• Strategic Mangement  \nTECHNOLOGIES  \nEnterprise Resource Planning, Supply Chain Management, Core Banking systems Core Finance \nsystems (Loan Origination, Loan Management and Loan Collection…) Policy Administration \nSystem, Customer Relationship Management,  Payment systems (online/offline), Payment \nGateways, Payment Switching, Accounting System, Content Management System, Document \nManagement System, System, Email, Network, Voice, Virtualization, Web, Telephony, Storage,  \nCloud, Integration, Hyper-converged, Data Center, Server, Routing,  AD, DNS, DHCP, DFS, \nLAN/WAN, Windows, Linux, Microsoft Office 365, Google G-Suite,  Oracle, Ms SQL, \nMySQL, MongoDB, InfluxDB, .NET, VB, C, PHP, XML, HTML, Java, JS, Python, Ruby, Go, \nClojure, SOA, Microservices, Websphere, JBoss, Kubernetes, Kong, Agile, LEAN / Kaizen, \nPMBOK  \nEXPERIENCE  \nGO-PAY (VIETNAM)                                                                                           2019 – Present  \nGo-Pay is the payments platform of Go-Jek – Indonesia’s first decacorn and largest ondemand \nservice platform. The startup with US$10 billion valuation now operates in Indonesia,  \nVietnam, Singapore, Thailand and will soon operate in the Philippines and Malaysia. Together \nwith Go-Jek transportation platform, Go-Pay, the payments platform, will be using technology as \na mean of social impact, aimed in uplifting daily life of people in the market it operates with \nconvenient services for all need (transportation, delivery, shopping, payment, etc.) and \nimproving the economic growth by creating jobs, improving livelihoods of multiple people and \nhelping nudge micro-entrepreneurs. Go-Pay strategy involves all possible areas of digital \nfinancial products and services, from online acceptance, to offline acceptance, and also \ninvestment and lending products.  \nHead of Information Technology (Director)                                             (Feb. 2019 – Present)  \n One of the very first members of Vietnam company setup team, reports to Go-Pay’s Head of \nInternational Expansion, working not only in technology side such as technology/product \nplatform’s implementation, but also in business side such as setting the objectives and strategies \nfor Go-Pay Vietnam business.  \n Co-leading/Supporting Go-Viet’s IT and Technology Team in strengthen its operations and \ndevelopments, especially in term of Governance, Risk and Compliance.  \n Working with all Go-Jek’s business divisions, subsidiaries, and business partners to support \nbusiness growth.  \nCIMB BANK VIETNAM                                                                                            2017 – 2019  \nCIMB Group is a leading KL-headquartered ASEAN universal bank, one of the largest \ninvestment banks in Asia and one of the largest Islamic banks in the world. It’s the second \nlargest bank in Malaysia.  \nVice President, Information Technology, Technology & Operations (Nov. 2017 – Jan. 2019) \n– Head of Information Technology.  \n The key purposes of the role are to support business requirements and manage Technology \nteams, including all of IT relevant daily works of banking application and infrastructure support, \ndevelop/explore IT strategic solutions to ensure business get a cutting-edge technology platform, \nadvance competitiveness. Manage and drive the delivery of critical projects to transform \nTechnology Services to serve business.  \n Works with regional teams and responsibles for integration and development for new digital \nbanking platform to the traditional banking platform.  \n Strategy and Planning: Lead teams to formulate IT policies to support various business units. \nEnsure effective utilisation of manpower and responsible for monitoring operating cost \neffectiveness of IT departments. Manage annual budget assigned to IT. Develop strategies to \ntrack and analyse business activities to anticipate future needs and propose recommendations. \nImplement regional business/IT strategies.  \n Risk Management / Regulatory Compliance: Full understanding of and compliance with own \narea’s internal policy and procedural requirements as well as regulatory / statutory requirements \nfrom State Bank and other statutory / regulatory bodies. Follow regional standard/guidelines of \nproject management as well as meet auditing requirements. Ensure all issues / incidents are \nreported in timely manner and have properly follow up till it has been solved. Ensure sufficient \nback up/DR/BCP capabilities to support business and future growth.  \n People Management / Team Work: Actively assist other team members to fulfil departments \nwork within the set time frame. Assist top/senior management on the management of IT teams \nand/or escalate for further guidance. Develop, build and lead an effective and cohesively unit. \nExchange and share “best practice” / lesson learnt from experienced problems to other team \nmembers.  \n Control and Monitoring: Monitor Information Security. Monitor Technology cost (total and \nunit cost basis), IT purchases within approved budget. Monitor vendor’s performance and SLA. \nMonitor regional IT supports and SLA. Control IT system administration such as creating User \nID, authority set up, setting up new products, SIT, UAT and PRD.  \n Reporting: Provide regular and ad-hoc reports for management regarding project progress, \nsystem management statistics and matters related to IT departments. Prepare IT regulatory \nreports as per requirement.  \n Business As Usual (BAU): Manage Technology teams to support business requirements. \nManage the process of developments and changes. Work cohesively with Regional IT teams to \nget the relevant support. In charge of hardware, software and IT infrastructure/network matters \nfor the entire bank, including PAR preparation. Liaise with IT application and system vendors \nand other relevant services providers. IT/Business knowledge transfer from the application \nsolution providers, prepare knowledge base and relevant materials to manage the application, \nwork with BA teams to rollout application enhancement, changes or support.  \nTOYOTA FINANCIAL SERVICES VIETNAM                                                    2008 – 2017  \nMember of Toyota Financial Services Group - Toyota Group’s financial services arm, is the first \ncaptive finance company in Vietnam, to “Provide sound financial services that contribute to the \nprosperous life for Toyota customers and others.”  \nSenior Manager – Corporate Planning & Management Support (Apr. 2017 – Nov. 2017) - \nIT & Technology. \n  Working with the CEO, in line with Toyota Group and Toyota Financial Services Group \nMission, Vision and Strategic Directions to pursue Sustainable Growth, lead the enterprise wide \nDigital Transformation by setting direction, strategy, roadmap and execution plan to innovate \nbusiness.  \n Working with all Business Stakeholders to create ideas, develop roadmap, initiate relevant \nproject execution to adopt and develop advanced technologies and solutions to improve business \noperation.  \n Being the Product Owner for technology/digital solutions that responsibles for the whole \nproduct life cycle.  \n Priority projects:  \n- Auto approval in Credit Application Processing (with auto CIC data collection).  \n- Optimize the front-end business operation from Sales & Credit areas to Loan disbursement area \n- Improve the customer contact and communication by developing Contact Centre.  \n- Develop client portals (individual/corporate) to improve Customer Services operation.  \n- Develop the Data Warehouse / Business Intelligence framework/solution to enable and improve \nbusiness analysis and decision making.  \n- Transform IT to provide flexible and agile IT infrastructure, support and services to support \nbusiness growth.  \n- DC / Office relocation / expansion. \nSenior Manager – IT (Jan. 2009 – Apr. 2017) – Head of IT  \nBCP Manager (acting – 2010 – 2013)  \nIT Manager (Mar. 2008 – Dec. 2008) – Head of IT  \n Member of Management Committee, Head of IT, reports directly to CEO, responsible for all \nIT functions across the organization including: operations and developments of infrastructure, \napplications (including business applications) and IT services.  \n Lead IT strategic and operational planning to achieve business goals. Be a part of corporate \nMid-Term Planning activities. Develop IT Mid-Term Plan in accordance with Toyota Financial \nServices Corporation’s process following Toyota global process.  \n Coordinate with regional IT teams from global head-quarter in Japan to align local IT \nstrategies and operations in accordance with global IT strategies, directions & vision of Toyota \nFinancial Services / Toyota group. Coordinate with global and regional IT teams in global IT \nprojects.  \n Fostering innovation, prioritizing IT initiatives, and coordinating the evaluation, deployment, \nand management of current and future IT systems.  \n Build up and manage software development teams (combined of internal and outsourced \nresources) to completely build and deliver a replacement core financial system (named SIS). The \nnew system is up and running to cover all business areas, from front office to back office, from \nLoan Origination, Loan Management to Loan Collection, from retail business to wholesale \nbusiness. The system development is based on modern technology platforms/architectures such \nas .NET, Oracle, SOA, web based and workflow management; It’s backed with Agile \ndevelopment methodology to speed up system delivery.  \n Develop the IT organization structure to support the needs of business. Recruit, manage, \ndevelop, and retain IT staff & resource for operations and projects.  \n Ensure smoothly operation of all IT areas: infrastructure, applications, and services.  \n Ensure corporate information security, ensure system disaster recovery capability.  \n Continuously develop the ICT infrastructure to support business expansion.  \n Continuously develop the applications (including business applications: core financial system, \naccounting systems and other operational systems) to support business development.  \n Setup and manage IT vendor relationship to assure best external services.  \n Develop and manage IT and IT related policies and procedures to assure the standard and \ncompliance.   \n Responsible for all IT and Business Solutions projects.  \n Support in development of business users’ knowledge and skills (especially in business \nprocesses with core system, IT and information security knowledge).  \n In charge of BCP (Business Continuity Planning) function in designing, developing, \ndeploying, and managing the BCP operations, including: development of BCP framework \n(policies & procedures), conduct BCP trainings, conduct BCP testing and review.  \n Member of company setup team. Established company IT systems and operations from the \nvery first days of business commencement including: infrastructure, core financial system and \naccounting system implementation; IT services setup…  \n A leader of BPR (Business Process Reengineering) projects to review the core business \n(credit) operation processes and develop solutions aim to have improvement of business \noperation efficiency and effectiveness.  \nILA VIETNAM                                                                                                          2002 – 2008  \nForeign-owned education and training company in Vietnam, offering a broad range of \neducational programmes and services.  \nOperations Department (Apr. 2006 – Feb. 2008) - Operations System Executive  \n Control the business working system in the following areas: the compatibility / integration of \nthe system and business processes, the effectiveness and efficiency of the system, the \ndevelopment of business applications, and the document control system.  \n Build, deploy, implement, and develop the business working system.  \n Corporate planning and reporting management in the following processes: communicate of \ncorporate planning process, communicate of reporting process.  \n Internal auditing activities for internal control and business operations: conducting internal \naudit activities.  \nMIS Department (Aug. 2002 – Apr. 2006) - Webmaster, Network & System Admin, IT \nSupport Engineer.   \n Be responsible for all IT issues supporting, designing, implementing, managing, and \nadministrating all computer networks / servers / IT systems / intranet / website in HO and all \nbranches.   \n Define requirements, design, plan, implement, and manage all company's servers and network \nequipment.  \n Research, plan, implement and manage the company antivirus system (based on Symantec \nproducts), servers monitoring system, and inventory system.  \n Well-versed in the design of networking systems. Supply backup and documentation of \ncomputer and networking systems.  \n Propel new technologies, formulate the future visions.  \n Facilitate hardware repair and maintenance through LAN and WAN administration support, \nof all company Windows, Macintosh workstations, as well as end-user workstations.  \n Troubleshooting daily difficulties, tasks, requests, providing support both on-site and \ntelephones/emails.  \n Monitor IT spare parts/store/assets.  \n Set goals, managing daily, weekly, and annual scheduling for IT Support team.  \n Contact and negotiate to ensure best price and service available from suppliers and providers; \npresiding over from initial contract negotiation to final implementation, and on-going operations. \n  Maintain and update system when new staff joins or leaves the company.  \n Maintain excellent relationship with peers, internal customers, and suppliers.   \nV.A.M (VINH NAM) CO., LTD                                                                                 1996 – 2008  \nIT Consultant, Network Administrator (part time - Dec. 1996 – Feb. 2008)   \n Define requirements, design, plan, implement, manage and develop company's information \nsystems including: - Research, document, propel new technologies, and formulate the future \nvisions. - Set goals and manage network and system annual plan for IT team. - Conduct business \nprocess review, and recommend IT-relevant workplace and system improvements to Board of \nDirectors. - Collaborate with IT officers/IT programmers/IT suppliers/IT providers to determine \ncurrent and future needs, propose IT ideas to improve workflow. - Manage the implementation of \nvarious software/hardware projects. - Advise and aid IT officers/IT programmers on difficulty \nissues and problems.  \n ONLINE COMMUNITIES                                                                                      2004 – 2009  \nFreeCodeVN is the biggest online community in software / website development and \nmanagement at that time.  Other online communities in software development and management.  \nAdministrator (Jan. 2004 – Jan. 2009)  \n- Manages all aspects of community operations  \n- Leads the community developments  \n EDUCATION & COURSES EDUCATION  \n Master of Business Administration, General, August 2018 - 2019, Columbia Southern \nUniversity  \n Bachelor of Engineering in Electrical – Electronics, Major of Electronics - \nTelecommunications, September 1996 - December 2001, Ho Chi Minh City University of \nTechnology (Đại học Bách Khoa)  \nCOURSES  \n Toyota Financial Services Management Development Program, October 2012, Toyota \nFinancial Services Corporation, Nagoya, Japan   \n Effective Communication, March 2013, Dale Carnegie Vietnam, Ho Chi Minh City  \n Toyota’s Kaizen, Toyota Way, Toyota Financial Services Way, Toyota Business Practice, \nToyota Financial Services Vietnam, Ho Chi Minh City and Online University of Toyota  \n I-Speak Your Language – Communication Skills, September 2007, ILA Vietnam  \n The ISO 9001:2000 Internal Auditor Training, July 2007, SGS Vietnam  \n ISO 9000 Awareness & Interpreting, May 2007, SGS Vietnam  \n Communication Skills, August 2005, ILA Vietnam  \n Certified Ethical Hacker, April 2005 - June 2005, Athena Vietnam  \n Team Building Skills, May 2005, ILA Vietnam  \n Time Management Course, February 2004, ILA Vietnam  \n Project Management for all Disciplines, June 2003, ILA Vietnam  \n Creative Problem Solving, April 2003, ILA Vietnam   \n Turbo Pascal Programming Language, December 1991 - January 1993, Maika Informatic \nClub - Scitec Joint Stock Information Company  \nAWARDS \n  Long service (5-year) Award in Toyota Financial Services Vietnam, 2013  \n Long service (5-year) Award in ILA Vietnam, 2007  \n The first prize in HCMC University of Technology Student Information Olympic contest, \n02/1998   \n The first prize in Ho Chi Minh City Youth Information Contest, 11/1995   \n The first prize in Ho Chi Minh City Non-Professional Youth Information Contest, 07/1995   \n The encouraging prize in Ho Chi Minh City Youth Information Contest, 12/1994  \nPERSONAL INTERESTS \nOpen Source Software, Cloud Computing, Big Data, Data Science, FinTech IoT, Automobile, \nMotorbike, Lifestyle, Movie, Smart home Startup, Innovation, Blockchain ", "educations": [{"id": 5196, "gpa": null, "major": "Kỹ thuật điện tử – viễn thông", "school": "Columbia Southern University", "diploma": "Masters", "end_time": "2019-01-01T00:00:00Z", "conf_score": 0.8934356695649784, "start_time": "2018-08-01T00:00:00Z", "picklist_major": "Technical", "major_categories": "Kỹ thuật", "major_categories_detail": "Kỹ thuật điện, điện tử và viễn thông"}, {"id": 5197, "gpa": null, "major": "Kỹ thuật điện tử – viễn thông", "school": "Ho Chi Minh City University of Technology (Đại học Bách Khoa)", "diploma": "Bachelors", "end_time": "2001-12-01T00:00:00Z", "conf_score": 0.9242015051317842, "start_time": "1996-09-01T00:00:00Z", "picklist_major": "Technical", "major_categories": "Kỹ thuật", "major_categories_detail": "Kỹ thuật điện, điện tử và viễn thông"}, {"id": 5195, "gpa": null, "major": "Kỹ thuật điện tử – viễn thông", "school": "Ho Chi Minh University of Technology (Dai Hoc Bach Khoa Tp. HCM).", "diploma": "Bachelors", "end_time": null, "conf_score": 0.8370072322278165, "start_time": null, "picklist_major": "Technical", "major_categories": "Kỹ thuật", "major_categories_detail": "Kỹ thuật điện, điện tử và viễn thông"}], "experiences": [{"id": 17377, "detail": ") One of the very first members of Vietnam company setup team, reports to Go-Pay’s Head of\nInternational Expansion, working not only in technology side such as technology/product platform’s implementation, but also in business side such as setting the objectives and strategies for Go-Pay Vietnam business.\nCo-leading/Supporting Go-Viet’s IT and Technology Team in strengthen its operations and developments, especially in term of Governance, Risk and Compliance. Working with all Go-Jek’s business divisions, subsidiaries, and business partners to support business growth.", "company": "GO - PAY (VIETNAM)", "end_time": "2023-04-13T00:00:00Z", "industry": "Other", "position": "Head of Information Technology (Director)", "conf_score": 0.6981244904084882, "start_time": "2019-02-01T00:00:00Z"}, {"id": 17378, "detail": "o-Pay is the payments platform of Go-Jek - Indonesia’s first decacorn and largest ondemand service platform. The startup with US$10 billion valuation now operates in Indonesia, Vietnam, Singapore, Thailand and will soon operate in the Philippines and Malaysia. Together with Go-Jek transportation platform, Go-Pay, the payments platform, will be using technology as a mean of social impact, aimed in uplifting daily life of people in the market it operates with convenient services for all need (transportation, delivery, shopping, payment, etc.) and improving the economic growth by creating jobs, improving livelihoods of multiple people and helping nudge micro-entrepreneurs. Go-Pay strategy involves all possible areas of digital financial products and services, from online acceptance, to offline acceptance, and also investment and lending products.", "company": "GO - PAY (VIETNAM)", "end_time": "2023-04-13T00:00:00Z", "industry": "Other", "position": null, "conf_score": 0.7072786810336025, "start_time": "2019-01-01T00:00:00Z"}, {"id": 17379, "detail": ". The key purposes of the role are to support business requirements and manage Technology teams, including all of IT relevant daily works of banking application and infrastructure support, develop/explore IT strategic solutions to ensure business get a cutting-edge technology platform, advance competitiveness. Manage and drive the delivery of critical projects to transform\nTechnology Services to serve business.\nWorks with regional teams and responsibles for integration and development for new digital banking platform to the traditional banking platform.", "company": "CIMB BANK VIETNAM", "end_time": "2019-01-31T00:00:00Z", "industry": "Banking", "position": "Vice President, Information Technology, Technology & Operations", "conf_score": 0.8204278355866866, "start_time": "2017-11-01T00:00:00Z"}, {"id": 17380, "detail": "CIMB Group is a leading KL-headquartered ASEAN universal bank, one of the largest investment banks in Asia and one of the largest Islamic banks in the world. It’s the second largest bank in Malaysia.", "company": "CIMB BANK VIETNAM", "end_time": "2019-01-31T00:00:00Z", "industry": "Banking", "position": null, "conf_score": 0.6981244904084882, "start_time": "2017-01-01T00:00:00Z"}, {"id": 17381, "detail": "Technology. Working with the CEO, in line with Toyota Group and Toyota Financial Services Group Mission, Vision and Strategic Directions to pursue Sustainable Growth, lead the enterprise wide\nDigital Transformation by setting direction, strategy, roadmap and execution plan to innovate business.\nWorking with all Business Stakeholders to create ideas, develop roadmap, initiate relevant project execution to adopt and develop advanced technologies and solutions to improve business operation.\nBeing the Product Owner for technology/digital solutions that responsibles for the whole product life cycle.\nPriority projects:\n- Auto approval in Credit Application Processing (with auto CIC data collection).\n- Optimize the front-end business operation from Sales & Credit areas to Loan disbursement area\n- Improve the customer contact and communication by developing Contact Centre. - Develop client portals (individual/corporate) to improve Customer Services operation.\n- Develop the Data Warehouse / Business Intelligence framework/solution to enable and improve business analysis and decision making.\n- Transform IT to provide flexible and agile IT infrastructure, support and services to support business growth.\n- DC / Office relocation / expansion.", "company": "IT &", "end_time": "2017-11-30T00:00:00Z", "industry": "High Technology", "position": "Senior Manager - Corporate Planning & Management Support", "conf_score": 0.8123354938190348, "start_time": "2017-04-01T00:00:00Z"}, {"id": 17382, "detail": "", "company": "IT &", "end_time": "2017-04-30T00:00:00Z", "industry": "High Technology", "position": "Senior Manager - IT", "conf_score": 0.8059271514195585, "start_time": "2009-01-01T00:00:00Z"}, {"id": 17383, "detail": "of Toyota Financial Services Group - Toyota Group’s financial services arm, is the first captive finance company in Vietnam, to “Provide sound financial services that contribute to the prosperous life for Toyota customers and others.”", "company": "TOYOTA FINANCIAL SERVICES VIETNAM", "end_time": "2017-01-31T00:00:00Z", "industry": "Other", "position": "Member", "conf_score": 0.8123354938190348, "start_time": "2008-01-01T00:00:00Z"}, {"id": 17384, "detail": "Member of Management Committee, Head of IT, reports directly to CEO, responsible for all\nIT functions across the organization including: operations and developments of infrastructure, applications (including business applications) and IT services.\nLead IT strategic and operational planning to achieve business goals. Be a part of corporate\nMid-Term Planning activities. Develop IT Mid-Term Plan in accordance with Toyota Financial Services Corporation’s process following Toyota global process.\nCoordinate with regional IT teams from global head-quarter in Japan to align local IT strategies and operations in accordance with global IT strategies, directions & vision of Toyota Financial Services / Toyota group. Coordinate with global and regional IT teams in global IT projects.\nFostering innovation, prioritizing IT initiatives, and coordinating the evaluation, deployment, and management of current and future IT systems.\nBuild up and manage software development teams (combined of internal and outsourced resources) to completely build and deliver a replacement core financial system (named SIS). The new system is up and running to cover all business areas, from front office to back office, from\nLoan Origination, Loan Management to Loan Collection, from retail business to wholesale business. The system development is based on modern technology platforms/architectures such as .NET, Oracle, SOA, web based and workflow management; It’s backed with Agile development methodology to speed up system delivery.\nDevelop the IT organization structure to support the needs of business. Recruit, manage, develop, and retain IT staff & resource for operations and projects.\nEnsure smoothly operation of all IT areas: infrastructure, applications, and services.\nEnsure corporate information security, ensure system disaster recovery capability.\nContinuously develop the ICT infrastructure to support business expansion.\nContinuously develop the applications (including business applications: core financial system, accounting systems and other operational systems) to support business development.\nSetup and manage IT vendor relationship to assure best external services.\nDevelop and manage IT and IT related policies and procedures to assure the standard and compliance.\nResponsible for all IT and Business Solutions projects.\nSupport in development of business users’ knowledge and skills (especially in business processes with core system, IT and information security knowledge).\nIn charge of BCP (Business Continuity Planning) function in designing, developing, deploying, and managing the BCP operations, including: development of BCP framework (policies & procedures), conduct BCP trainings, conduct BCP testing and review.\nMember of company setup team. Established company IT systems and operations from the very first days of business commencement including: infrastructure, core financial system and accounting system implementation; IT services setup...\nA leader of BPR (Business Process Reengineering) projects to review the core business (credit) operation processes and develop solutions aim to have improvement of business operation efficiency and effectiveness.", "company": "IT &", "end_time": "2013-01-31T00:00:00Z", "industry": "High Technology", "position": "IT Manager", "conf_score": 0.8823056520268192, "start_time": "2008-03-01T00:00:00Z"}, {"id": 17385, "detail": "is the biggest online community in software / website development and management at that time. Other online communities in software development and management.", "company": "FreeCodeVN", "end_time": "2009-01-31T00:00:00Z", "industry": "High Technology", "position": "Administrator", "conf_score": 0.8640108824287479, "start_time": "2004-01-01T00:00:00Z"}, {"id": 17386, "detail": "ontrol the business working system in the following areas: the compatibility / integration of the system and business processes, the effectiveness and efficiency of the system, the development of business applications, and the document control system.\nBuild, deploy, implement, and develop the business working system.\nCorporate planning and reporting management in the following processes: communicate of corporate planning process, communicate of reporting process.\nInternal auditing activities for internal control and business operations: conducting internal audit activities.", "company": "ILA VIETNAM", "end_time": "2008-01-31T00:00:00Z", "industry": "Other", "position": "Operations System Executive", "conf_score": 0.8744912445274307, "start_time": "2002-01-01T00:00:00Z"}, {"id": 17387, "detail": "Define requirements, design, plan, implement, manage and develop company's information systems including: - Research, document, propel new technologies, and formulate the future visions. - Set goals and manage network and system annual plan for IT team. - Conduct business process review, and recommend IT-relevant workplace and system improvements to Board of\nDirectors. - Collaborate with IT officers/IT programmers/IT suppliers/IT providers to determine current and future needs, propose IT ideas to improve workflow. - Manage the implementation of various software/hardware projects. - Advise and aid IT officers/IT programmers on difficulty issues and problems.", "company": "V.A.M (VINH NAM) CO., LTD", "end_time": "2008-01-31T00:00:00Z", "industry": "Other", "position": "IT Consultant, Network Administrator", "conf_score": 0.8744912445274307, "start_time": "1996-01-01T00:00:00Z"}, {"id": 17388, "detail": ". Be responsible for all IT issues supporting, designing, implementing, managing, and administrating all computer networks / servers / IT systems / intranet / website in HO and all branches.\nDefine requirements, design, plan, implement, and manage all company's servers and network equipment.\nResearch, plan, implement and manage the company antivirus system (based on Symantec products), servers monitoring system, and inventory system.\nWell-versed in the design of networking systems. Supply backup and documentation of computer and networking systems.\nPropel new technologies, formulate the future visions.\nFacilitate hardware repair and maintenance through LAN and WAN administration support, of all company Windows, Macintosh workstations, as well as end-user workstations.\nTroubleshooting daily difficulties, tasks, requests, providing support both on-site and telephones/emails.\nMonitor IT spare parts/store/assets.\nSet goals, managing daily, weekly, and annual scheduling for IT Support team.\nContact and negotiate to ensure best price and service available from suppliers and providers; presiding over from initial contract negotiation to final implementation, and on-going operations.\nMaintain and update system when new staff joins or leaves the company.\nMaintain excellent relationship with peers, internal customers, and suppliers.", "company": "MIS Department", "end_time": "2006-04-30T00:00:00Z", "industry": "Other", "position": "Webmaster, Network & System Admin, IT Support Engineer", "conf_score": 0.9186600440228837, "start_time": "2002-08-01T00:00:00Z"}, {"id": 17389, "detail": "Communication Skills, August 2005, ILA Vietnam Certified Ethical Hacker, April 2005 - June 2005, Athena Vietnam Team Building Skills, May 2005, ILA Vietnam Time Management Course, February 2004, ILA Vietnam Project Management for all Disciplines, June 2003, ILA Vietnam Creative Problem Solving, April 2003, ILA Vietnam Turbo Pascal Programming Language,", "company": "Maika Informatic\nClub - Scitec Joint Stock Information Company", "end_time": "1993-01-31T00:00:00Z", "industry": "Other", "position": null, "conf_score": 0.7050867654707917, "start_time": "1991-12-01T00:00:00Z"}], "address": null}