{"skills": ["linux", "stack", "tdd", "docker", "symfony", "automation", "analytics", "ftp", "rest", "management", "postgresql", "kubernetes", "io", "git", "redis", "mvc architecture", "rabbitmq", "business intelligence", "design pattern", "mvc", "golang", "backend development", "performance optimization", "php"], "fulltext": "Tung Vu\nSenior Software Engineer\nAddress23-22 The Pegasuite, Ta Quang Buu\nward 6, district 8\nHo Chi Minh City\nPhone +84975136456\nE-mail vutung.ct@gmail.com\nDate of birth1987/11/23\nI'm a dedicated team/individual worker. I love challenges and new technologies. To keep up with new technologies, I can quickly learn\nand adapt new technologies and to overcome challenges, I keep practicing my skills again and again.\nLinkedIn linkedin.com/in/vutung2311\nExperience\n2017 - present\nSenior Software Engineer\nLazada Group\nThis is the first time I do Golang. Even though many people said that Go is highly opinionated, I see Go as the\nright tool for the job.\nTechnical stack:\nProducts:\nGolang •\nPostgreSQL •\nRedis •\nKubernetes •\nDocker •\nTransportation Management System is a system for managing package, package dimensions, package status\nin the process of package transportation. This has some similarity with the product that I previously worked on\n(Logistics Management System) but at a different level. The product doesn't manage daily job of driver or driver\nor hub.\n•\nSmart routing (third party logistics company selection) is for routing package. It lets operator to select which\nthird party logistics company to do package pickup, and which to do package delivery base on the origin and\ndestination, dimensions, weight and delivery options of the package. There are many set of configurations that\noperator need to set up for system to function properly (aka making the system smart).\n•\nDelivery promise (e-commerce product delivery estimation) is for estimating delivery time for a package. This\nsystem face directly to the customers when they view the product on e-commerce page. Because of that this\nsystem need to be fast (99% percentile of response time should be lower than or equal to 10ms). And because\nof that I learnt quite a few things about optimize Golang http response time by myself.\n•\n2015/09 - 2016/11\nPHP Developer\nLazada Group\nThis was the first time that I approached TDD. I realized how good TDD is and I kept practicing on it.\nTechnical stack:\nProducts:\nPHP •\nPostgreSQL •\nDocker •\nRabbitMQ •\nSymfony •\nLogistics Management System is about management of package, package status, daily job of driver, driver, hub.\nMVC architecture was used. I also learnt about design pattern and performance optimization.\n•\n2014/11 - 2015/09\nSenior PHP Developer\nZinio\nThis was the first time that I went to work in an office. Previously I did mostly remote job. During this time I learned\nabout eZ Publish, a opensource complex CMS, creating module/plugin/extension for it. Then soon I moved to the\ntask to write data gathering and pushing tool for business intelligence. This tool is a PHP script which connect to\nFTP server, crunching data and then send data to REST api of keen.io\nBackend Developer\nDevelop and maintain the CMS of the company.\n•\nDevelop tools for Business Intelligence.\n•\nImplement analytics system for mobile newsstand.\n•\nEducation\n2005/09 - 2013/09\nHo Chi Minh University of Technology, Bachelor of Engineering\nMechatronics, Robotics, and Automation Engineering\nSkills\nGolang\nPostgreSQL\nDocker\nGit\nKubernetes\nBash\nLinux\nCertificates\n2016/03\nAlgorithmic Thinking (Part 2)\n2016/02\nAlgorithmic Thinking (Part 1)\n2015/12\nedX Honor Code Certificate for Introduction to Linux", "educations": [{"id": 5198, "gpa": null, "major": "Quản lý đô thị và công trình", "school": "Ho Chi Minh University of Technology", "diploma": "Bachelors", "end_time": "2013-09-01T00:00:00Z", "conf_score": 0.8141298764232529, "start_time": "2005-09-01T00:00:00Z", "picklist_major": "Architecture / Interior Design", "major_categories": "Kiến trúc và xây dựng", "major_categories_detail": "Kiến trúc và quy hoạch"}], "experiences": [{"id": 17390, "detail": "This is the first time I do Golang. Even though many people said that Go is highly opinionated, I see Go as the right tool for the job.\nTechnical stack:\nProducts: Golang • PostgreSQL • Redis • Kubernetes • Docker • Transportation Management System is a system for managing package, package dimensions, package status in the process of package transportation. This has some similarity with the product that I previously worked on\n(Logistics Management System) but at a different level. The product doesn't manage daily job of driver or driver or hub.\n• Smart routing (third party logistics company selection) is for routing package. It lets operator to select which third party logistics company to do package pickup, and which to do package delivery base on the origin and destination, dimensions, weight and delivery options of the package. There are many set of configurations that operator need to set up for system to function properly (aka making the system smart).\n• Delivery promise (e-commerce product delivery estimation) is for estimating delivery time for a package. This system face directly to the customers when they view the product on e-commerce page. Because of that this system need to be fast (99% percentile of response time should be lower than or equal to 10ms). And because of that I learnt quite a few things about optimize Golang http response time by myself.\n•", "company": "Lazada Group", "end_time": "2023-04-13T00:00:00Z", "industry": "High Technology", "position": "Senior Software Engineer", "conf_score": 0.9264139694127339, "start_time": "2017-01-01T00:00:00Z"}, {"id": 17391, "detail": "This was the first time that I approached TDD. I realized how good TDD is and I kept practicing on it.\nTechnical stack:\nProducts: PHP • PostgreSQL • Docker • RabbitMQ • Symfony • Logistics Management System is about management of package, package status, daily job of driver, driver, hub.\nMVC architecture was used. I also learnt about design pattern and performance optimization.\n•", "company": "Lazada Group", "end_time": "2016-11-30T00:00:00Z", "industry": "High Technology", "position": "PHP Developer", "conf_score": 0.8310701854240083, "start_time": "2015-09-01T00:00:00Z"}, {"id": 17392, "detail": "This was the first time that I went to work in an office. Previously I did mostly remote job. During this time I learned about eZ Publish, a opensource complex CMS, creating module/plugin/extension for it. Then soon I moved to the task to write data gathering and pushing tool for business intelligence. This tool is a PHP script which connect to\nFTP server, crunching data and then send data to REST api of keen.io", "company": "Zinio", "end_time": "2015-09-30T00:00:00Z", "industry": "Other", "position": "Senior PHP Developer", "conf_score": 0.8414579065455211, "start_time": "2014-11-01T00:00:00Z"}], "address": "23 - 22 The Pegasuite, Ta Quang Buu\nward 6, district 8\nHo Chi Minh City"}