{"skills": ["ease", "networking", "agile", "administration", "finance", "jira", "process development", "parcel", "security", "accounting", "market research", "marketing", "sales", "payment", "excel", "sales and marketing", "workflow", "software development", "inventory management", "management", "medium", "problem solving"], "fulltext": "Nhu Nguyen (Nguyen Bao Quynh Nhu)\nRegional Product Manager\n4 years experienced in leading Customer Impact, Finance and Logistics products. A young mind that\nconstantly seeks challenges and self-improvement opportunities. A dedicated and responsible individual.\nAlso a nature admirer, wanderlust, and coffee addict.\nnhu.nguyen.angela@gmail.com\n+84 907 010 875\nHo Chi Minh City, Vietnam\n12 July, 1989\nSKILLS\nExperienced with Agile methodologies\nExperienced with Jira and Confluence\nExperienced with software development process\nProficient with MS Word, Excel, and PowerPoint\nFluent in English and Vietnamese\nGood team player\nHigh sense of responsibility, pro-activeness and devotion\nStrong business acumen and problem-solving skills\nAble to work efficiently under high pressure and without supervision\nWORK EXPERIENCE\nRegional Operations Product Manager\nLazada eLogistics\n12/2016 – Present\nAchievements/Tasks\nFunction as lead Product Manager for Finance vertical for 6 months (currently), lead Product Manager for Customer Experience\nvertical for 2 years, and simultaneously supporting Product Manager for Logistics vertical for 10 months, working with Scrum Agile\nMethodology.\nDesigned and implemented end-to-end solution for Lazada reverse logistics, from customer return (Logistics), warehouse quality\ncheck (Fulfillment), to subsequent delivery back to customer or merchant (Logistics). This functionality also includes smart routing\ncapabilities to define best fitting logistics solution. This helps fasten Lazada return process, improve customer experience by\nproviding tracking on their returns, solving business needs with a fully automated software that reduces costs for logistic operations.\nMaintain and continuously improve Notification Management System to cater for Lazada eLogistics clients, offering both customer\nand seller communications throughout the parcel journey. This reduces 20% of seller contacts to Partner Support Center for parcel\nconfirmation, and improves lead time of agents solving tickets by 40%.\nSuccessfully led the integration of Notification Management System and new Lazada eLogistics service with Lazada new platforms\n(with respect to Alibaba-Lazada acquisition). The new Lazada eLogistics service ensures a continuous stream of updates from\nmultiple internal systems (Transportation, Returns, Fulfillment, etc.) to be successfully conveyed to the platform via APIs, providing\ntransparency to eCommerce platforms and their upstream systems.\nRegional Operations Product Manager\nLazada Group\n10/2015 – 12/2016\nAchievements/Tasks\nFunctioned as lead Product Manager for Customer Experience and Finance verticals.\nSuccessfully led the integration of Lazada with SAP for Warehouse Inventory Management, Purchase Order and Sales order\nmanagement; managed both internal and outsourcing development teams (Accenture) to interface SAP and Lazada internal\nOperational systems, in order to support Finance department with their needs.\nRevamped Refunds processing to automate SAP accounting records, and Finance Reconciliation to ease the cash (Cash On Delivery)\nhandling process. This improves refund lead time by automating refund amount calculation, security by applying a flexible approval\nworkflow, and assuring accuracy of Financial reporting in SAP.\nDesigned and implemented Notification Management System which provides end-to-end solution for Lazada customer\ncommunications. This system interacts with multiple sources of data and uses multiple channels (emails, SMS, etc.) to provide trace-\nability and transparency for customers on their shopping experience in Lazada, reducing nearly 30% of calls to Customer Service\nhotline.\nPage 1 of 2\nWORK EXPERIENCE\nRegional Senior Associate Customer Experience\nLazada Group\n12/2013 – 10/2015\nAchievements/Tasks\nFunctioned as project manager for Customer Experience vertical.\nDeep-dived in weekly NPS and complaint reports to understand customer needs and pain points, performing market research and\nbench marking, proposing initiatives and leading projects to improve Customer Experience in 6 Lazada ventures, especially in\nCustomer communications and self-service on the website (Help Center, Chat box), by collaborating with local business teams and\nregional tech teams.\nSuccessfully launched new Return policy and new Shipping fee policy across 6 ventures to improve not only customer experience\nduring checkout and post delivery, but also seller experience with clear contract on payment and penalty alignment between Lazada\nand its sellers.\nMarketing and Sales Executive\nSunbytes Ltd. Co.\n08/2012 – 12/2013\nAchievements/Tasks\nFunctioned as Marketing and Sales Executive, reported directly to Managing Director.\nPlanned and ran Marketing and Sales campaigns to generate sales leads through social media and cold calls, and build brand\nawareness through networking events and email newsletters.\nDrafted and provided price proposals to the clients.\nEDUCATION\nMaster of Business Administration\nAustralian Institute of Business (AIB)\n2012 – 2015\nBachelor of Arts\nVietnam National University of Social Sciences and Humanities\n2007 – 2011\nCERTIFICATES\nTOEIC Certificate (2012)\nscore of 935 / 990\nLANGUAGES\nVietnamese English\nVOLUNTEER EXPERIENCE\nCourt Interpreter\nThe Court House of Ho Chi Minh City\n2011 – 2013\nExhibit Interpreter\nStudent Organization\n2007 – 2011\nINTERESTS\nTraveling Reading Swimming BEER! COFFEE!\nPage 2 of 2", "educations": [{"id": 5219, "gpa": null, "major": "Quản lý đô thị và công trình", "school": "Australian Institute of Business (AIB)", "diploma": "Masters", "end_time": "2015-01-01T00:00:00Z", "conf_score": 0.7851615749618549, "start_time": "2012-01-01T00:00:00Z", "picklist_major": "Architecture / Interior Design", "major_categories": "Kiến trúc và xây dựng", "major_categories_detail": "Kiến trúc và quy hoạch"}, {"id": 5220, "gpa": null, "major": null, "school": "Vietnam National University of Social Sciences and Humanities", "diploma": "Bachelors", "end_time": "2011-01-01T00:00:00Z", "conf_score": 0.7565781916879039, "start_time": "2007-01-01T00:00:00Z", "picklist_major": "Other", "major_categories": "", "major_categories_detail": ""}], "experiences": [{"id": 17452, "detail": "Achievements/Tasks Function as lead Product Manager for Finance vertical for 6 months (currently), lead Product Manager for Customer Experience vertical for 2 years, and simultaneously supporting Product Manager for Logistics vertical for 10 months, working with Scrum Agile Methodology. Designed and implemented end-to-end solution for Lazada reverse logistics, from customer return (Logistics), warehouse quality check (Fulfillment), to subsequent delivery back to customer or merchant (Logistics). This functionality also includes smart routing capabilities to define best fitting logistics solution. This helps fasten Lazada return process, improve customer experience by providing tracking on their returns, solving business needs with a fully automated software that reduces costs for logistic operations.\nMaintain and continuously improve Notification Management System to cater for Lazada eLogistics clients, offering both customer and seller communications throughout the parcel journey. This reduces 20% of seller contacts to Partner Support Center for parcel confirmation, and improves lead time of agents solving tickets by 40%. Successfully led the integration of Notification Management System and new Lazada eLogistics service with Lazada new platforms (with respect to Alibaba-Lazada acquisition). The new Lazada eLogistics service ensures a continuous stream of updates from multiple internal systems (Transportation, Returns, Fulfillment, etc.) to be successfully conveyed to the platform via APIs, providing transparency to eCommerce platforms and their upstream systems.", "company": "Lazada eLogistics", "end_time": "2023-04-13T00:00:00Z", "industry": "Transportation & Logistics", "position": "Regional Operations Product Manager", "conf_score": 0.9380559850414887, "start_time": "2016-12-01T00:00:00Z"}, {"id": 17454, "detail": "Achievements/Tasks Functioned as lead Product Manager for Customer Experience and Finance verticals.\nSuccessfully led the integration of Lazada with SAP for Warehouse Inventory Management, Purchase Order and Sales order management; managed both internal and outsourcing development teams (Accenture) to interface SAP and Lazada internal\nOperational systems, in order to support Finance department with their needs.\nRevamped Refunds processing to automate SAP accounting records, and Finance Reconciliation to ease the cash (Cash On Delivery) handling process. This improves refund lead time by automating refund amount calculation, security by applying a flexible approval workflow, and assuring accuracy of Financial reporting in SAP. Designed and implemented Notification Management System which provides end-to-end solution for Lazada customer communications. This system interacts with multiple sources of data and uses multiple channels (emails, SMS, etc.) to provide trace- ability and transparency for customers on their shopping experience in Lazada, reducing nearly 30% of calls to Customer Service hotline.", "company": "Lazada Group", "end_time": "2016-12-31T00:00:00Z", "industry": "High Technology", "position": "Regional Operations Product Manager", "conf_score": 0.9174648511369632, "start_time": "2015-10-01T00:00:00Z"}, {"id": 17457, "detail": "Achievements/Tasks Functioned as project manager for Customer Experience vertical.\nDeep-dived in weekly NPS and complaint reports to understand customer needs and pain points, performing market research and bench marking, proposing initiatives and leading projects to improve Customer Experience in 6 Lazada ventures, especially in\nCustomer communications and self-service on the website (Help Center, Chat box), by collaborating with local business teams and regional tech teams.\nSuccessfully launched new Return policy and new Shipping fee policy across 6 ventures to improve not only customer experience during checkout and post delivery, but also seller experience with clear contract on payment and penalty alignment between Lazada and its sellers.", "company": "Lazada Group", "end_time": "2015-10-31T00:00:00Z", "industry": "High Technology", "position": "Regional Senior Associate Customer Experience", "conf_score": 0.9542590739672067, "start_time": "2013-12-01T00:00:00Z"}, {"id": 17459, "detail": "Achievements/Tasks Functioned as Marketing and Sales Executive, reported directly to Managing Director. Planned and ran Marketing and Sales campaigns to generate sales leads through social media and cold calls, and build brand awareness through networking events and email newsletters.\nDrafted and provided price proposals to the clients.", "company": "Sunbytes Ltd. Co.", "end_time": "2013-12-31T00:00:00Z", "industry": "Other", "position": "Marketing and Sales Executive", "conf_score": 0.9665185576724751, "start_time": "2012-08-01T00:00:00Z"}, {"id": 17460, "detail": "", "company": "The Court House of Ho Chi Minh City", "end_time": "2013-01-31T00:00:00Z", "industry": "Other", "position": "Court Interpreter", "conf_score": 0.9242015051317842, "start_time": "2011-01-01T00:00:00Z"}, {"id": 17461, "detail": "", "company": "Student Organization", "end_time": "2011-01-31T00:00:00Z", "industry": "Other", "position": "Exhibit Interpreter", "conf_score": 0.8970316950375007, "start_time": "2007-01-01T00:00:00Z"}], "address": "Ho Chi Minh City, Vietnam"}