{"skills": ["studio", "unity", "java", "css", "c++", "agile", "testing", "analysis", "database operation", "algorithm", "angular 2", "couchbase", "microsoft sql server", "reactjs", "design pattern", "synchronization", "mysql", "oracle", "es6", "file sharing", "jquery", "cakephp", "angular", "class", "microsoft", "orm", "marketing", "sql", "le", "c#", "elasticsearch", "object oriented design", "html5", "responsive", "javascript", "sentiment analysis", "system testing", "nativescript", "website development", "database", "client server", "implementation", "cache", "object oriented", "docker", "cloud", "debugging process", "restful", "hibernate", "frontend development", "php", "tdd", "android", "angularjs", "graphql", "mongodb", "multithreading", "tester", "spring", "management", "asp", "eclipse ide", "problem solving"], "fulltext": "STAN BIRYUKOV\n83 Phan Ke Binh\n|\nSaigon, Vietnam\n|\n+840702003731 |\nstan.biryukov88@gmail.com\nOBJECTIVE\nBe a valued team member for a company that provides an environment\nfor growth, to develop my skills and contribute to the success and\nincrease client base.\nTECH SKILLS\n–\nAgile/Scrum methodology;\n–\nFluent with JavaScript, Java, C#;\n–\nFramework and Libraries: ASP.NET MVC5, ASP.Net Core, Entity,\nSpring, Node.js, SASS (LESS), jQuery, Java Collections,\nCodeIgniter, Zend, CakePHP, TBB, Boost, STL, ReactJS, Angular\n(2,4,6,7), Nativescript;\n–\nDatabases: Microsoft SQL Server (2014, 2017), MySQL, Postgree,\nMongoDB, Couchbase, ElasticSearch;\n–\nIDE or software: VS 2015-2017 IDE, VS Code IDE, Eclipse IDE,\nAndroid Studio IDE, PHP Storm IDE, Unity 3D, Docker;\n–\nObject-Oriented design: Design Patterns.\nSOFT SKILLS\n–\nCreative problem-solving;\n–\nAbility to work to others’ design;\n–\nFocused at working during long working hours;\n–\nDesire and ability to contribute to the company’s success;\n–\nMulti-task oriented;\n–\nAble to convey the message clearly;\n–\nRespect to confidentiality of data;\n–\nFlexible at communication.\nCERTIFICATES\n–\nInternational English Language Testing System (IELTS) General\nTraining, C1 – 7.0 out of 9.0 ( TOEFL iBT: 94-101 ) overall,\nRef. Number – 18VN003807BIRS028G.\n2\nEXPERIENCE\nSenior Software Engineer,\nHitachi Consulting (former GSC Vietnam)\nJune 2016 – Present\nTP HCM, Vietnam\nHandle design, communication and implementation of the projects.\nImplementation conducted by PHP5 with CakePHP framework, Java EE\n(Spring, Hibernate), ASP.Net MVC5, with support of the jQuery,\nRender.js, HTML5 cache, ES6 features; databases MySQL and Postgree,\nand Microsoft SQL server 2014-2017. Handle communication and\nteaching English classes for Vietnamese colleges.\nSuccessfully accomplished:\n–\nFront-end and back end for property selling/buying for a\nmultinational Japanese client;\n–\nBack-end in project for Japanese client for automatization\ndaily routine processes as team leader with three programmers\non the team;\n–\nFront-end, and Back-end for North American project brought\nstability and clarity in the functional part by refactoring\nand optimizing;\n–\nJoined and working close with team on ML project for new\ncustomer, personally responsible for Sentiment Analysis\nalgorithm.\nSoftware Engineer, WebOnyx\nOctober 2015 – March 2016\nTP HCM, Vietnam\nManaged and improved internal team communication. Established\na more effective way for Tester and Designer work process that\nincreased the speed and feedback from developers, also contributed\nto company documentation and set up the debug feature for IDE,\nwhich dramatically reduced the time and simplified debugging\nprocess. Implemented responsive design and functionality of new\nmarketing website. Additionally, studied and became familiar with\nReactJS, Relay. GraphQL, SASS and improved knowledge about front-\nend development by learning deeper CSS, JQuery and responsive\ndesign.\nSoftware Engineer, Orbitsoft\nNovember 2013 – June 2015\nRostov-on-Don, Russia\nImplemented new UI modifications to the project by improving\nthe usability, increased customer satisfaction by providing\ncomprehensive solutions per theirs requests, implemented additional\nscripts which optimized data storing space, optimized MySQL queries\nwhich resulted in faster feedback and better user experience,\nsuccessfully accomplished as front-end migration part on AngularJS\n3\nas the back-end with accommodation Doctrine ORM. The process of the\ndevelopment relied on Agile with weekly updates for production and\nCRYSTAL methodologies. TDD methodology was used to ensure that all\nthe functional requirements were understood and delivered on or\nbefore schedule. All of this experience has helped me better\nunderstand the android platform and developed my skills with Couch\nBase, MongoDB, ElasticSearch, Zend Framework, CodeIgniter, PHP,\nAngular and jQuery.\nSoftware Engineer, Zuzex\nApril 2012 – March 2013\nRostov-on-Don, Russia\nImproved existed file sharing Android application by fixing\nthe issues, extended functionality by adding notification messages,\nversioning, and redesigned existed UI making it user friendlier.\nEstablished a good communication with web developers that helped to\nbring new features on server side and make stable previously\nimplemented ones. I have learned how to work with RESTful and\nClickBank APIs, which were used for client server communication,\nand license checking of .Net Forms windows optimizer application.\nSuccessfully accomplished file synchronization part of a cloud\nsharing application for PC platform by working closely with my team\nwhere we followed Agile, SCRUM, and XP methodologies. Gained\nvaluable experience in C++ multithreading with TBB and Boost\nlibraries, .NET 2.0 and Windows Forms, Android Native and NDK\ntoolset.\nDatabase Operations Technician, DataIntensityJune 2009 – April 2012\nRostov-on-Don, Russia\nDuring my work there I automatized daily routine tasks,\nbecame familiar with ORACLE DB infrastructure, trained new\nemployees that made my team most acknowledged and most reliable\namong others, by good guidance and wise management improved quality\nservice which brought many new clients, and greatly improved the\nsatisfaction of existing clients.\nEDUCATION\nDon State Technical University – Rostov-on-Don, Russia – Bachelor\nof Science in Computer and Information Technology\nREFERENCES\nTruong Dinh Tu\nSenior Front-end Developer, Hyakusenrenma Vietnam Co., Ltd\nturtle.fourth@gmail.com", "educations": [{"id": 5211, "gpa": null, "major": "Công nghệ thông tin", "school": "Don State Technical University", "diploma": "Bachelors", "end_time": null, "conf_score": 0.7257672695158321, "start_time": null, "picklist_major": "IT - Hardware/Networking", "major_categories": "Máy tính và công nghệ thông tin", "major_categories_detail": "Công nghệ thông tin"}], "experiences": [{"id": 17438, "detail": "TP HCM, Vietnam Handle design, communication and implementation of the projects.\nImplementation conducted by PHP5 with CakePHP framework, Java EE (Spring, Hibernate), ASP.Net MVC5, with support of the jQuery, Render.js, HTML5 cache, ES6 features; databases MySQL and Postgree, and Microsoft SQL server 2014-2017. Handle communication and teaching English classes for Vietnamese colleges.\nSuccessfully accomplished:\n- Front-end and back end for property selling/buying for a multinational Japanese client;\n- Back-end in project for Japanese client for automatization daily routine processes as team leader with three programmers on the team;\n- Front-end, and Back-end for North American project brought stability and clarity in the functional part by refactoring and optimizing;\n- Joined and working close with team on ML project for new customer, personally responsible for Sentiment Analysis algorithm.", "company": "Hitachi Consulting (former GSC Vietnam)", "end_time": "2023-04-13T00:00:00Z", "industry": "Other", "position": "Senior Software Engineer", "conf_score": 0.9125776658202421, "start_time": "2016-06-01T00:00:00Z"}, {"id": 17440, "detail": "TP HCM, Vietnam Managed and improved internal team communication. Established a more effective way for Tester and Designer work process that increased the speed and feedback from developers, also contributed to company documentation and set up the debug feature for IDE, which dramatically reduced the time and simplified debugging process. Implemented responsive design and functionality of new marketing website. Additionally, studied and became familiar with\nReactJS, Relay. GraphQL, SASS and improved knowledge about front- end development by learning deeper CSS, JQuery and responsive design.", "company": "WebOnyx", "end_time": "2016-03-31T00:00:00Z", "industry": "Other", "position": "Software Engineer", "conf_score": 0.9174648511369632, "start_time": "2015-10-01T00:00:00Z"}, {"id": 17442, "detail": "Rostov-on-Don, Russia Implemented new UI modifications to the project by improving the usability, increased customer satisfaction by providing comprehensive solutions per theirs requests, implemented additional scripts which optimized data storing space, optimized MySQL queries which resulted in faster feedback and better user experience, successfully accomplished as front-end migration part on AngularJS as the back-end with accommodation Doctrine ORM. The process of the development relied on Agile with weekly updates for production and\nCRYSTAL methodologies. TDD methodology was used to ensure that all the functional requirements were understood and delivered on or before schedule. All of this experience has helped me better understand the android platform and developed my skills with Couch Base, MongoDB, ElasticSearch, Zend Framework, CodeIgniter, PHP, Angular and jQuery.", "company": "Orbitsoft", "end_time": "2015-06-30T00:00:00Z", "industry": "Other", "position": "Software Engineer", "conf_score": 0.9174648511369632, "start_time": "2013-11-01T00:00:00Z"}, {"id": 17444, "detail": "Rostov-on-Don, Russia Improved existed file sharing Android application by fixing the issues, extended functionality by adding notification messages, versioning, and redesigned existed UI making it user friendlier.\nEstablished a good communication with web developers that helped to bring new features on server side and make stable previously implemented ones. I have learned how to work with RESTful and\nClickBank APIs, which were used for client server communication, and license checking of .Net Forms windows optimizer application.\nSuccessfully accomplished file synchronization part of a cloud sharing application for PC platform by working closely with my team where we followed Agile, SCRUM, and XP methodologies. Gained valuable experience in C++ multithreading with TBB and Boost libraries, .NET 2.0 and Windows Forms, Android Native and NDK toolset.", "company": "Zuzex", "end_time": "2013-03-31T00:00:00Z", "industry": "Other", "position": "Software Engineer", "conf_score": 0.9174648511369632, "start_time": "2012-04-01T00:00:00Z"}, {"id": 17445, "detail": "Rostov-on-Don, Russia During my work there I automatized daily routine tasks, became familiar with ORACLE DB infrastructure, trained new employees that made my team most acknowledged and most reliable among others, by good guidance and wise management improved quality service which brought many new clients, and greatly improved the satisfaction of existing clients.", "company": "Zuzex", "end_time": "2012-04-30T00:00:00Z", "industry": "Other", "position": "Database Operations Technician, DataIntensity", "conf_score": 0.8086621310791741, "start_time": "2009-06-01T00:00:00Z"}], "address": "83 Phan Ke Binh\n|\nSaigon, Vietnam"}