{"skills": ["digital marketing", "enterprise", "accounting", "marketing", "futures", "investments", "implementation", "business activity", "management", "drafting contracts"], "fulltext": "HO CHI MINH CITY UNIVERSITY OF LAW\n2011 - 2015\n EDUCATION\nDEGREE BACHELOR : INTERNATIONAL LAW\nAdd: 02 Nguyen Tat Thanh, ward 12, District 4, HCMC\nGLOBAL JET COMMERCE COMPANY LIMITED\n02/2019 - present\nJAPFA COMFEED VIETNAM CO., LTD -\nBRANCH LONG AN\n10/2017 - 02/2019\n EXPERIENCE\nLEGAL & COMPLIANCE SUPERVISOR\nJET COMMERCE is an e-commerce enabler in both B2B and B2C sectors.\nWe are a member of Global Jet Ecommerce from Indonesia. We also\nprovide one-stop B2C e-commerce service solutions to brands and sellers.\nOur services includes Store Operation, Digital Marketing, Creative Design,\nPhoto and Video, Customer Relation Management and Fulfillment.\nLegal and Compliance tasks: \n- Supervising and advising on the implementation of the legal procedures\nof the companyt\n- Drafting, reviewing and adjusting the contract, the Memorandum of\nUnderstanding, the progress of executing the contract.\n- Drafting, managing, classifying and tracking records and resolutions of\nthe company\n- Advising on other legal issues arising in business activities including new\ninvestment activities, adjustment or expansion of services or projects.\n- Conducting request for issuance and amendment of Enterprise\nRegistration Certificate (ERC), Investment Registration Certificate (IRC),\nBusiness License or else\n- Consulting and updating new law and regulations for other departments\n- and other tasks assigned by General Director \nDirect report: to General Director (Chinese)\nLEGAL SUPERVISOR\nJAPFA is a 100%  Singaporean capital company specializing in\nmanufacturing animal feed product, livestock breeding, poultry and meat\nprocessing with over 1200 employees and 15 branches in Vietnam\nCompliance tasks: \n- Supervising and advising on the implementation of the legal procedures\nof the branches on daily operation.\n- Ensuring environmental permits and fire prevention license of the\nfactories.\n- and other tasks assigned by Legal Director and BOM\nLegal tasks:\n- Drafting, reviewing and adjusting the contract, the Memorandum of\nUnderstanding, the progress of executing the contract.\n- Drafting, managing, classifying and tracking records and resolutions of\nthe Member's Council and its branches\n- Participating in monitoring and supporting the handling of civil disputes\n- Getting authorization for attending the local court for providing envidence\nand proceeding for company's litigations..\n- Advising on other legal issues arising in business activities including new\nDINH CONG KHOI\nBACHELOR OF LAW\n7th March 1993\nGentle: MALE\n+84 97 717 0003\n CongKhoi.Legal@gmail.com\nCurrent address: Khanh Hoi\nStreet, District 4, HCMC.\nHometown: Van Ninh district,\nKhanh Hoa province\nABOUT ME\nPresenting and communicating\nare my strongest skills. Always\nbeing confident and proactive in\ncommunicating with crowds\nand strangers as well as  get\nalong with the new environment.\nI get accustom to business trips,\ntherefore, I'm not afraid of going\nout for work. As a passionate\nand funny guy in both work and\noutside activities this helps me\nfeel easy to get along with the\ncolleagues. Funny and\nenthusiastic for team building\nactivities with coworkers.\nTHE HOBBIES:\n- Watching movie\n- Playing game\n- Swimming\n- Reading Manga\n- Drinking beer with friends\ninvestment activities, adjustment or expansion of services or projects.\n- Conducting request for issuance and amendment of Enterprise\nRegistration Certificate (ERC), Investment Registration Certificate (IRC),\nBusiness License or else\n- Consulting and updating new law and regulations for other departments\nand BOM\n- and other tasks assigned by Manager and BOM\nDirect report: to Legal Director (Vietnamese) or Members's council\n(Singaporean and Indonesian) depend on assigned task\nES NETWORKS VIETNAM CO., LTD\n07/2015 - 09/2017\nLEGAL CONSULTANT\nEs Networks Vietnam Co., Ltd is a 100% Japanese capital company,\nspecializing in enterprise establishment, tax and accounting which has\nbusiness as a lawfirm for Japanese cliens.\nMain responsibility\n- Consulting legal information on conditions, remarks on the client's\nexpected industry and invesment plan.\n- Applying for issuance and amendment of Investment Registration\nCertificate (ERC). \n-  Applying for issuance and amendment of Investment Registration\nCertificateEnterprise Registration Certificate (IRC).\n- Requesting for Enterprise Visa, Work Permit and Temporary resident card\nof foreigner\n- Supporting to supervise and advise on the application for certification of\nfire prevention for customers.\n- Researching and consulting about legal opinions on real estate\ninvestment in Vietnam.\n- and other tasks according to client's request\nDirect report: to Legal Manager  (Vietnamese)\nPLANS IN NEAR FUTURE\n- To study one more language either Japanese or French\n- To study some courts of Legal in-house at Ho Chi Minh city University of\nLaw or other reputed training centers.\n- To archive Practising Certificate for Lawyers or Master Degree of Law", "educations": [{"id": 5214, "gpa": null, "major": "Luật quốc tế", "school": "HO CHI MINH CITY UNIVERSITY OF LAW", "diploma": "Bachelors", "end_time": "2015-01-01T00:00:00Z", "conf_score": 0.7625990117186952, "start_time": "2011-01-01T00:00:00Z", "picklist_major": "Legal", "major_categories": "Pháp luật", "major_categories_detail": "Luật"}], "experiences": [{"id": 17447, "detail": "JET COMMERCE is an e-commerce enabler in both B2B and B2C sectors.\nWe are a member of Global Jet Ecommerce from Indonesia. We also provide one-stop B2C e-commerce service solutions to brands and sellers.\nOur services includes Store Operation, Digital Marketing, Creative Design, Photo and Video, Customer Relation Management and Fulfillment. Legal and Compliance tasks:\n- Supervising and advising on the implementation of the legal procedures of the companyt\n- Drafting, reviewing and adjusting the contract, the Memorandum of\nUnderstanding, the progress of executing the contract.\n- Drafting, managing, classifying and tracking records and resolutions of the company\n- Advising on other legal issues arising in business activities including new investment activities, adjustment or expansion of services or projects.\n- Conducting request for issuance and amendment of Enterprise Registration Certificate (ERC), Investment Registration Certificate (IRC), Business License or else\n- Consulting and updating new law and regulations for other departments\n- and other tasks assigned by General Director Direct report: to General Director (Chinese)", "company": "GLOBAL JET COMMERCE COMPANY LIMITED", "end_time": "2023-04-13T00:00:00Z", "industry": "Trade", "position": "LEGAL & COMPLIANCE SUPERVISOR", "conf_score": 0.959177526346337, "start_time": "2019-02-01T00:00:00Z"}, {"id": 17448, "detail": "JAPFA is a 100% Singaporean capital company specializing in manufacturing animal feed product, livestock breeding, poultry and meat processing with over 1200 employees and 15 branches in Vietnam Compliance tasks:\n- Supervising and advising on the implementation of the legal procedures of the branches on daily operation.\n- Ensuring environmental permits and fire prevention license of the factories.\n- and other tasks assigned by Legal Director and BOM Legal tasks:\n- Drafting, reviewing and adjusting the contract, the Memorandum of\nUnderstanding, the progress of executing the contract.\n- Drafting, managing, classifying and tracking records and resolutions of the Member's Council and its branches\n- Participating in monitoring and supporting the handling of civil disputes\n- Getting authorization for attending the local court for providing envidence and proceeding for company's litigations..\n- Advising on other legal issues arising in business activities including new investment activities, adjustment or expansion of services or projects.\n- Conducting request for issuance and amendment of Enterprise Registration Certificate (ERC), Investment Registration Certificate (IRC), Business License or else\n- Consulting and updating new law and regulations for other departments and BOM - and other tasks assigned by Manager and BOM Direct report: to Legal Director (Vietnamese) or Members's council\n(Singaporean and Indonesian) depend on assigned task", "company": "JAPFA COMFEED VIETNAM CO., LTD - BRANCH LONG AN", "end_time": "2019-02-28T00:00:00Z", "industry": "Other", "position": "LEGAL SUPERVISOR", "conf_score": 0.9542271074073599, "start_time": "2017-10-01T00:00:00Z"}, {"id": 17449, "detail": "Es Networks Vietnam Co., Ltd is a 100% Japanese capital company, specializing in enterprise establishment, tax and accounting which has business as a lawfirm for Japanese cliens.\nMain responsibility\n- Consulting legal information on conditions, remarks on the client's expected industry and invesment plan.\n- Applying for issuance and amendment of Investment Registration Certificate (ERC). - Applying for issuance and amendment of Investment Registration CertificateEnterprise Registration Certificate (IRC). - Requesting for Enterprise Visa, Work Permit and Temporary resident card of foreigner\n- Supporting to supervise and advise on the application for certification of fire prevention for customers.\n- Researching and consulting about legal opinions on real estate investment in Vietnam. - and other tasks according to client's request\nDirect report: to Legal Manager (Vietnamese)", "company": "ES NETWORKS VIETNAM CO., LTD", "end_time": "2017-09-30T00:00:00Z", "industry": "High Technology", "position": "LEGAL CONSULTANT", "conf_score": 0.959177526346337, "start_time": "2015-07-01T00:00:00Z"}], "address": "Van Ninh district, Khanh Hoa province"}