{"skills": ["budgeting", "business decision", "investments", "team management", "analysis", "finance", "cima", "cash management", "accounting standards", "strategic planning", "cfa", "association of chartered certified accountants (ac", "security", "problem solving", "project management", "accounting", "making decision", "le", "sales", "internal audit", "data collection", "banking", "auditing", "reengineering", "cfo", "critical thinking", "analyst", "ifrs", "management", "risks"], "fulltext": "Tran Thi Hoai Thuong \n111/7 Tan Hai street, Tan Binh District, Ho Chi Minh City \nTelephone: 0907 163 018 - Email: hoaithuong8503@yahoo.com \n CV – Tran Thi Hoai Thuong \n1 \nCurriculum Vitae \nName \nTran Thi Hoai Thuong \nNationality \nVietnamese \nYears with the Auditing Firm \n3 years \nPosition at the Auditing Firm \nAudit Senior \nYears with the Financial Institution \n9 years \nPosition at the Corporate \nChief Accountant/Financial Controller \nGOAL WORKINGS \nA position as effective officer and decision- makers specialized in financial area can play a \nleading role in the professional international company. \nUndertaken new challenges and tasks ahead to apply my experiences, have a chance to \nbroaden my knowledge and give value contribution in the success of organization. \nAn experienced Finance professional with exposure to Vietnamese markets and practices. \nHighly adept with investment and finance with sharp business acumen \nGood salary and the promotion prospects. \n           PROFESSIONAL  QUALIFICATIONS \nQualification \nName of Professional Institute \nACCA Member \nAssociation of Chartered Certified \nAccountants (“ACCA”) \nCFA (Level 1) \nChartered Financial Analysis \nCIMA \nChartered Institute of Management \nAccountants \nTran Thi Hoai Thuong \n111/7 Tan Hai street, Tan Binh District, Ho Chi Minh City \nTelephone: 0907 163 018 - Email: hoaithuong8503@yahoo.com \n CV – Tran Thi Hoai Thuong \n2 \n  WORK EXPERIENCE \nMay 2018 to now, Finance Manager, Shopee Ltd. \n(manages ecommerce platform Shopee.vn) \n Set up a finance and accounting departments, build new accounting process to make it more \neffective and efficient \n Consulted to Managing Directors in business decision making with strong financial \nevidences. \n Liaise with Regional Financial Controller on management report, review and analyse \nfinancial statement, propose action plans for significant movements. \n Manage working capital ratio to ensure the Company run smoothly and effectively with \nfund availability. \n Review cashflow management, cash projection, budget/forecast planning. \n Manage banking relationships, ensure adequate control, preservation and usage of cash, and \nactively participate in cash flow forecast. \n Work with Group Compliance on internal control process, identify control deficiencies and \npropose internal controls to maintain financial security \n Work cross functionally with Operations teams to create meaningful, robust SOPs that are \nscalable to support our growth. \n Engage in strategic planning and business development. \n Interface with corporate auditors in all Vietnam payroll, tax compliance, local accounting \nstandards and other administrative matters \nFebruary 2015 to April 2018, Financial Controller, Lazada Express Vietnam Company \nLimited \n Set up a finance and accounting departments, led 13 members to manage finance and \naccounting tasks.  \n Be the key member in SAP migration project for Company; worked closely with Regional \nteam for all updated and maintain strong SAP system in local. \n         ACADEMIC QUALIFICATIONS \nQualification \nYear \nUniversity \nBachelor of Economics \n2007 \nUniversity of Economics Ho Chi Minh \nCity – Good Grade \nBachelor of English \n2008 \nThe  University  of  Science  &  Social \nHumanity \nMaster in Economics of Banking and \n2014 \nCFVG    European    Excellence    in \nFinance \nManagement Education \nTran Thi Hoai Thuong \n111/7 Tan Hai street, Tan Binh District, Ho Chi Minh City \nTelephone: 0907 163 018 - Email: hoaithuong8503@yahoo.com \n Establish robust financial governance and oversee the company’s financial and accounting \nactivities in accordance with policies and procedures for the issuance of financial statements \nand other reports as required, providing clear visibility on plans and business performance. \n Design, implement and maintain accounting and operational policies and procedures for the \nbusiness. Work cross functionally with Operations teams to create meaningful, robust SOPs \nthat are scalable to support our growth. \n Set up yearly budget and quarterly forecast; Run a clear budget process in Vietnam in \nalignment with shareholders’ budgeting. \n Review and interpret business performance and operating results against short-term and \nlong-term budgets and targets; make specific recommendations on cost-reduction and \nprofit-improvement. \n Design financial models to analyse investment effectiveness to define annual and propose \nimprovement. \n Manage good banking relationships; apply new service and technology of banking to \nimprove cashflow management and reduce the risk of cash collection (ensure riders of \nCompany to be priority list of Techcombank network and pick up services for main Hubs) \n Set up adequate control, preservation and usage of cash, and actively participate in cash \nflow forecast.  \n Reported to Group CFO and working closely with Regional Finance team to build the \naccounting and finance process for Group, main contact for local venture to ensure the \nprocess applied effectively and efficiency. \n Interface with corporate auditors in all Vietnam payroll, tax compliance, local accounting \nstandards and other administrative matters \nDecember 2013 to January 2015, Finance Analyst, Cummins DKSH Viet Nam \n(Joint Venture of DKSH Holding VietNam and Cummins Sales and Services Singapore \nPte. Ltd) \n \nAnalysed financial information to produce forecasts of business, and economic conditions \nfor use in making relevant decisions with strategy of business \n \nResponsible for financial data of monthly closing. \n \nAnalysed the trend and explaining differences with the actual cost for company \nperformance.\n \nPerson in charge for monthly management reports and all documents for board presentation \nunder Cummins and DKSH Holding’s rules. Support Managing Director for organisation, \npresentation and giving explanations for concerns on business performance at BOD \nmeeting. \n \nLed 3 juniors to prepare for quarterly internal audit, responsible for improving effectiveness \nand efficiency of internal process. \n \nGood communication with management team, key customers and suppliers, local authority. \n CV – Tran Thi Hoai Thuong \n3 \nTran Thi Hoai Thuong \n111/7 Tan Hai street, Tan Binh District, Ho Chi Minh City \nTelephone: 0907 163 018 - Email: hoaithuong8503@yahoo.com \nFebruary 2011 to November 2013, Chief Accountant, Saigon South Residences JSC and \nAdministrative Office in Ho Chi Minh City of Indochina Land River Garden Ltd \n(Projects are developed by Indochina Land Viet Nam) \n Responsible of managing the effective operation of accounting department.  \n Analysing the fluctuation of real estate market, the financial considerations and the SWOT \nof project.  \n Responsible for monthly financial and managerial reports timely.  \n Prepared rolling forecast, the budget report, analysed the trend and explaining differences \nwith the actual cost for company performance. \n Good communication with investors, tax authority, bank officer and administrative \nagencies. \n Work directly with Tax authority (HCM tax Department) for 3 VAT returns and 1 Tax \nfinalisation with good result. \nMay 2010 to January 2011, Financial Analyst, Savills Vietnam \n Good communication with the management of client about the general information of \nproject.  \n Responsible for data collection of real estate market.  \n Analysing the financial considerations, the demand of market, the SWOT of project and \nperforming the suitable assumption and methodology.  \n Responsible for report timely, present the result of project and best recommendations for \nclient.  \n Controlling the budget and working under high pressure  \nAugust 2007 to Apr 2010, Audit Senior, KPMG Vietnam \n Conducted financial audits for multinational clients (+30 engagements) from a wide range \nof industries including Manufacturing (Kirin Group, Sojitz Group), Retails (Mertro Cash \nand Carry Vietnam – Metro Group), Pharmacy (Da Nang Pharmacy) and Services \n(Indochina Group), Airlines (Jestar Airways), Education (International School Ho Chi Minh \nCity). Best understanding the client’s industry, assessment the internal control, identifying \nthe weaknesses and performing the suitable audit procedures  \n Executed duties as Audit Senior: scheduled field work, budgeted projects, coordinated \nrelease of audit reports, presented findings to clients, addressed queries from partners.  \n Analytical, interpretation, solving problems and giving the less experienced staff the best \nadvices in the audit and accounting issues  \n Advised on reengineering financial and operational information system to ensure smooth \nconversions from local accounting standards to IFRS reporting for multiple clients.  \n In the top 1% employees rated as Exceptional Performance in 3 consecutive years.  \n CV – Tran Thi Hoai Thuong \n4 \n111/7 Tan Hai street, Tan Binh District, Ho Chi Minh City \nTelephone: 0907 163 018 - Email: hoaithuong8503@yahoo.com \n CV – Tran Thi Hoai Thuong \n5 \nL A N G U A G E A B I L I T Y \nLanguage \nReading \nWriting \nSpeaking \nListening \nVietnamese \nNative \nEnglish \nGood \nA B I L I T I E S \nHave the good analysis skill, project management, problems solving, critical thinking. \nWorking under high pressure and controlling outstanding works in order to meet \ndeadline. Aggressive, enthusiastic and self - disciplined person. \nHigh team spirits and internal cooperation; have a leadership \nA versatile leader with good track record in team building and management. \n Certification \nI, the undersigned, certify that to the best of my knowledge and belief, this data correctly \ndescribes me, my qualifications and my experience. \nTran Thi Hoai Thuong ", "educations": [{"id": 5249, "gpa": null, "major": "English", "school": "The University of Science & Social Humanity", "diploma": "Masters", "end_time": "2008-01-01T00:00:00Z", "conf_score": 0.8478779783406631, "start_time": null, "picklist_major": "Other", "major_categories": "", "major_categories_detail": ""}, {"id": 5248, "gpa": null, "major": "Kinh tế", "school": "University of Economics Ho Chi Minh", "diploma": "Bachelors", "end_time": "2007-01-01T00:00:00Z", "conf_score": 0.8478779783406631, "start_time": null, "picklist_major": "Economical", "major_categories": "Khoa học xã hội và hành vi", "major_categories_detail": "Kinh tế học"}], "experiences": [{"id": 17561, "detail": "(manages ecommerce platform Shopee.vn) Set up a finance and accounting departments, build new accounting process to make it more effective and efficient\nConsulted to Managing Directors in business decision making with strong financial evidences.\nLiaise with Regional Financial Controller on management report, review and analyse financial statement, propose action plans for significant movements.\nManage working capital ratio to ensure the Company run smoothly and effectively with fund availability.\nReview cashflow management, cash projection, budget/forecast planning.\nManage banking relationships, ensure adequate control, preservation and usage of cash, and actively participate in cash flow forecast.\nWork with Group Compliance on internal control process, identify control deficiencies and propose internal controls to maintain financial security\nWork cross functionally with Operations teams to create meaningful, robust SOPs that are scalable to support our growth.\nEngage in strategic planning and business development.\nInterface with corporate auditors in all Vietnam payroll, tax compliance, local accounting standards and other administrative matters", "company": "Shopee Ltd.", "end_time": "2023-04-13T00:00:00Z", "industry": "Other", "position": "Finance Manager", "conf_score": 0.8599408253616709, "start_time": "2018-05-01T00:00:00Z"}, {"id": 17563, "detail": "Set up a finance and accounting departments, led 13 members to manage finance and accounting tasks.\nBe the key member in SAP migration project for Company; worked closely with Regional team for all updated and maintain strong SAP system in local.", "company": "Lazada Express Vietnam Company Limited", "end_time": "2018-04-30T00:00:00Z", "industry": "High Technology", "position": "Financial Controller", "conf_score": 0.8566071148845527, "start_time": "2015-02-01T00:00:00Z"}, {"id": 17565, "detail": "Analysed financial information to produce forecasts of business, and economic conditions for use in making relevant decisions with strategy of business\nResponsible for financial data of monthly closing.\nAnalysed the trend and explaining differences with the actual cost for company performance.\nPerson in charge for monthly management reports and all documents for board presentation under Cummins and DKSH Holding’s rules. Support Managing Director for organisation, presentation and giving explanations for concerns on business performance at BOD meeting.\nLed 3 juniors to prepare for quarterly internal audit, responsible for improving effectiveness and efficiency of internal process.\nGood communication with management team, key customers and suppliers, local authority.", "company": "Cummins DKSH Viet Nam (Joint Venture of DKSH Holding VietNam and Cummins Sales and Services Singapore Pte. Ltd)", "end_time": "2015-01-31T00:00:00Z", "industry": "Other", "position": "Finance Analyst", "conf_score": 0.8468893701112087, "start_time": "2013-12-01T00:00:00Z"}, {"id": 17567, "detail": ". Analysing the fluctuation of real estate market, the financial considerations and the SWOT of project.\nResponsible for monthly financial and managerial reports timely.\nPrepared rolling forecast, the budget report, analysed the trend and explaining differences with the actual cost for company performance.\nGood communication with investors, tax authority, bank officer and administrative agencies.\nWork directly with Tax authority (HCM tax Department) for 3 VAT returns and 1 Tax finalisation with good result.", "company": "Indochina Land River Garden Ltd", "end_time": "2013-11-30T00:00:00Z", "industry": "Real Estate", "position": "Chief Accountant", "conf_score": 0.7475330858119694, "start_time": "2011-02-01T00:00:00Z"}, {"id": 17568, "detail": "Good communication with the management of client about the general information of project.\nResponsible for data collection of real estate market.\nAnalysing the financial considerations, the demand of market, the SWOT of project and performing the suitable assumption and methodology.\nResponsible for report timely, present the result of project and best recommendations for client.\nControlling the budget and working under high pressure", "company": "Savills Vietnam", "end_time": "2011-01-31T00:00:00Z", "industry": "Real Estate", "position": "Financial Analyst", "conf_score": 0.9174648511369632, "start_time": "2010-05-01T00:00:00Z"}, {"id": 17569, "detail": "Conducted financial audits for multinational clients (+30 engagements) from a wide range of industries including Manufacturing (Kirin Group, Sojitz Group), Retails (Mertro Cash and Carry Vietnam - Metro Group), Pharmacy (Da Nang Pharmacy) and Services (Indochina Group), Airlines (Jestar Airways), Education (International School Ho Chi Minh City). Best understanding the client’s industry, assessment the internal control, identifying the weaknesses and performing the suitable audit procedures\nExecuted duties as Audit Senior: scheduled field work, budgeted projects, coordinated release of audit reports, presented findings to clients, addressed queries from partners.\nAnalytical, interpretation, solving problems and giving the less experienced staff the best advices in the audit and accounting issues\nAdvised on reengineering financial and operational information system to ensure smooth conversions from local accounting standards to IFRS reporting for multiple clients.\nIn the top 1% employees rated as Exceptional Performance in 3 consecutive years.", "company": "KPMG Vietnam", "end_time": "2010-04-30T00:00:00Z", "industry": "Non-banking", "position": "Audit Senior", "conf_score": 0.9027481999492581, "start_time": "2007-08-01T00:00:00Z"}], "address": "111/7 Tan Hai street, Tan Binh District, Ho Chi Minh City"}