{"skills": ["arbitration", "payment", "telecommunication equipment", "investments", "structure", "streaming", "investment banking", "equity", "security", "banking", "medium", "live streaming", "security issue"], "fulltext": " Professional Profile \nVu Hong Nhung  \nHo Chi Minh City, Vietnam \nEmail: nhungvu3792@gmail.com \nTel: 0812258220 \nQualifications \nBachelor of Law, Commercial Law \n2014 \nHo Chi Minh City University of Law, Ho Chi Minh City, Vietnam \nCertificate of Lawyer Training \n2017 \nHo Chi Minh City Judicial Academy, Ho Chi Minh City, Vietnam \nPractice \nI have been practicing law in Vietnam since 2014. My areas of expertise include \ncorporate, foreign investment, banking, real estate, construction, employment \nand social media. I have litigated and arbitrated several commercial and labor \ndisputes. Most recently, I have been working as an in-house legal consultant for \nan international corporation featuring live-streaming platforms. \nNotable Engagements in Vietnam \n \nAdvised a foreign invested sub-contractor (a leading company in construction \nand construction materials) on issues regarding a building construction project \nwith a value of USD 400 million. \n \nAdvised a local authority on issues regarding an ODA waste-water treatment \nproject. \n \nAdvised and prepared negotiations on distributing telecommunication equipment \nbetween a leading global manufacturer and a local distributor with the estimated \ntransaction value of VND 20 billion a year. \n \nAdvised a foreign invested company (a leading mining company) regarding \nequity structure and foreign loans with a total transaction value of over USD 2 \nmillion. \n \nAdvised a foreign invested company (a leading Vietnamese telecommunication \nservices company) on M&A and BCC transactions.  \n2 \n \nAdvised a foreign invested bank on legal aspects of their business in Vietnam, \nprepared the training program and participated in training the bank’s staffs in the \nfield of law. \n \nAdvised a foreign invested company (a construction material distributor) in a \ndispute with a provincial tax authority relating to tax incentives. \n \nAdvised a foreign invested company in a Contract for Construction– for Building \nand Engineering Works (the size of the transaction was USD 18 million). \n \nAdvised a publicly listed company on securities issues and internal compliance. \n \nAdvised a transfer of land lease in an industrial zone with a total transaction \nvalue of VND30 billion. \n \nRepresented a state owned company before a competent court in connection with \na claim of over VND200 billion arising out of a good purchase agreement with \nother local companies. \n \nRepresented a foreign invested company (a global leader in construction \nmaterials) before the Vietnam International Arbitration Centre (VIAC) in \nconnection with a claim on payment of construction materials. \n \nRepresented several employees before a competent court regarding disputes with \ntheir employer (a transnational construction company) with a total claim of VND \n4.5 billion.  \nPositions Held \nLegal Consultant – Avenir Legal, a Law Firm incorporated in Vietnam (2014 – \n2017) \nPracticing Lawyer – Avenir Legal (2017 – 2018) \nLegal Consultant – Huya Limited (Nimo TV), an international corporation \nfeaturing live-streaming (2018 – 2019) \nLanguages  \nEnglish and Vietnamese ", "educations": [{"id": 5236, "gpa": null, "major": "Luật", "school": "Ho Chi Minh City University of Law", "diploma": "Bachelors", "end_time": "2014-01-01T00:00:00Z", "conf_score": 0.7551834254203837, "start_time": null, "picklist_major": "Legal", "major_categories": "Pháp luật", "major_categories_detail": "Luật"}], "experiences": [{"id": 17521, "detail": "an international corporation featuring live-streaming (20", "company": "Huya Limited (Nimo TV),", "end_time": "2019-01-31T00:00:00Z", "industry": "Other", "position": "Legal Consultant", "conf_score": 0.7897513794629749, "start_time": "2018-01-01T00:00:00Z"}, {"id": 17522, "detail": "", "company": "Avenir Legal", "end_time": "2018-01-31T00:00:00Z", "industry": "Other", "position": "Practicing Lawyer", "conf_score": 0.7982161229421119, "start_time": "2017-01-01T00:00:00Z"}, {"id": 17523, "detail": "", "company": "Avenir Legal, a Law Firm incorporated in Vietnam", "end_time": "2017-01-31T00:00:00Z", "industry": "Other", "position": "Legal Consultant", "conf_score": 0.7982161229421119, "start_time": "2014-01-01T00:00:00Z"}], "address": "Ho Chi Minh City, Vietnam"}