{"skills": ["search", "project tracking", "studio", "phonegap", "java", "vba", "desktop", "window ce", "ajax", "oracle", "entity framework", "jquery", "accounting", "sql", "visual studio", "c#", "stack", "bug fixing", "wsdl", "database", "accounting softwares", "manage staff", "excel", "ams", "hibernate", "software development", "angularjs", "management", "translator"], "fulltext": "Trần Kim Cường\nFul-stack Developer | Male | 22/06/1990\nKinh Nghiệm Làm\nViệc\n6 năm\nCông ty gần đây nhất\nFul-stack Developer tại Công ty TNHH\nCông ty TNHH\nMTV Phần mềm Auvietsoft\nBằng cấp cao nhất\nCử nhân\nNgôn ngữ\nEnglish\nEnglish - Trung cấp\nEmail cuong.tran.vnwork@gmail.com cuong.tran.vnwork@gmail.com\nĐiện thoại\n0899167795\nĐịa chỉ\n21/1/10 Lý Thường Kiệt, Phường 4,\nQuận Gò Vấp, Tp HCM, Quận Gò\nVấp, Thành phố Hồ Chí Minh\nTHÔNG TIN CHUNG\nI was a student of the Science University. I graduated in October\n2013.\nI can work alone or team-work well.\nResearch new technology fast.\nResponsibility with my work doing.\nI often listen music, travelling when I have free-time.\nI am saturate, friendly, laborious.\nKỸ NĂNG\nKỸ NĂNG\nEntity Framework\nWeb Service\nMacro Excel VBA\nKINH NGHIỆM LÀM VIỆC\n06/2017 - Present\nFul-stack Developer\nCông ty TNHH MTV Phần mềm Auvietsoft\nReceive requests from the customer. Then, analyze requirement\nwith the manager. Create tables for compatibility. After, code\nmodule with language C# using Entity Framework 6, AutoMapper to\nmapping database into object that can use in Front-end.  The\nmodules that I worked in company, such as: - Price Quotation:\nmodule for end-user can input price of offer product. The quotation\nwill repeat again until both agree with price. Quotation will change\nstatus is confirm. Besides, when any things end-user can quote price\nagain. - Work Order: module for end-user can input process to\nproduce, create BOM, create Delivery Note, create Receivng Note -\nFactory Specification & Client Specification: Two screen help end-\nuser chat to report quality of product and confirm price to buy.\n11/2016 - 06/2017\n.Net Developer\nK&G Technology\nBuild web application run on Ipod device. This is system\nmanagement that using scan product, search product, scan return\nand scan shipping all everything process on Ipod device. Web\napplication must be run browser Chrome.\nWe used tools to develop as SQL Server 2000, Visual Studio 2013.\nTechnology used for the projects as MVC4, Ajax, Jquery, 3Layers.\nCoding languages as C#\nRun IIS 6.0\nBesides, I joined Tanaka project, my working in the project that\nfixing bug about UI support to release product on-times.\nWe used tools to develop as SQL Server 2014, Visual Studio 2015.\nTechnology used for the projects as 3Layers.\nCoding languages as C#.\n04/2014 - 05/2016\nSoftware Engineer\nAureole Information Technology Inc.(AIT)\nAfter finsihed Fujinet’s training, I applied in Aureole Information\nTechnology in April 2014.\nThe first project that I worked. That is BTMV-Pharse 1.\n       About BTMV-Pharse 1 such as:\nMy group had 4 members such as 1 Sub PM, 1 Translator, 2 PG. The\nproject progressed about 3 months. In this pharse, we coded in\nhandy terminal, that meaned user would use to check quality of tire\nthat produced in Bridgestone factory in Hai Phong city.\nWe used tools to develop as SQL Server 2012, Visual Studio 2008.\nTechnology used for project as Web Services(WSDL).\n.Net Framework 3.5, Windows CE.\nCoding language as VB.Net.\nRun Web Services to deloy as IIS 7.5.\n       After BTMV-Pharse 1 was BTMV-Pharse 2, about BTMV-Pharse\n2:\nOur task was convert Bridgestone System Management from VB6 to\nVB.Net and Oracle 10g to SQL Server 2014. So, quantity work in the\nproject very large, we lost 4 months to finshed this project. We had\nmany the problem in convert Oracle to SQL Server. The query\nstatement, we could fix syntax to SQL Server could run well.\nBesides, we needed writing all store procedure.\nWe used tools to develop as SQL Server 2014, Visual Studio 2008.\nTechnology used for project as nothing.\n.Net Framework 3.5.\nCoding language as VB.Net.\n       At time, with BTMV-Pharse 2, I worked project Eiken-Kintai.\nAbout Eiken-Kintai:\nThis was a project of the Japanese customer, they used project to\nmanage staff in the company, time-in and time-out with rules of\ncompany, calendar for user see and applied absence days of\nthemselves, etc…\nWe used tools to develop as Eclipse Indigo, PL/SQL(Oracle SQL\nDeveloper).\nTechnology used for project as Struts1, Hibernate.\nJre 1.6(Jre 1.5), Oracle 11g2.\nCoding language as Java.\nRun Server to deloy as Oracle OC4J Standalone Server.\n       Parallel with Eiken-Kintai, I worked the project standard Kintai.\nAbout Kintai:\nThis is the standard project to improve for the other project for\nJapanese customers. System manage all staff from absence days,\novertime days, calculate salary of staff, all offline days staff,\nmanage project, manage task and mange time to progress\nproject(tracking), etc…\nWe used tools to develop as Eclipse Indigo, PL/SQL(Oracle SQL\nDeveloper).\nTechnology used for project as Struts1, Hibernate.\nJre 1.6(Jre 1.5), Oracle 11g2.\nCoding language as Java.\nRun Server to deloy as Oracle OC4J Standalone Server.\n       After finished Eiken-Kintai, I build project Barcode System\nManagement. About Barcode System Management:\nThis is project to manage boxes in factory. Users will use 2\napplications. One is application run on desktop, two is application\nrun handy terminal. With application run on desktop, user can create,\nupdate, delete data master. With all data master, user will create\ninformation barcode then paste all boxes and move to Quanlity\nCheck part to check after continue move to Finished Goods to\ncreate the Shipment Request and tranfer boxes to the comsumers.\nWe used tools to develop as SQL Server 2012, Visual Studio 2008.\nTechnology used for project as Web Services(WSDL).\n.Net Framework 3.5, Windows CE.\nCoding language as VB.Net.\nRun Web Services to deloy as IIS 7.5.\nAnd some small project that I worked in the company such as:\nPRONES is accounting software, use coding language VB.Net and\nIIS 7.5 to use connect database Oracle.\nKintai .NET: One web application used to manage employee, salary,\nproject of company and estimate of tasks in the project, coded by\nC# use technology PhoneGap, AngularJS, Web API,\nEntityFramework 6.0. I spent 6 months from 11/2015 to 5/2016\n10/2013 - 01/2014\nIntership\nFujinet Systems JSC\nI joined Fujinet’s training.\nAt here, I worked in a .Net team. We buildttraining project about\nmanagement time of staff in company.\nI coded display calendar for administrator.\nWith user is administrator, they could see time-in and time-out of a\nstaff. Besides, they could holiday, Tet holiday, etc…\nWe used tools to develop as SQL Server 2008, Visual Studio 2008.\nTechnology used for project as 3-Layers.\n.Net Framework 3.5.\nCoding language as VB.Net.\nHỌC VẤN\n11/2008 - 10/2013\nCông nghệ phần mềm - Công nghệ thông tin\nCử nhân - Trường Đại học Khoa Học Tự Nhiên - Đại học Quốc Gia\nTp HCM\nPhát triển phần mềm quản lý sách cho thư viện của trường\nTHÔNG TIN THAM KHẢO\nTrần Trung Hậu\nĐồng nghiệp tại Công ty TNHH MTV Phần mềm Âu Việt Soft\nhau.tran@auvietsoft.vn | 0984735590\nPowered by TCPDF (www.tcpdf.org)", "educations": [{"id": 5254, "gpa": null, "major": null, "school": "Science University", "diploma": "Bachelors", "end_time": "2013-10-01T00:00:00Z", "conf_score": 0.8086621310791741, "start_time": null, "picklist_major": "Other", "major_categories": "", "major_categories_detail": ""}, {"id": 5256, "gpa": null, "major": "Công nghệ thông tin", "school": "Trường Đại học Khoa Học Tự Nhiên - Đại học Quốc Gia Tp HCM", "diploma": "Bachelors", "end_time": "2013-10-01T00:00:00Z", "conf_score": 0.9265487929128834, "start_time": "2008-11-01T00:00:00Z", "picklist_major": "IT - Hardware/Networking", "major_categories": "Máy tính và công nghệ thông tin", "major_categories_detail": "Công nghệ thông tin"}], "experiences": [{"id": 17580, "detail": "eceive requests from the customer. Then, analyze requirement with the manager. Create tables for compatibility. After, code module with language C# using Entity Framework 6, AutoMapper to mapping database into object that can use in Front-end. The modules that I worked in company, such as: - Price Quotation: module for end-user can input price of offer product. The quotation will repeat again until both agree with price. Quotation will change status is confirm. Besides, when any things end-user can quote price again. - Work Order: module for end-user can input process to produce, create BOM, create Delivery Note, create Receivng Note - Factory Specification & Client Specification: Two screen help end- user chat to report quality of product and confirm price to buy.", "company": "Công ty TNHH MTV Phần mềm Auvietsoft", "end_time": "2023-04-13T00:00:00Z", "industry": "Other", "position": "Ful - stack Developer", "conf_score": 0.8204278355866866, "start_time": "2017-06-01T00:00:00Z"}, {"id": 17582, "detail": "Build web application run on Ipod device. This is system management that using scan product, search product, scan return and scan shipping all everything process on Ipod device. Web application must be run browser Chrome. We used tools to develop as SQL Server 2000, Visual Studio 2013. Technology used for the projects as MVC4, Ajax, Jquery, 3Layers. Coding languages as C# Run IIS 6.0 Besides, I joined Tanaka project, my working in the project that fixing bug about UI support to release product on-times.\nWe used tools to develop as SQL Server 2014, Visual Studio 2015. Technology used for the projects as 3Layers. Coding languages as C#.", "company": "K&G Technology", "end_time": "2017-06-30T00:00:00Z", "industry": "High Technology", "position": ".Net Developer", "conf_score": 0.8310701854240083, "start_time": "2016-11-01T00:00:00Z"}, {"id": 17584, "detail": "10/2013 - 01/2014 Intership Fujinet Systems JSC I joined Fujinet’s training.\nAt here, I worked in a .Net team. We buildttraining project about management time of staff in company.\nI coded display calendar for administrator.\nWith user is administrator, they could see time-in and time-out of a staff. Besides, they could holiday, Tet holiday, etc...\nWe used tools to develop as SQL Server 2008, Visual Studio 2008. Technology used for project as 3-Layers. .Net Framework 3.5. Coding language as VB.Net.", "company": "Fujinet Systems JSC", "end_time": "2016-05-31T00:00:00Z", "industry": "Other", "position": "Intership", "conf_score": 0.788362406427204, "start_time": "2015-11-01T00:00:00Z"}, {"id": 17586, "detail": "After finsihed Fujinet’s training, I applied in Aureole Information Technology in\nCoding language as VB.Net. Run Web Services to deloy as IIS 7.5. After BTMV-Pharse 1 was BTMV-Pharse 2, about BTMV-Pharse 2: Our task was convert Bridgestone System Management from VB6 to\nVB.Net and Oracle 10g to SQL Server 2014. So, quantity work in the project very large, we lost 4 months to finshed this project. We had many the problem in convert Oracle to SQL Server. The query statement, we could fix syntax to SQL Server could run well.\nBesides, we needed writing all store procedure.\nWe used tools to develop as SQL Server 2014, Visual Studio 2008. Technology used for project as nothing.\n.Net Framework 3.5. Coding language as VB.Net. At time, with BTMV-Pharse 2, I worked project Eiken-Kintai. About Eiken-Kintai: This was a project of the Japanese customer, they used project to manage staff in the company, time-in and time-out with rules of company, calendar for user see and applied absence days of themselves, etc...\nWe used tools to develop as Eclipse Indigo, PL/SQL(Oracle SQL Developer). Technology used for project as Struts1, Hibernate. Jre 1.6(Jre 1.5), Oracle 11g2.", "company": "Aureole Information Technology Inc.(AIT)", "end_time": "2016-05-31T00:00:00Z", "industry": "High Technology", "position": "Software Engineer", "conf_score": 0.8340499450796208, "start_time": "2014-04-01T00:00:00Z"}], "address": "21/1/10 Lý Thường Kiệt, Phường 4, Quận Gò Vấp, Tp Hcm, Quận Gò Vấp, Thành phố Hồ Chí Minh"}