{"skills": ["studio", "networking", "non functional requirement", "streaming", "css", "java", "c++", "testing", "analysis", "automation", "owasp", "maven", "automation test", "python", "jira", "experience design", "content delivery network", "html", "linux", "education technology", "automation testing", "ubuntu", "io", "csv", "security", "perl", "api testing", "marketing", "selenium", "postman", "sql", "bug tracking system", "html5", "test data", "system testing", "javascript", "testng", "ubuntu linux", "digital marketing", "dhcp", "functional testing", "mobile testing", "vod", "implementation", "critical thinking", "jenkins", "performance testing", "video on demand", "teamwork", "software development", "php", "android", "cdn", "operating system", "social media marketing", "tester", "selenium ide", "xcode", "management", "medium", "communication skill"], "fulltext": "PERSONAL PROFILE \nLY HONG PHAT \nDOB: 14 May, 1990 \nTel: (+84) 976 985 011 \nEmail: lyhongphat14@gmail.com \nLinkedIn: https://www.linkedin.com/in/phat-ly-449018124/ \nSUMMARY \nHaving about 07 years’ experience in many software projects with Tester roles, being worked in Testing \ntechnologies, manual, automation testing and software development.    \nHaving Software Testing certificates from Carnegie Mellon University include period that being trained and \nworked in the company, strong background such as analysis and design, implementation and execution, \nevaluating issues and report skills.   \nHaving full equipped with critical thinking, teamwork and soft skills to fit with international work \nenvironment. \nBe friendly, responsible, persistent, passion and having lots of enthusiasm to learn and a sincere desire \nto work in professional environment. \nExpertise includes: \n \nKnowledge of operating systems. \n \nExperience in Web, Application testing. \n \nSoftware testing strategies/knowledge. \n \nBusiness automation domain \nknowledge. \n \nRequirement analysis.   \n \nUX, UI testing.  \n \nEmbedded system testing. \n \nTest management.   \nCAREER HISTORY AND EXPERIENCE: \nTesting Projects: \nFeb 2017 – Present: \nQC Engineer \nTesting Service: \n \nWeb services \n \nAPI Testing \nWeb services – Bray Leino Splash  \nSplash Interactive is a full service digital marketing agency providing \nwebsite design & development, CMS integration, user experience design, \nSEO, B2B marketing and social media marketing  \nResponsibilities: \n \nPreparing the Test plan which covered the test activities, \ndeliverable and evaluate the product status before release. \n \nDevelop/revise test cases, test data, and test scripts for functional \nand non-functional requirements. \n \nPerform functional test at all levels of testing of new website \nfeatures based on test cases /test procedures.  \n \nCollaborate with FE, BE team to find out the best solution in \ndevelopment.  \n \nResponsible for the system integration test in product deployment \nphase, ensure product go-live with high quality. \n \nDaily meeting and report the product status directly to Team \nleader/PM. \n \nAnalyze areas need to be coverage by automation test based on \nOWASP ZAP, Selenium WebDriver, POM.    \nTechnologies used in project: \n \n.NET, PHP  \n \nJavaScript, HTML5, CSS, Perl.   \n \nSitefinity, Kentico, Sitecore, Drupal, Umbraco.  \n \nJira, CSV, OWASP ZAP, Postman, Selenium WebDriver, TestNG, \nJenkins, Maven, Eclipse.  \n \nPOM, Cucumber, Keyword driven.  \n \nGoogle share, Jira.  \nAchievements:  \n \nImproving experiences and knowledge Web services (HTML, \nJavaScript, CSS),  \n \nImproving negotiation and communication skills. \n \nFamiliar with API testing by Postman tool. \n \nFamiliar with almost CMS. \n \nDesign automation script by OWASP ZAP, Selenium IDE.   \n \nFamiliar with the most framework in Automation fields. \nTesting Service: \n \nMobile apps \n \nPerformance  \n \nSecurity \n \nExploratory Test \nWeb apps | Mobile apps – Global App Testing \nWorking under freelancer QC engineer, executing testcase, UX/UI, \nfunctional testing mobile app.    \nResponsibilities \n \nUAT, UX proposal, analyze & evaluate the quality of \nlayout/mockup before deploying.  \n \nExecute the testcase and make the report for almost mobile native \napp.    \n \nExploratory test, Adhoc to finding issues and reported them to bug \ntrackers.  \nTechnologies used in project: \n \n iOS (Xcode) & Android studio.  \n \nJavaScript.    \n \nDetox, Appium.  \nAchievements :  \n \nImproving experiences and knowledge Mobile apps testing.  \n \nImproving the reading and analyzing the requirements or \nspecification.  \n \nImproving adhoc skills, finding issues as fast as possible.  \n \nFamiliar with multiple projects as well as diversity of testcases. \n \nImproving the testcase design techniques.    \nSep 2012 – Feb 2017: QA Engineer \nTesting Service: \n \nEmbedded system \n \nNetwork and Linux \nSatellite Digital Television – Global Cybersoft VN  \nThis is Digital Television project that provide television and audio services \nto subscribers through satellite transmission from big vendor in North \nAmerica. Performing all test activities on embedded system devices (set-\nto-box).  \nResponsibilities \n \nInvestigate user requirements, system requirements, test \nspecifications, and documents relate to project. \n \nPerform end-to-end testing of the work-flow almost full testing \nmethodologies. \n \nExecuting testcase and report issues into the JIRA bug tracking \nsystem. \n \nExpertise in test case scenario, test case execution and test \nimprovement. \n \nInvolve in Performance testing with test tool is programmed by \nteam. \n \nDaily report product status, estimate levels of effort for remaining \ntests to manager.  \n \nAnalyzing of test reports to propose test case modification. \n \nLead a small group for Ad-hoc testing to increase the product \nquality (Key man). \nTechnologies used in project \n \nC++, Java \n \nLinux, Ubuntu \n \nNetworking (DHCP, NAT, VPN…) \n \nContent delivery network, Streaming, Video on Demand.   \n \nShell, Python, Bash script, My SQL. \nAchievements:  \n \nStrong testing process about testcase management, bug reports.  \n \nGathering the testing knowledge and experience in embedded \ndevices.  \n \nImproving the testcase execution & report issues skills.  \n \nFamiliar with executing testing in fast-paced environment with \nlocal and distributed locations.  \n \nFamiliar with Linux OS.  \n \nLearning the management skills in small group. \n \nImproving the self-troubleshoot problems in Network \nconfigurations in LAN, Global.  \n \nAchieving the CDN, Streaming, VOD technologies.  \nEDUCATION AND CERTIFICATIONS \n \nBA in IT, Van Lang University \n \nISTQB-CTFL ", "educations": [{"id": 5287, "gpa": null, "major": null, "school": "Van Lang University", "diploma": "Bachelors", "end_time": null, "conf_score": 0.8086621310791741, "start_time": null, "picklist_major": "Other", "major_categories": "", "major_categories_detail": ""}], "experiences": [{"id": 17706, "detail": "Testing Service: Web services\nAPI Testing Web services - Bray Leino Splash Splash Interactive is a full service digital marketing agency providing website design & development, CMS integration, user experience design,\nSEO, B2B marketing and social media marketing\nResponsibilities: Preparing the Test plan which covered the test activities, deliverable and evaluate the product status before release.\nDevelop/revise test cases, test data, and test scripts for functional and non-functional requirements.\nPerform functional test at all levels of testing of new website features based on test cases /test procedures.\nCollaborate with FE, BE team to find out the best solution in development.\nResponsible for the system integration test in product deployment phase, ensure product go-live with high quality.\nDaily meeting and report the product status directly to Team leader/PM. Analyze areas need to be coverage by automation test based on\nOWASP ZAP, Selenium WebDriver, POM. Technologies used in project:\n.NET, PHP JavaScript, HTML5, CSS, Perl. Sitefinity, Kentico, Sitecore, Drupal, Umbraco. Jira, CSV, OWASP ZAP, Postman, Selenium WebDriver, TestNG, Jenkins, Maven, Eclipse. POM, Cucumber, Keyword driven.\nGoogle share, Jira. Achievements: Improving experiences and knowledge Web services (HTML, JavaScript, CSS), Improving negotiation and communication skills.\nFamiliar with API testing by Postman tool.\nFamiliar with almost CMS. Design automation script by OWASP ZAP, Selenium IDE. Familiar with the most framework in Automation fields.\nTesting Service: Mobile apps\nPerformance Security Exploratory Test Web apps | Mobile apps - Global App Testing Working under freelancer QC engineer, executing testcase, UX/UI, functional testing mobile app.\nResponsibilities UAT, UX proposal, analyze & evaluate the quality of layout/mockup before deploying.\nExecute the testcase and make the report for almost mobile native app.\nExploratory test, Adhoc to finding issues and reported them to bug trackers.\nTechnologies used in project:\niOS (Xcode) & Android studio.\nJavaScript. Detox, Appium. Achievements : Improving experiences and knowledge Mobile apps testing.\nImproving the reading and analyzing the requirements or specification.\nImproving adhoc skills, finding issues as fast as possible.\nFamiliar with multiple projects as well as diversity of testcases.\nImproving the testcase design techniques.", "company": null, "end_time": "2023-04-13T00:00:00Z", "industry": "Other", "position": "QC Engineer", "conf_score": 0.7017163682865227, "start_time": "2017-02-01T00:00:00Z"}, {"id": 17708, "detail": "Testing Service: Embedded system\nNetwork and Linux Satellite Digital Television - Global Cybersoft VN This is Digital Television project that provide television and audio services to subscribers through satellite transmission from big vendor in North America. Performing all test activities on embedded system devices (set- to-box).\nResponsibilities Investigate user requirements, system requirements, test specifications, and documents relate to project.\nPerform end-to-end testing of the work-flow almost full testing methodologies.\nExecuting testcase and report issues into the JIRA bug tracking system.\nExpertise in test case scenario, test case execution and test improvement.\nInvolve in Performance testing with test tool is programmed by team.\nDaily report product status, estimate levels of effort for remaining tests to manager.\nAnalyzing of test reports to propose test case modification.\nLead a small group for Ad-hoc testing to increase the product quality (Key man).\nTechnologies used in project\nC++, Java Linux, Ubuntu Networking (DHCP, NAT, VPN...) Content delivery network, Streaming, Video on Demand. Shell, Python, Bash script, My SQL. Achievements: Strong testing process about testcase management, bug reports.\nGathering the testing knowledge and experience in embedded devices.\nImproving the testcase execution & report issues skills.\nFamiliar with executing testing in fast-paced environment with local and distributed locations.\nFamiliar with Linux OS. Learning the management skills in small group.\nImproving the self-troubleshoot problems in Network configurations in LAN, Global. Achieving the CDN, Streaming, VOD technologies.", "company": null, "end_time": "2017-02-28T00:00:00Z", "industry": "Other", "position": "QA Engineer", "conf_score": 0.6925429707670153, "start_time": "2012-09-01T00:00:00Z"}], "address": null}