{"skills": ["payment", "futures", "front desk", "time service", "management", "housekeeping"], "fulltext": "Contact\nwww.linkedin.com/in/duong- ly-3a21a6a5  (LinkedIn)\nTop Skills\nCustomer Service\nHotel Management\nDuong Ly\nTeam Leader of Butler Services at InterContinental Phu Quoc Long\nBeach Resort\nVietnam\nExperience\nInterContinental Phu Quoc Long Beach Resort\nTeam Leader of Club Intercontinental\nNovember 2018 - Present \nAMAN\n2 years 9 months\nResidence Butler Supervisor\nAugust 2017 - November 2018 (1 year 4 months)\nVietnam\nResidence Butler \nMarch 2016 - July 2017 (1 year 5 months)\nVietnam\nProvide all preparation and mise un –place in the assigned Residence before\nservice time\nProvide the correct and complete tools and equipment in the assigned\nResidence in order to provide the outstanding level of service\nInspect the room before guest arrival as well as during guest stay\nTake care of guests and coordinate with all concerned departments to fulfill\nguest needs and requests.\nKeep concerned departments informed about the guest allergies and food\npreferences.\nUpdate the hotel software with guest preference, likes and dislikes on to the\nguest profile section.\nWelcome and escorts the guests to their assigned Residence.\nServes guest's dinning & checks in with guests to ensure satisfaction with each\nfood course and/or beverages.\nFollow all the guest needs until they are completed to the total guest\nsatisfaction.\nMaintain the personal service to the guests by giving the details attention to the\nguests\nTakes care of the guest's requests and liaise with respective departments:\nlaundry, wake up call, spa bookings,concierge and any special requests etc.\nPage 1 of 3\nAble to perform software operations like check-ins / check-outs, update profile,\nroom reservations, requests, apply payment, verify and adjust billing, process\ncheck-out etc. on the hotel software.\nUpdates guest feedback and comments on to Manager\nHelps monitoring the stock inventory and to follow up on pending issues with\nthe tracking system and store requisition forms.\nCoordinate with Housekeeping to make sure the room always tiday & clean\nFully conversant with accommodation features: lay-out, room type, location,\ndecor, in room facilities and equipment.\nServe the guests in a calm, discrete and courteous manner, respecting timing\nstandards.\nAssist guest for packing & unpacking service\nDo closing Residence procedure: return items to department concern, clean up\npantry, do inventory record.\nVinpearl\nGuest Relations Officer\nAugust 2015 - March 2016 (8 months)\nVietnam\nFrom greeting and checking-in to ensuring the daily comfort of guests, a Guest\nRelation Officer maintains a constant presence at the front desk or lobby of a\nhotel and is available to handle all customer questions and concerns. \nResponding quickly and efficiently to guest concerns\nAssisting guests throughout the check-in process\nRelating information about amenities and other relevant information for\nincoming guests\nContributing to the development of customer satisfaction programs\nHandle guest's complaint.\nWork closely with upper management to measure customer service, such as\nthrough surveys and questionnaires, and help to create programs that better\naddress the needs of guests to avoid potential issues in the future.\nNhan tam eco-tourism, Khanh Hoa , Vietnam\nSales Executive\nJune 2014 - July 2015 (1 year 2 months)\nNhan tam Eco-tourism, Khanh Hoa, Viet nam\nDiamond Bay Condotel Nha trang\nsales executive\nDecember 2013 - 2014 (1 year 1 month)\nPage 2 of 3\nEducation\nHa Tinh University\nBachelor's degree, English · (2009 - 2012)\nPage 3 of 3", "educations": [{"id": 5290, "gpa": null, "major": "English", "school": "Ha Tinh University", "diploma": "Bachelors", "end_time": "2012-01-01T00:00:00Z", "conf_score": 0.8413267261986577, "start_time": "2009-01-01T00:00:00Z", "picklist_major": "Other", "major_categories": "", "major_categories_detail": ""}], "experiences": [{"id": 17714, "detail": "", "company": "InterContinental Phu Quoc Long Beach Resort", "end_time": "2023-04-13T00:00:00Z", "industry": "Other", "position": "Team Leader of Club Intercontinental", "conf_score": 0.9243558553099895, "start_time": "2018-11-01T00:00:00Z"}, {"id": 17715, "detail": "", "company": "AMAN", "end_time": "2018-11-30T00:00:00Z", "industry": "Other", "position": "Residence Butler Supervisor", "conf_score": 0.912446606303612, "start_time": "2017-08-01T00:00:00Z"}, {"id": 17716, "detail": "(1 year 5 months)\nVietnam Provide all preparation and mise un -place in the assigned Residence before service time\nProvide the correct and complete tools and equipment in the assigned\nResidence in order to provide the outstanding level of service\nInspect the room before guest arrival as well as during guest stay\nTake care of guests and coordinate with all concerned departments to fulfill guest needs and requests.\nKeep concerned departments informed about the guest allergies and food preferences.\nUpdate the hotel software with guest preference, likes and dislikes on to the guest profile section.\nWelcome and escorts the guests to their assigned Residence. Serves guest's dinning & checks in with guests to ensure satisfaction with each food course and/or beverages.\nFollow all the guest needs until they are completed to the total guest satisfaction.\nMaintain the personal service to the guests by giving the details attention to the guests\nTakes care of the guest's requests and liaise with respective departments: laundry, wake up call, spa bookings,concierge and any special requests etc.\nAble to perform software operations like check-ins / check-outs, update profile, room reservations, requests, apply payment, verify and adjust billing, process check-out etc. on the hotel software.\nUpdates guest feedback and comments on to Manager Helps monitoring the stock inventory and to follow up on pending issues with the tracking system and store requisition forms.\nCoordinate with Housekeeping to make sure the room always tiday & clean\nFully conversant with accommodation features: lay-out, room type, location, decor, in room facilities and equipment.\nServe the guests in a calm, discrete and courteous manner, respecting timing standards.\nAssist guest for packing & unpacking service\nDo closing Residence procedure: return items to department concern, clean up pantry, do inventory record.", "company": "AMAN", "end_time": "2017-07-31T00:00:00Z", "industry": "Other", "position": "Residence Butler", "conf_score": 0.8086621310791741, "start_time": "2016-03-01T00:00:00Z"}, {"id": 17717, "detail": "(8 months)\nVietnam From greeting and checking-in to ensuring the daily comfort of guests, a Guest Relation Officer maintains a constant presence at the front desk or lobby of a hotel and is available to handle all customer questions and concerns.\nResponding quickly and efficiently to guest concerns\nAssisting guests throughout the check-in process\nRelating information about amenities and other relevant information for incoming guests\nContributing to the development of customer satisfaction programs\nHandle guest's complaint.\nWork closely with upper management to measure customer service, such as through surveys and questionnaires, and help to create programs that better address the needs of guests to avoid potential issues in the future.", "company": "Vinpearl", "end_time": "2016-03-31T00:00:00Z", "industry": "Other", "position": "Guest Relations Officer", "conf_score": 0.9542590739672067, "start_time": "2015-08-01T00:00:00Z"}, {"id": 17718, "detail": "Khanh Hoa , Vietnam Sa", "company": "Nhan tam eco - tourism", "end_time": "2015-07-31T00:00:00Z", "industry": "Other", "position": "Sales Executive", "conf_score": 0.9371357429935756, "start_time": "2014-06-01T00:00:00Z"}, {"id": 17719, "detail": "", "company": "Diamond Bay Condotel Nha trang", "end_time": "2014-01-31T00:00:00Z", "industry": "Other", "position": "sales executive", "conf_score": 0.9338341297122752, "start_time": "2013-12-01T00:00:00Z"}], "address": null}