{"skills": ["stack", "aws", "angular", "analytics", "iot", "javascript", "medium service", "c#", "mongodb", "management", "microsoft azure", "redux", "xamarin", "devops", "structure", "redux saga", "medium", "management tool", "recruitment", "sql", "signalr", "jira", "github", "microsoft", "identity", "reactjs", "database", "azure service", "azure", "full stack development", "angularjs", "jquery"], "fulltext": "Butter Ngo\nSenior Technology Development Engineer\nProfile\nI'm fullstack developer I can do BE,FE and Devops, butimy strength server\nside.\nI have 10 years experiences development websites almost projects use\nMicrosoft technologies and some popular js such as\"angularjs, anglular 2+,\nreactjs jquery\". Also, during the course of my work, I have completed 2\nmobiles app. I can work independently or team work, ability R&D new\ntechnology solving the problem.\nI have 1 year experience with management and ability using scrum for team,\nI\nin past time i have been used scrum to manage team.\nLinks\nGitHub\nLinkedin\nBlog\nSkills\nC# .NET\nEmployment History\nTechnical Lead at Codestringers, Ho Chi Minh\nAugust 2017 - May 2019\nProject SiteOne :http://www.siteoneservices.com/\nSiteOne is customer service solution for home builders, developers and\ncontractor.\nClient: US\nThe project was alive 10 years ago and now they want to upgrade new\ntechnology and new UI for it.\nFirstly join the project I with BA research and learn their business and\ndiscussion with them via mail, then make the proposal about\"Technology\" and\nestimation time completed.\nFirst 6 months my team have 3 members 1 Full-stack developer, 1 BA, and 1 QA.\nI'm Full-tack developer in the project.\nWe are using scrum process for this project everyday we have the meeting\nreport our work with the client, what yesterday we do and what we do today,\nand sprint planing with 2 a week,\nMy task: setup environment\"development, Qc, Staging\", design structure for\nBE and FE, build the \"devops\" auto deployment, discussion with BA and give\nthe solution for project.\nAfter 6 months Client hire 3 members for team \"1 BE, 2FE\".\nMy task: Everyday i observe member in team what they do, make the review\ncode, support them solving the problem, and do my task.\nTechnologies:\nBE:\n. Net Core 2+.\n. Identity Server 4.\n. WebApi.\n. Mongodb.\n. Sql Server.\n. Signalr Core.\nDatabase\nJavaScript\nMicrosoft Azure\nAmazon Web Services\nDevOps\nMongodb\nWebApi\nDot net core 2+\nReactjs\nangular\nNet FW 4+\nLanguages\nEnglish\n. AWS S3.\n. Event Sourcing.\nFE:\n. React\n. Redux saga\nDevops:\n. Jenkin\n. Web deployment (3.6)\nTool management\n. Jira\nSenior Developer at Tekcent, Ho Chi Minh\nJanuary 2016 - August 2017\nThe Company come from Hong Kong, almost client come from asian \"ingapore\nChinese\"\nThe company focus CMS Such as\"#Site One Umbraco\"), but the company is very\ninterested with new technology such as \"IOT, Block Chain, Data Science\" then\nthey build a R&D team, and me team leader R&D.\nMy Task: Everyday i spend a lot time research \"IOT, Raspberry 3, Window IOT\"\nand some azure services such as \"microsoft face, azure media service\".\nlobserve member in team what they do, support other team solving the\nproblem about technical.\nAftr 6 months we have a new client come from England they want to build a\nexam on mobile.\nMy task:\n- Discussion with a team leader from Hong Kong and PM in Viet Nam, analytics\ntheir requirement then make the proposal \"Technology\" and estimation time.\n- Setup process and environment development for team.\n- Observation progress of team.\n- Daily meeting report with client.\n- Support team member estimation in sprint planing.\nTechnologies:\n+ net framework 4.6\n+ WebAPi\n+ Identity Server 3\n+ Xamarin\n+ Mongodb\nDevops:\n+ Team city\n+ Web deployment (3.5)\nTool management\n+ Jira\nDeveloper at Devinition, Ho Chi Minh\nJanuary 2014 - January 2019\nThis is out sourcing companv come from eurone. almost client from euroDe.\nduring i work with the company i have been completed 2 projects.\nThe first project is Recruitment IT in Viet Nam \"https://www.itjobs.com.vn/vi\"\nMy task: Everydayi access to jira get task and do, end of day i write a mail report\nfor my leader what i do today, and what it completed, and whati the problem in\nmy task. We have sprint planing with 2 a week.\nThe second project leaseplan \"https://www.leaseplan.com/en-ie/my-lease-\ncar/\"\nThe project is Driver services \"We're ready to help: any car, antime, anywhere\"\nMy task: Everydayi access to jira get task and do, end of dayi write a mail report\nfor my leader whati do today, and what it completed, and what the problem in\nmy task. We have sprint planing with 2 a week.\nJunior developer at Ambition plus custom solution, Ho Chi Minh\nJanuary 2010 - January 2014\nThis is the first company i joined the company come from australia, thisis\nproduct and out sourcing company.\nTheir project is accountant and they used VB6 development it, the prodcut was\nalive 6 years, but they have a some small project from other client.\nDuring the course of my work i have been completed 6 the projects and 2\nmobile app\nEducation\ncolleges, CNC Aptech, Ho Chi Minh\nMay 2007 - May 2019", "educations": [{"id": 5307, "gpa": null, "major": null, "school": "CNC Aptech", "diploma": "Other", "end_time": "2019-05-01T00:00:00Z", "conf_score": 0.7465493116105798, "start_time": "2007-05-01T00:00:00Z", "picklist_major": "Other", "major_categories": "", "major_categories_detail": ""}], "experiences": [{"id": 17767, "detail": "Project SiteOne :http://www.siteoneservices.com/\nSiteOne is customer service solution for home builders, developers and contractor.\nClient: US The project was alive 10 years ago and now they want to upgrade new technology and new UI for it.\nFirstly join the project I with BA research and learn their business and discussion with them via mail, then make the proposal about\"Technology\" and estimation time completed.\nFirst 6 months my team have 3 members 1 Full-stack developer, 1 BA, and 1 QA. I'm Full-tack developer in the project.\nWe are using scrum process for this project everyday we have the meeting report our work with the client, what yesterday we do and what we do today, and sprint planing with 2 a week,\nMy task: setup environment\"development, Qc, Staging\", design structure for\nBE and FE, build the \"devops\" auto deployment, discussion with BA and give the solution for project.\nAfter 6 months Client hire 3 members for team \"1 BE, 2FE\". My task: Everyday i observe member in team what they do, make the review code, support them solving the problem, and do my task.\nTechnologies: BE: . Net Core 2+. . Identity Server 4. . WebApi. . Mongodb. . Sql Server. . Signalr Core. . AWS S3. . Event Sourcing. FE: . React . Redux saga\nDevops: . Jenkin . Web deployment (3.6) Tool management\n. Jira . AWS S3. . Event Sourcing. FE: . React . Redux saga\nDevops: . Jenkin . Web deployment (3.6) Tool management\n. Jira", "company": "Codestringers", "end_time": "2019-05-31T00:00:00Z", "industry": "High Technology", "position": "Technical Lead", "conf_score": 0.9171087048027518, "start_time": "2017-08-01T00:00:00Z"}, {"id": 17769, "detail": "during i work with the company i have been completed 2 projects.\nThe first project is Recruitment IT in Viet Nam \"https://www.itjobs.com.vn/vi\"\nMy task: Everydayi access to jira get task and do, end of day i write a mail report for my leader what i do today, and what it completed, and whati the problem in my task. We have sprint planing with 2 a week.\nThe second project leaseplan \"https://www.leaseplan.com/en-ie/my-lease- car/\"\nThe project is Driver services \"We're ready to help: any car, antime, anywhere\"\nMy task: Everydayi access to jira get task and do, end of dayi write a mail report for my leader whati do today, and what it completed, and what the problem in my task. We have sprint planing with 2 a week.\nJunio", "company": "Devinition", "end_time": "2019-01-31T00:00:00Z", "industry": "Other", "position": "Developer", "conf_score": 0.9085716158340945, "start_time": "2014-01-01T00:00:00Z"}, {"id": 17771, "detail": "The Company come from Hong Kong, almost client come from asian \"ingapore\nChinese\" The company focus CMS Such as\"#Site One Umbraco\"), but the company is very interested with new technology such as \"IOT, Block Chain, Data Science\" then they build a R&D team, and me team leader R&D. My Task: Everyday i spend a lot time research \"IOT, Raspberry 3, Window IOT\" and some azure services such as \"microsoft face, azure media service\". lobserve member in team what they do, support other team solving the problem about technical.\nAftr 6 months we have a new client come from England they want to build a exam on mobile.\nMy task:\n- Discussion with a team leader from Hong Kong and PM in Viet Nam, analytics their requirement then make the proposal \"Technology\" and estimation time.\n- Setup process and environment development for team.\n- Observation progress of team.\n- Daily meeting report with client.\n- Support team member estimation in sprint planing.\nTechnologies: + net framework 4.6 + WebAPi + Identity Server 3 + Xamarin + Mongodb Devops: + Team city\n+ Web deployment (3.5) Tool management\n+ Jira", "company": "Tekcent", "end_time": "2017-08-31T00:00:00Z", "industry": "Other", "position": "Senior Developer", "conf_score": 0.8896032038905214, "start_time": "2016-01-01T00:00:00Z"}, {"id": 17773, "detail": "is the first company i joined the company come from australia, thisis product and out sourcing company.\nTheir project is accountant and they used VB6 development it, the prodcut was alive 6 years, but they have a some small project from other client.\nDuring the course of my work i have been completed 6 the projects and 2 mobile app", "company": "Ambition plus custom solution", "end_time": "2014-01-31T00:00:00Z", "industry": "High Technology", "position": "Junior developer", "conf_score": 0.9085716158340945, "start_time": "2010-01-01T00:00:00Z"}], "address": null}