{"skills": ["robot", "manage data", "studio", "base station", "process monitoring", "telecommunication equipment", "streaming", "analysis", "cloud system", "firewall", "project planning", "business activity", "virtualizations", "linux", "network management", "virtualization", "scheduling", "oracle", "data analysis", "security", "ftp", "project management", "mssql", "storage server", "sql", "cnn", "window server", "database", "load balancing", "file server", "monitoring server", "live streaming", "aws", "implementation", "cloud", "operation system", "operations management", "futures", "system monitoring", "teamwork", "optical network", "centos", "google cloud platform", "maintenance", "management", "google cloud", "system maintenance", "bot"], "fulltext": "CURRICULUM VITAE \nELECTRONICS-TELECOMMUNICATIONS_IT DEP \nPERSONAL INFORMATION: \nName                :  Hà Như Ngọc  \nDate of birth    :  31/08/1991 \nAddress             : Xuan Lai Commune - Tho Xuan District - Thanh Hoa Province. \nWork address  : National Mozambique - Capital Maputo \nQualifications  :  Bachelor of Electronics in Telecommunications \nSchool                : Hanoi Polytechnic University \nMobile                :   \nEmail                :  ngoc22791@gmail.com \nSkype                 :  \nLanguage          :   English  \nCAREER GOALS: \nDesire to learn professional development, improve professional skills - have the \nqualifications, practice management skills and short-term team leader. \nSUMMARY \n● Using C ++ programming language. \n● Designing and building information and telecommunications networks for the clients. \n● Designing network system such as LAN/WAN. \n● Designing and operating server. \n● Project management. \n● 4 years experience in the field of System or Network or Server \n● Network: Design/Build/Operation for security(LAN/WAN、Firewall etc...) \n● Server: Design/Build/Operation for Windows server –Linux server –SQL Oracle \nServer. \nOther : \n● Hardworking, careful, detailed, team spirit and team work abilities. \n● Ability to learn and grasp knowledge quickly. \n● Passion for the job. \nWORKING EXPERIENCE \nSeptember, 2017-Now \nWorking Movitel SA - Viettel market \nPosition : \n●  Proficiently use Oracle SQL, MSSQL database query commands and data analysis \nBI report. \n● AWS cloud system (EC2, S3), Google Cloud Platform (chatbots  project ). \n●  Support and coordinate service deployment, build dashboard to meet business \nsupport needs. \n● Managing, configuring, deploying, monitoring and monitoring server systems, \nservers, databases, file servers, storage systems, etc. Ensure that the system operates \n24/7, correct problems arising in accordance with the process and regulations. \n● Manage, configure, monitor, operate to ensure safety, optimization and security for \nthe company's systems; Preside to maintain and propose improvement, development, \nexpansion of the system to meet the needs of use, production and business. \n● Solve problems and complaints against the server system, IT services of the company. \nOptimize the use of the company's system resources \n● Responsible for managing, allocating, managing the resources of the service system. \nEnsuring the demand for production and business activities of the Company, as well \nas for the services of the Company \n● Perform maintenance, backup system configuration (Server, Storage ...) periodically. \n● Allocate, manage resources, manage user accounts. \n● Update data according to developer's requirements. \nResearch and development of the system: \n● The systems include servers, storage, technologies that ensure stable system \noperation. \n● Load balancing systems, Firewall, Web, Database ... come with technologies to \nensure backup, recovery, HA ... \n● Technology solutions for Cloud Computing. \n● Technology solutions Storage, Backup, Archive, Dissater Recovery ... \n● of the service system of the company.  Solutions for infrastructure application of the \nCompany for the development of value added services. \n● Open source solutions for management operation, service system optimization \n● Problems related to the system that arise in the future. Open Source solutions for \nmanagement operations, service system optimization \n● Research, develop and deploy monitoring systems to: monitor services, monitor \nresources, ensure capacity and operation of service systems. \n● Research, propose to coordinate the implementation of the optimal solution, upgrade, \nreplace the supplement, improve the service system. \n● Researching, developing, developing integrated solutions \nJanuary 2017- August 2017 \nFTP  Software  \nPosition: Staff Development 2 - FSU11- F500 (FSOFT) -Site Cau Giay -TP Hanoi. \n● Research project F500: JAPAN client - monitoring chat-bot system. \n● Learn Cloudera system -Big data, Flatfom, the monitoring equipment of the system, \n● Installation, configuration, virtualization for devices, VM ware-linux server -Centos, \ndata center storage system monitoring. \n● Monitoring the system of robots, rotbot answers automatically push the parties to \nmonitor the bug fixes, send reports, set up monitoring process, fix errors. \n● Follow up periodic system maintenance plan, replace inventory update device. \nMay 2016 - November 2016 \nWork in control room VSTV K + (Playout) \nPosition : \n● - Coordinate with the department: director, ingest, studio, tranmission broadcast live, \nmanagement of image & sound quality, broadcast list. \n● Troubleshooting & maintenance of the system when required, logo, output signal, run \nmessage, popup, graphics, time-time code, dow & error file. \n● Optical network management: optical, vtvcap, netnam, intercom. \n● Live Streaming, Sports Newsletters, live football matches from the studio, or \nstreaming from VTVcap. \n● Insert the faded logo combination law anti-piracy law wave K +. \nJuly / 2014- April  2016 \nEricsson Telecom Company (Telecommunications Management) \nPosition:  Staff \nMission : \n● Managed base station of Vietnamobi - Headquarters No. 2 pagoda. Scheduling \nmaintenance, replacement of inventory equipment, telecommunication stations. \n● Protection survey -make reports, adjust direction and angle. \n● Test systems involve the telecommunications source part -acquy, parameter settings \ntest and replacement. \n● Get data files, micro SDH transmission, manage data on the server. \n● 3G streaming and optimization - BSC station broadcast, RBS stream for NOC \nmanagement. \n● Monitoring quality of service -Test and wave measurement, ensure enough capacity \n& committed bandwidth. \n● Troubleshooting workstation related problems, fix errors, measure the wave test. \nTrained skills: \n● Detects the failure of telecommunication equipment and fault fixes as well as the \nmicrowave-tranquility tran- sion. \n● The art of customer communication, project planning, teamwork, innovation. \nSKILL \n● Fluent in MS Office. \n● Ability to communicate and give good presentation. \n● Ability to work independently or in team, team spirit and work under pressure. \n● Love to work, willing to learn, confident, active \n● Good organization, high responsibility. \n● Ability to solve and analyze problems well. \nHOBBY \n● Watch TV commercials, automotive magazines, books. \n● Get information on new models. \n● Listen to music, news on CNN, BBC World, surf the web. \n● Sports: football, volleyball, badminton ... ", "educations": [{"id": 5309, "gpa": null, "major": "Kinh tế tài nguyên thiên nhiên", "school": "Hanoi Polytechnic University", "diploma": "Bachelors", "end_time": null, "conf_score": 0.8363126073448006, "start_time": null, "picklist_major": "Environment", "major_categories": "Môi trường và bảo vệ môi trường", "major_categories_detail": "Quản lý tài nguyên và môi trường"}], "experiences": [{"id": 17775, "detail": "osition : ● Proficiently use Oracle SQL, MSSQL database query commands and data analysis\nBI report.\n● AWS cloud system (EC2, S3), Google Cloud Platform (chatbots project ). ● Support and coordinate service deployment, build dashboard to meet business support needs.\n● Managing, configuring, deploying, monitoring and monitoring server systems, servers, databases, file servers, storage systems, etc. Ensure that the system operates\n24/7, correct problems arising in accordance with the process and regulations.\n● Manage, configure, monitor, operate to ensure safety, optimization and security for the company's systems; Preside to maintain and propose improvement, development, expansion of the system to meet the needs of use, production and business.\n● Solve problems and complaints against the server system, IT services of the company.\nOptimize the use of the company's system resources\n● Responsible for managing, allocating, managing the resources of the service system.\nEnsuring the demand for production and business activities of the Company, as well as for the services of the Company ● Perform maintenance, backup system configuration (Server, Storage ...) periodically.\n● Allocate, manage resources, manage user accounts.\n● Update data according to developer's requirements.\nResearch and development of the system:\n● The systems include servers, storage, technologies that ensure stable system operation.\n● Load balancing systems, Firewall, Web, Database ... come with technologies to ensure backup, recovery, HA ... ● Technology solutions for Cloud Computing. ● Technology solutions Storage, Backup, Archive, Dissater Recovery ... ● of the service system of the company. Solutions for infrastructure application of the\nCompany for the development of value added services.\n● Open source solutions for management operation, service system optimization\n● Problems related to the system that arise in the future. Open Source solutions for management operations, service system optimization\n● Research, develop and deploy monitoring systems to: monitor services, monitor resources, ensure capacity and operation of service systems.\n● Research, propose to coordinate the implementation of the optimal solution, upgrade, replace the supplement, improve the service system.\n● Researching, developing, developing integrated solutions", "company": "Movitel SA - Viettel market", "end_time": "2023-04-13T00:00:00Z", "industry": "High Technology", "position": null, "conf_score": 0.7115937912651813, "start_time": "2017-09-01T00:00:00Z"}, {"id": 17777, "detail": "Site Cau Giay -TP Hanoi. ● Research project F500: JAPAN client - monitoring chat-bot system.\n● Learn Cloudera system -Big data, Flatfom, the monitoring equipment of the system,\n● Installation, configuration, virtualization for devices, VM ware-linux server -Centos, data center storage system monitoring.\n● Monitoring the system of robots, rotbot answers automatically push the parties to monitor the bug fixes, send reports, set up monitoring process, fix errors.\n● Follow up periodic system maintenance plan, replace inventory update device.", "company": "FTP Software", "end_time": "2017-08-31T00:00:00Z", "industry": "High Technology", "position": "Staff Development 2", "conf_score": 0.7773917528157606, "start_time": "2017-01-01T00:00:00Z"}, {"id": 17779, "detail": "Position : ● - Coordinate with the department: director, ingest, studio, tranmission broadcast live, management of image & sound quality, broadcast list.", "company": "VSTV K + (Playout)", "end_time": "2016-11-30T00:00:00Z", "industry": "Other", "position": null, "conf_score": 0.6925429707670153, "start_time": "2016-05-01T00:00:00Z"}], "address": "Xuan Lai Commune - Tho Xuan District - Thanh Hoa Province"}