{"skills": ["search", "visual studio", "linux", "studio", "operation system", "html", "mysql", "unity", "css", "php", "website development", "github", "tester", "excel", "sales", "c#"], "fulltext": "INFORMATION TECHNOLOGY \nEngineer \nAs an Information Technology engineer \nlooking for Tester, QA, QC with the desire \nto work in a flexible and dynamic \nenvironment to develop your career and \napply your skills and knowledge to \nyourself. I believe I can become a \nprominent candidate. \nInformation Technology  \nDegree of engineer  \n       The product is a 2D game called Gold Miner built using C# \nlanguage and Unity 2D tool. The game consists of four levels from \neasy to difficult, graphical interface fun, friendly, effects and sound \nfun, enticing players. \n       This game built on PC with 4 screens play from easy to difficult \nwith different objectives in each level and functions achieve as load \nscene by button, create effects for buttons, display the interface as \nyou like, count down the time spent in each stage, add points when \neating gold, create sound for the game. \n       With funny images and sounds, the Game creates a space for \nplayers to search and conquer every treasure of different sizes with \ndifferent scores. The player pulls more and more objects high value \ntreasure the higher the score. \n•\nUsed to work with GitHub for storage. \n•\nLanguage programming: C#.   \n•\nTools: Unity, Visual Studio, Photoshop CS6, Illustrator. \nINFORMATION TECHNOLOGY \nEngineer \n• \n      Building sales website help to provide more informations to \ncustomers and convenient for shopping. Users can add, edit, delete \nand update products. Customers allowed to view, seach, add shopping \ncarts and choose to buy products they want to buy. \n• \nDesign UI with photoshop. \n• \nCutting html and css from psd. \n• \nKnowledge of web programming. \nLanguage programming: HTML, CSS, PHP, MySQL.\n       Experience for editing photos, images and logo with basic \nknowledge for Photoshop, Illustrator and Proshow software.\n• \nMaking and designing Power Point for presentation.  \nSetup and install Linux and Windows operation system.\nKnowledge for Word and Excel.", "educations": [{"id": 5316, "gpa": null, "major": "Công nghệ thông tin", "school": "Can Tho University", "diploma": "Engineer", "end_time": "2019-01-01T00:00:00Z", "conf_score": 0.8344195524159246, "start_time": "2014-01-01T00:00:00Z", "picklist_major": "IT - Hardware/Networking", "major_categories": "Máy tính và công nghệ thông tin", "major_categories_detail": "Công nghệ thông tin"}], "experiences": [{"id": 17810, "detail": "The product is a 2D game called Gold Miner built using C# language and Unity 2D tool. The game consists of four levels from easy to difficult, graphical interface fun, friendly, effects and sound fun, enticing players.\nThis game built on PC with 4 screens play from easy to difficult with different objectives in each level and functions achieve as load scene by button, create effects for buttons, display the interface as you like, count down the time spent in each stage, add points when eating gold, create sound for the game.\nWith funny images and sounds, the Game creates a space for players to search and conquer every treasure of different sizes with different scores. The player pulls more and more objects high value treasure the higher the score.\nUsed to work with GitHub for storage.\nLanguage programming: C#. Tools: Unity, Visual Studio, Photoshop CS6, Illustrator.", "company": null, "end_time": "2018-12-31T00:00:00Z", "industry": "Other", "position": "Developing games", "conf_score": 0.6925429707670153, "start_time": "2018-08-01T00:00:00Z"}, {"id": 17812, "detail": "Building sales website help to provide more informations to customers and convenient for shopping. Users can add, edit, delete and update products. Customers allowed to view, seach, add shopping carts and choose to buy products they want to buy.\nDesign UI with photoshop.\nCutting html and css from psd.\nKnowledge of web programming.\nLanguage programming: HTML, CSS, PHP, MySQL. Making video and designing graphics\nExperience for editing photos, images and logo with basic knowledge for Photoshop, Illustrator and Proshow software.\nOffice Skills Making and designing Power Point for presentation.\nSetup and install Linux and Windows operation system.\nKnowledge for Word and Excel.", "company": null, "end_time": "2018-04-30T00:00:00Z", "industry": "Other", "position": "Building sales website", "conf_score": 0.7275132206498556, "start_time": "2017-12-01T00:00:00Z"}], "address": "Dong Thap Province"}