{"skills": ["digital marketing", "due diligence", "marketing", "c++", "implementation", "sales", "management", "excel", "administration", "market research", "finance", "analysis", "marketing strategy", "team management", "restructuring", "electrical engineering", "making decision", "microsoft", "revenue streams", "product positioning", "sales and marketing", "data collection"], "fulltext": "Khanh Nguyen \n53 B 2nd Street, Lu Gia Apartment \nWard 15, District 11 \nHo Chi Minh City,  \nVietnam \nkhanh.nguyen87@gmail.com \nOBJECTIVE: \nTo obtain professional opportunities in Vietnam and Asia focusing on operation, product development, strategic management, and \nleadership.  \nWORK EXPERIENCE: \nAnduin Transactions \n                                               Ho Chi Minh City (Feb 2019- Present) \nBusiness Operation Expert \n● Lead the planning, development, and implementation of product launches. \n● Develop deep relationships with key stakeholder individuals and leaders across the team globally to execute essential projects & and\ndeliver business contracts’ milestones.  \n●Deliver operational strategic proposals and recommendations to the leadership team in order to aid them with key business insights\nand high-priority initiatives and enable data-driven decision making.  \n●Be pivotal in supporting CEO oversee business performance reporting and scale best practices across the organization.  \n●Be pivotal in helping articulate the CEO’s vision and track progress against company goals.  \n●Help coordinate business-wide procedures and work to improve existing processes from product operations, to customer success,\nbusiness development, and etc. for maximum clarity, efficiency, and success.  \nEgopulse \n                  Ho Chi Minh City (Dec 2015- Dec 2018) \nOperation Manager  \n● Seek, manage and cultivate relationships with investors to secure and expand recurring revenue streams \n● Work in partnership with the management team, board of directors, CEO to create a five-year plan and implement product roll-out. \n● Oversee and manage daily operations including business development, finance, legal, administration, and HR. \n● Interface with the Product team to ensure appropriate systems and achieve goals.  \n● Assist the management team and product team to establish product standards and procedures for customers.  \n● Establish solid contacts with all areas and all levels at the client’s organization as well as partner’s interdepartmental.  \n● Constantly monitor support services to customers to coordinate and ensure timely, accurate and complete solutions when a problem\nor crisis arises. \n● Actively participate at regular and ad-hoc client service review monthly and quarterly meetings.  \n● Coordinate activities across various locations for clients that operate the product platform. \nAtlassian \n                  Ho Chi Minh City (Nov 2014- Dec 2015) \nOperation Program Specialist \n● Plan, direct and coordinate the operations of the company, including public & private sector of the organization. \n● Direct and coordinate activities of departments concerning product teams, admin team, finance and HR team. \n● Establish and implement activity reports and performance data to measure productivity, goal achievement in order to determine\nareas needing cost structuring and program improvement. \n● Determine the necessities to improve staffing requirements from Sydney, as well as restructuring current teams and setting up new\nteams. \n● Strategize, develop and lead all the online and offline marketing campaigns, events, branding images of Atlassian in Vietnam. \nT&J Electronic (Singapore) Pte. Ltd.\n                           Ho Chi Minh City / Singapore (Dec 2011- Jul 2014) \nRepresentative / Business Executive \n● Started a cold desk, focused on BMS, and electrical segment for construction projects. \n● Set up the representative office in Vietnam – Market Entry Product for the Vietnam market.\n● Research and develop marketing opportunities by identifying consumer requirements. \n● Evaluate product positioning by defining the market, competitor’s shares, strengths & weaknesses. \n● Establish pricing strategies; recommend sales prices; monitor cost, inventory, supply and demand. \n● Formulate business development plan, management strategy, annual forecast by analyzing marketing and sales information from\nindustry annual reports & reviews. \n● Maintain sustainable rapport with key accounts by making periodic visits, exploring and responding promptly to specifics need, and\nanticipating new opportunities; aggressively develop new accounts.  \nEDUCATION: \nArizona State University\n                            Tempe, Arizona  \nBachelors of Science in Economics\n        August 2011 \nMinor in Mathematics \nMinor in Business\nInternational Business Certificate \nStudied 3 years of Electrical Engineering  \nCONSULTANCY FREELANCE ACTIVITIES: \nBain Singapore \nClient: Non-Disclosure  \n●\nFieldwork Market Research (FMR) on convenience stores: mystery & accompanied shopping, data collection \n●\nFMR on beer & spirit: area sampling, content analysis, distribution channel, product pricing\nDCG Capital Singapore \nClient: Non-Disclosure \n●\nFieldwork market research on restaurants \n●\nDue Diligence, Data Collection, Data Entry and Data Processing \n●\nConsistency Check, Back Check, Cross-Validation, Quality Control \nUniversum Singapore \nClient: Pepsi Vietnam, Unilever Vietnam \n●\nMarket Research on Professional and Student Career Preference\n●\nCommunicated with clients to understand and narrate the project’s objectives \n●\nDesigned and assisted clients in the development of questionnaires and moderator guides to ensure necessary data is captured  \n●\nOrganized events, roundtable, interview sections targeting the focus group including universities and FMCG companies  \n●\nLed and conducted online/offline fieldwork, data collection with teams \n●\nExamined the procedure’s qualities, daily reports and updates to clients  \nThe Pathernon Group Mumbai \nClient: Non-Disclosure  \n●\nFieldwork Market Research on education \n●\nConsulted on projects requirements, objectives in order to designing interview questions \n●\nAnalyzed, translated and presented results through data collections  \nAstoria Road\n●\nOperation Structuring: customer service, ordering process, digital marketing strategies \nSKILLS: \n● Languages: English (Fluent), Vietnamese (Native), Mandarin Chinese (Intermediate), and French (Intermediate)  \n● Software: Microsoft Office Suite (Word, Excel, Access, FrontPage, PowerPoint), SPSS (Statistics Software), Visual Basic and C++ \n● Certified NLP Neuro Linguistic Programming Experience Core Concepts and Tools \nREFERENCES: \n● Available upon request.  ", "educations": [{"id": 5319, "gpa": null, "major": "Kinh tế", "school": "Arizona State University", "diploma": "Bachelors", "end_time": "2011-08-01T00:00:00Z", "conf_score": 0.8833155167215467, "start_time": null, "picklist_major": "Economical", "major_categories": "Khoa học xã hội và hành vi", "major_categories_detail": "Kinh tế học"}], "experiences": [{"id": 17816, "detail": "● Lead the planning, development, and implementation of product launches.\n● Develop deep relationships with key stakeholder individuals and leaders across the team globally to execute essential projects & and deliver business contracts’ milestones.\n●Deliver operational strategic proposals and recommendations to the leadership team in order to aid them with key business insights and high-priority initiatives and enable data-driven decision making.\n●Be pivotal in supporting CEO oversee business performance reporting and scale best practices across the organization.\n●Be pivotal in helping articulate the CEO’s vision and track progress against company goals.\n●Help coordinate business-wide procedures and work to improve existing processes from product operations, to customer success, business development, and etc. for maximum clarity, efficiency, and success.", "company": "Anduin Transactions", "end_time": "2023-04-13T00:00:00Z", "industry": "Other", "position": "Business Operation Expert", "conf_score": 0.8868921351622717, "start_time": "2019-02-01T00:00:00Z"}, {"id": 17817, "detail": "● Seek, manage and cultivate relationships with investors to secure and expand recurring revenue streams\n● Work in partnership with the management team, board of directors, CEO to create a five-year plan and implement product roll-out.\n● Oversee and manage daily operations including business development, finance, legal, administration, and HR. ● Interface with the Product team to ensure appropriate systems and achieve goals.\n● Assist the management team and product team to establish product standards and procedures for customers.\n● Establish solid contacts with all areas and all levels at the client’s organization as well as partner’s interdepartmental.\n● Constantly monitor support services to customers to coordinate and ensure timely, accurate and complete solutions when a problem or crisis arises.\n● Actively participate at regular and ad-hoc client service review monthly and quarterly meetings.\n● Coordinate activities across various locations for clients that operate the product platform.", "company": "Egopulse", "end_time": "2018-12-31T00:00:00Z", "industry": "Other", "position": "Operation Manager", "conf_score": 0.9267461044478271, "start_time": "2015-12-01T00:00:00Z"}, {"id": 17818, "detail": "● Plan, direct and coordinate the operations of the company, including public & private sector of the organization.\n● Direct and coordinate activities of departments concerning product teams, admin team, finance and HR team.\n● Establish and implement activity reports and performance data to measure productivity, goal achievement in order to determine areas needing cost structuring and program improvement.\n● Determine the necessities to improve staffing requirements from Sydney, as well as restructuring current teams and setting up new teams.\n● Strategize, develop and lead all the online and offline marketing campaigns, events, branding images of Atlassian in Vietnam.", "company": "Atlassian", "end_time": "2015-12-31T00:00:00Z", "industry": "Other", "position": "Operation Program Specialist", "conf_score": 0.9267461044478271, "start_time": "2014-11-01T00:00:00Z"}, {"id": 17819, "detail": "● Started a cold desk, focused on BMS, and electrical segment for construction projects.\n● Set up the representative office in Vietnam - Market Entry Product for the Vietnam market.\n● Research and develop marketing opportunities by identifying consumer requirements.\n● Evaluate product positioning by defining the market, competitor’s shares, strengths & weaknesses.\n● Establish pricing strategies; recommend sales prices; monitor cost, inventory, supply and demand.\n● Formulate business development plan, management strategy, annual forecast by analyzing marketing and sales information from industry annual reports & reviews.\n● Maintain sustainable rapport with key accounts by making periodic visits, exploring and responding promptly to specifics need, and anticipating new opportunities; aggressively develop new accounts.\nEDUCATION: Tempe, Arizona A", "company": "T&J Electronic (Singapore) Pte. Ltd.", "end_time": "2014-07-31T00:00:00Z", "industry": "Other", "position": "Representative / Business Executive", "conf_score": 0.8921375427801328, "start_time": "2011-12-01T00:00:00Z"}], "address": "53 B 2nd Street, Lu Gia Apartment Ward 15, District 11 Ho Chi Minh City, Vietnam"}