{"skills": ["manual testing", "hard working", "management tool", "studio", "java", "testing", "agile", "automation", "svn", "python", "jira", "desktop", "process development", "ea", "linux", "qtp", "automation testing", "mysql", "android sdk", "testcomplete", "emulator", "security", "leadership skill", "manage test", "problem solving", "regression", "sql", "selenium", "visual studio", "c#", "srs", "scripting", "scripting language", "automation testing tool", "zephyr", "rhel", "mobile application", "functional testing", "development testing", "implementation", "window 7", "software development", "sdlc", "android", "component testing", "tester", "management", "java language", "communication skill", "risks"], "fulltext": "VO VINH PHUOC \nAddress: 452 Nguyen Thai Son Street, Go Vap district \nHo Chi Minh City, Vietnam \nDate of Birth: Feb 26, 1983 \nSex: Male \nCell: (+84) 909 869 279 \nEmail: vinhphuocvo2179@gmail.com \nSUMMARY \n8+ years of experience in software testing of desktop, web and mobile applications. Expertise in manual testing in term \nof designing test plans, test cases, test approaches to reach the highest test efficiently in a suitable time and familiar \nwith different testing techniques and test types. Strength in automation testing via TestArchitect tool, able to design the \ngood frameworks to adapt the application’s changes. Fimiliar with many SDLC models, especially Agile. \nExperience in effective communication, team work and customer service. Working hard, self-motivation and self-\nesteem. \nTECHNICAL SKILLS \nFundamental Software Testing Skills: \n \nFamiliar with different levels of testing (component, iteration, system and acceptant testing); functional as \nwell as non-functional test (performance test, load test, stress test, security test..) \n \nFamiliar with many test design methodologies such as Action Based Testing (Advanced), top down, bottom up \n \nExperience in quality controls via different artifacts such as quantity and quality of bugs/test cases, \ndevelopment/testing progress, reports… \n \nGood at creating test plans, test strategies, test cases and testing reports \n \nExperience in bug reports and bug life cycle management \nManual Testing Skills: \n \nTest requirement analyzing (8+ year) \n \nTest case design/execute/maintain and ad-hoc testing (8+ year) \n \nTest plan development (5+ year) \nAutomation Testing Skills \n \nAutomation tools: TestArchitect (6+ years), Selenium (basic), TestComplete (basic), QTP (basic) \n \nGood at capturing interfaces, implementing actions, using settings and configuration \n \nExperience in running regression, debugging and maintaining scripts efficiently \nOther skills \n \nAble to use many tests management tools: QC (3 years), Zephyr (2+ year), MTM (2+ years), Jira (3+ years), TFS \n(3+ year) \n \nCI/CD: TFS (2+ year), Jenkin (2+ year) \n \nExperience in software development process: Agile – Scrum (5+ year) \n \nOS: Windows, Linux, MAC \n \nScripting languages: C#, Java, VB script, Java Script \n \nDatabases: SQL, MySQL \nSOFT SKILLS \nCommunication skill \n \nEfficiently communicate with teams and clients \n \nExperience in many kinds of reports such as daily reports, end-sprint report, final testing reports \n \nExperience in supporting clients and troubleshoot issues. \n \nEscalate issues in time and follow till they’re done \n \nAble to do presentations to transfer knowledge \nLeadership skills \n \nStrength at problem-solving including technical, processes or human issues \n \nExperience in influent and motivating members by building the good relationship, setting the clear short-term, \nlong-term goals \nKEY CLIENTS \nWebsense, Halliburton, Ascom, EA, Elekta, IBI, General Mills and TestAchitect product \nEMPLOYMENT HISTORY \nLogiGear Corporation, Ho Chi Minh                                                                                                                \n  2008 - Present \n \nTest Architect project – Develop automation testing tool (May 2016 – present) \no \nProject features: Implement new features for design, manage test cases and test results as well as \nenhance automation capability to work with new platforms and browsers. \no \nPersonal Responsibilities/Contribution: Involved as Sr.Tester and Test Lead \nCreate and execute test plans; review test results and create test reports (end sprints, end releases) \nCreate, implement, execute and maintain test cases to verify all TestArchitect features. \nReview and handle difficult tasks in team. Support and train to team members \nSupport clients directly via email, support portal and Skype when they have any problems with \nTestArchitect. \no \nTechnical Environment: TFS, Jira, Zephyr, Jenkin, QC, API, WebDriver. \n \nHalliburton project – Support new APIs to work with datasets, actions and test suites in TA (Mar 2016 – \nApr 2016) \no \nProject features: Halliburton need to get/set/check datasets, actions and test suites via command-\nline or third-party application. This project is to support the APIs to resolve this request. \no \nPersonal Responsibilities/Contribution: Involved as Sr.Tester and Test Lead. \nWorking with PO, SM, Stakeholders to define the project scope as well as testing scope. Providing the \nestimation of testing and project schedule. Creating the test plan including all artifacts impacted to \nproduct quality such as testing scope, feature to be/not to be tested, impacted areas, testing \napproach, testing schedule and risks. Reviewing test designs and supporting team members to resolve \nthe impediments. Contribution in increase the automation coverage to 90% of test cases designed. \nCreating the reports after each sprint, testing phase. The owner of release management. \no Technical Environment: TA, C# harness, Python harness, Jira. \n \nElekta project – TA-QC integration enhancement (Jun 2015 – Dec 2015) \no \nProject features: ELEKTA is using TA as automation tool and QC as test manager tool. This project is \nto support some major enhancement requirements as below \n- \nAllow or block uploading tests from TA to QC based on Approval status and Revision \nTimestamp \n- \nAllow or block importing tests from QC to TA based on Approval status and Revision \nTimestamp \n- \nAllow or block uploading results from TA to QC based on Approval status and Revision \nTimestamp \no \nPersonal Responsibilities/Contribution: Involved as Sr.Tester. \n \nJoin the meetings with clients to get requirements and feedback \n \nCreating the test plan including all artifacts impacted to product quality such as testing scope, \nfeature to be/not to be tested, impacted areas, testing approach, testing schedule and risks. \n \nCreate and review the test case design, implementation and executation. \n \nCreating the reports after each sprint, testing phase. \n \nDo the demo to clients. \n \nSupport clients to troubleshoot issues via email and GoToMeeting. \no Technical Environment: TA, QC, Python harness, SVN, Jira \nIBI project – Support new APIs to import/export TestArchitect items (May 2015 – Jun 2015) \no \nProject features: IBI needs to import/export TA items such as test modules, actions, interfaces… \nthrough command-line or third-party application, instead of TA Application. This project is to \nimplement new APIs to support this request. \no \nPersonal Responsibilities/Contribution: Involved as Sr.Tester and Test Lead. \nWorking with PO, SM, Stakeholders to define the project scope as well as testing scope. Providing the \nestimation of testing and project schedule.  Creating the test plan including all artifacts impacted to \nproduct quality such as testing scope, feature to be/not to be tested, impacted areas, testing \napproach, testing schedule and risks. Reviewing test designs and supporting team members to resolve \nthe impediments. The owner of release management. \no Technical Environment: TA, Python harness, SVN, Jira \nHalliburton – TA-MTM integration (Jun 2014 – May 2015) \no \nProject features: Halliburton is using TA as automation tool and MTM as test manager tool. Therefore, \nthey need to exchange tests and results between TA and MTM. They also need to run test by TA in \nattended and un-attended mode on MTM. Here are the key features of project \n- \nMapping TA project with MTM project and doing the authorization \n- \nUploading and importing tests between TA and MTM \n- \nUploading results from TA to MTM \n- \nAssociation and create test methods on VS to call TA test cases on MTM \no \nPersonal Responsibilities/Contribution: Involved as Sr.Tester and Test Lead. \nCreating the test plan including all artifacts impacted to product quality such as testing scope, feature \nto be/not to be tested, impacted areas, testing approach, testing schedule and risks. Reviewing test \ndesigns and supporting team members to resolve the impediments. Monitor the testing results, \nprogress to make sure that project is on-track with good quality. Conducting and reviewing documents \nincluding user guides, installation guides and release notes. \no \nTechnical Environment: TA, Visual Studio 2013 and 2015, MTM, TFS, Jira. \nHalliburton – Automation support (Mar 2013 – July 2015) \no \nProject features: Halliburton is using TA tool to automate all their test cases. Applications of \nHalliburton using many different kinds of platforms (Java,.NET, Silverlight, Citrix, Window, Linux…) \nwith a lot of customize controls. This project is to provide the specific TA builds, actions, harness \nactions that help service team implement all Halliburton test cases. \no \nPersonal Responsibilities/Contribution: Involved as Project Lead and Sr.Tester \nAt the first time starting this project, working as Sr.Tester. Design/implement/execute test cases. Run \nregression. Then, transfer testing stuff to another tester and doing the management stuff. Working \nwith service team on the delivery processes. Defining the working scope for each release. Conducting \nand reviewing documents including user guides, installation guides and release notes. \no \nTechnical Environment: TA, Java,.NET, Sliverlight, Python, Window 7/8, Linux. \nWebsense – TA – QC integration (Sep 2012 – Jan 2014) \n \n \n \n \no \nProject features: Websense uses TA to automate their test cases. Their testing environment is Firefox \non Linux RHEL 6.3/6.4. Before using TA, Websense manages their test cases by QC. The main purpose \nof this project is to support Websense using TA to run all their test cases and synchronize tests/results \nbetween TA and QC \no \nPersonal Responsibilities/Contribution: Involved as Project Lead and Sr. Tester \nCommunication with PO, stakeholder to make clear all requirements, issues. Reproduce all issues \nreported by Websense. Support Websense directly in term of using TA, debugging scripts. Verify TA \nbuilds, patches before delivering to Websense. Review tasks of team members and send the reports. \no \nTechnical Environment: TA, QC, Python, Java, Firefox, Linux. \n \nTA – Automation on Android (Nov 2011 – Aug 2012) \no \nProject features: Develop TA Automation tool to work on Android Mobile. \no \nPersonal Responsibilities/Contribution: Senior Tester \nCreate/implement/executing/maintaining test cases to verify all TA actions, setting. Create and \nconfigure Android Emulator and real mobiles for testing. Review test cases, test scripts of other team \nmembers. Support lead to do the reports. \no \nTechnical Environment: TA, Java, Android SDK, Android 3.2/3.3/4.0/4.1. \n \nTA – Automation (Aug 2011 – Nov 2011) \no \nProject features: Develop TA Automation on different platforms. \no \nPersonal Responsibilities/Contribution: Senior Tester \nBuild scripts for testing TA Automation (actions and settings) on different platforms effectively. Assign \ntasks to team members. Review tasks and send reports to test lead. \no \nTechnical Environment: TA, Java, .NET 4.0/4.5, Win32, IE7/8/9, Firefox, Chrome, Lunix. \n \nEA – Pogo (Apr 2011 – Aug 2011) \no \nProject features: Pogo.com is a free online gaming website that offers over 100 casual games. This \nproject is about finding bugs of games and verify features on this website. \no \nPersonal Responsibilities/Contribution: Senior Tester \n- \nDaily meeting with clients and internal team \n- \nDo the ad-hoc testing \n- \nPost and verify bugs \no \nTechnical Environment: Testing techniques, Jira. \n \nAscom (Jan 2008 – May 2010) \no \nProject features: Ascom is a telecommunications company. They buy the testing service of LogiGear \nfor testing their applications and automate test cases as well. \no \nPersonal Responsibilities/Contribution: Tester \nResearch to configure testing environment including configure probes to simulate different devices. \nCommunicate with client directly on technical issues. \nDesign, implement, execute and maintain test cases. Run regression in each release. \no \nTechnical Environment: TA, Java, IE. \nEDUCATION AND TRAINING \nEducation: \n \nGo Vap High school (HCM, Vietnam)                    From 09/1999 – 09/2001 \n \nAssociate degree  at FPT-Aptech College (HCM, Vietnam)            From 08/2005 – 06/2007 \n \nAcademic English at Swinburne University (Melburne, Australia) From 05/2010 – 02/2011 \nFOREIGN LANGUAGE:  \nEnglish: Advanced. Able to communicate fluently in verbal and written. ", "educations": [{"id": 5342, "gpa": null, "major": "Academic English", "school": "FPT - Aptech College", "diploma": "Colleges", "end_time": "2007-06-01T00:00:00Z", "conf_score": 0.8495693678781365, "start_time": "2005-08-01T00:00:00Z", "picklist_major": "Other", "major_categories": "", "major_categories_detail": ""}, {"id": 5341, "gpa": null, "major": null, "school": "Go Vap High school", "diploma": "Other", "end_time": "2001-09-01T00:00:00Z", "conf_score": 0.7255079258306127, "start_time": "1999-09-01T00:00:00Z", "picklist_major": "Other", "major_categories": "", "major_categories_detail": ""}, {"id": 5343, "gpa": null, "major": null, "school": "Swinburne University", "diploma": "Bachelors", "end_time": "2011-02-01T00:00:00Z", "conf_score": 0.7513082139105881, "start_time": "2010-05-01T00:00:00Z", "picklist_major": "Other", "major_categories": "", "major_categories_detail": ""}], "experiences": [{"id": 17880, "detail": ") o\nProject features: Implement new features for design, manage test cases and test results as well as enhance automation capability to work with new platforms and browsers. o\nPersonal Responsibilities/Contribution: Involved as Sr.Tester and Test Lead Create and execute test plans; review test results and create test reports (end sprints, end releases)\nCreate, implement, execute and maintain test cases to verify all TestArchitect features.\nReview and handle difficult tasks in team. Support and train to team members\nSupport clients directly via email, support portal and Skype when they have any problems with\nTestArchitect. o", "company": "LogiGear Corporation", "end_time": "2023-04-13T00:00:00Z", "industry": "Other", "position": "Test Architect project", "conf_score": 0.8057740032377089, "start_time": "2008-01-01T00:00:00Z"}, {"id": 17882, "detail": "some major enhancement requirements as below\n- Allow or block uploading tests from TA to QC based on Approval status and Revision Timestamp - Allow or block importing tests from QC to TA based on Approval status and Revision Timestamp - Allow or block uploading results from TA to QC based on Approval status and Revision Timestamp o\nPersonal Responsibilities/Contribution: Involved as Sr.Tester. Join the meetings with clients to get requirements and feedback\nCreating the test plan including all artifacts impacted to product quality such as testing scope, feature to be/not to be tested, impacted areas, testing approach, testing schedule and risks.\nCreate and review the test case design, implementation and executation.\nCreating the reports after each sprint, testing phase.\nDo the demo to clients.\nSupport clients to troubleshoot issues via email and GoToMeeting.", "company": "Elekta project", "end_time": "2016-04-30T00:00:00Z", "industry": "Other", "position": "TA - QC integration enhancement", "conf_score": 0.7875619237897855, "start_time": "2016-03-01T00:00:00Z"}, {"id": 17883, "detail": "o\nProject features: Halliburton is using TA tool to automate all their test cases. Applications of\nHalliburton using many different kinds of platforms (Java,.NET, Silverlight, Citrix, Window, Linux...) with a lot of customize controls. This project is to provide the specific TA builds, actions, harness actions that help service team implement all Halliburton test cases. o\nPersonal Responsibilities/Contribution: Involved as Project Lead and Sr.Tester At the first time starting this project, working as Sr.Tester. Design/implement/execute test cases. Run regression. Then, transfer testing stuff to another tester and doing the management stuff. Working with service team on the delivery processes. Defining the working scope for each release. Conducting and reviewing documents including user guides, installation guides and release notes. o\nTechnical Environment: TA, Java,.NET, Sliverlight, Python, Window 7/8, Linux.", "company": "Halliburton", "end_time": "2015-07-31T00:00:00Z", "industry": "Other", "position": "Automation support", "conf_score": 0.9089868123963978, "start_time": "2013-03-01T00:00:00Z"}, {"id": 17884, "detail": "o\nProject features: IBI needs to import/export TA items such as test modules, actions, interfaces... through command-line or third-party application, instead of TA Application. This project is to implement new APIs to support this request. o\nPersonal Responsibilities/Contribution: Involved as Sr.Tester and Test Lead. Working with PO, SM, Stakeholders to define the project scope as well as testing scope. Providing the estimation of testing and project schedule. Creating the test plan including all artifacts impacted to product quality such as testing scope, feature to be/not to be tested, impacted areas, testing approach, testing schedule and risks. Reviewing test designs and supporting team members to resolve the impediments. The owner of release management. o Technical Environment: TA, Python harness, SVN, Jira", "company": "Elekta project", "end_time": "2015-06-30T00:00:00Z", "industry": "Other", "position": "TestArchitect", "conf_score": 0.6925429707670153, "start_time": "2015-05-01T00:00:00Z"}, {"id": 17885, "detail": "Project features: Halliburton is using TA as automation tool and MTM as test manager tool. Therefore, they need to exchange tests and results between TA and MTM. They also need to run test by TA in attended and un-attended mode on MTM. Here are the key features of project\n- Mapping TA project with MTM project and doing the authorization\n- Uploading and importing tests between TA and MTM - Uploading results from TA to MTM - Association and create test methods on VS to call TA test cases on MTM o\nPersonal Responsibilities/Contribution: Involved as Sr.Tester and Test Lead. Creating the test plan including all artifacts impacted to product quality such as testing scope, feature to be/not to be tested, impacted areas, testing approach, testing schedule and risks. Reviewing test designs and supporting team members to resolve the impediments. Monitor the testing results, progress to make sure that project is on-track with good quality. Conducting and reviewing documents including user guides, installation guides and release notes. o\nTechnical Environment: TA, Visual Studio 2013 and 2015, MTM, TFS, Jira.", "company": "Halliburton", "end_time": "2015-05-31T00:00:00Z", "industry": "Other", "position": "TA - MTM integration", "conf_score": 0.9089868123963978, "start_time": "2014-06-01T00:00:00Z"}, {"id": 17886, "detail": "Project features: Websense uses TA to automate their test cases. Their testing environment is Firefox on Linux RHEL 6.3/6.4. Before using TA, Websense manages their test cases by QC. The main purpose of this project is to support Websense using TA to run all their test cases and synchronize tests/results between TA and QC Personal Responsibilities/Contribution: Involved as Project Lead and Sr. Tester Communication with PO, stakeholder to make clear all requirements, issues. Reproduce all issues reported by Websense. Support Websense directly in term of using TA, debugging scripts. Verify TA builds, patches before delivering to Websense. Review tasks of team members and send the reports.\nTechnical Environment: TA, QC, Python, Java, Firefox, Linux.", "company": "Websense", "end_time": "2014-01-31T00:00:00Z", "industry": "Other", "position": "TA - QC integration", "conf_score": 0.7930266962839055, "start_time": "2012-09-01T00:00:00Z"}, {"id": 17887, "detail": "Create/implement/executing/maintaining test cases to verify all TA actions, setting. Create and configure Android Emulator and real mobiles for testing. Review test cases, test scripts of other team members. Support lead to do the reports. o\nTechnical Environment: TA, Java, Android SDK, Android 3.2/3.3/4.0/4.1.", "company": "Websense", "end_time": "2012-08-31T00:00:00Z", "industry": "Other", "position": "TA - Automation on Android", "conf_score": 0.8044069848419584, "start_time": "2011-11-01T00:00:00Z"}, {"id": 17888, "detail": "o\nProject features: Develop TA Automation on different platforms. o\nPersonal Responsibilities/Contribution: Senior Tester Build scripts for testing TA Automation (actions and settings) on different platforms effectively. Assign tasks to team members. Review tasks and send reports to test lead. o\nTechnical Environment: TA, Java, .NET 4.0/4.5, Win32, IE7/8/9, Firefox, Chrome, Lunix.", "company": "Websense", "end_time": "2011-11-30T00:00:00Z", "industry": "Other", "position": "TA - Automation", "conf_score": 0.7017163682865227, "start_time": "2011-08-01T00:00:00Z"}, {"id": 17889, "detail": "o\nProject features: Pogo.com is a free online gaming website that offers over 100 casual games. This project is about finding bugs of games and verify features on this website. o\nPersonal Responsibilities/Contribution: Senior Tester - Daily meeting with clients and internal team\n- Do the ad-hoc testing\n- Post and verify bugs o\nTechnical Environment: Testing techniques, Jira.", "company": "EA - Pogo", "end_time": "2011-08-31T00:00:00Z", "industry": "Other", "position": null, "conf_score": 0.6925429707670153, "start_time": "2011-04-01T00:00:00Z"}, {"id": 17890, "detail": "Research to configure testing environment including configure probes to simulate different devices.\nCommunicate with client directly on technical issues.\nDesign, implement, execute and maintain test cases. Run regression in each release. o\nTechnical Environment: TA, Java, IE.", "company": "Ascom", "end_time": "2010-05-31T00:00:00Z", "industry": "Other", "position": "Tester", "conf_score": 0.8044069848419584, "start_time": "2008-01-01T00:00:00Z"}], "address": "452 Nguyen Thai Son Street, Go Vap district Ho Chi Minh City, Vietnam"}