{"skills": ["credential", "translator", "twitter", "marketing", "union", "analysis", "sales", "data analysis", "medium", "management", "maintenance", "excel"], "fulltext": "Vu Huong Linh \nAddress:          76/74 ngo Van Ung, ngo cho Kham Thien, Hanoi, Vietnam \nPhone:             037-513-2289 \nEmail:              Linh.vu.huong.vn@gmail.com \nDOB: \n          07/05/1989 \nSUMMARY \nN1 Level in Japanese and IELTS 7.5 certificate for English with a Master Degree in Management of \nCultural Diveristy at Tilburg University (the Netherlands) and 3 years experience working with various \norganizations and industries in Vietnam, Japan and the Netherlands. My career path was designed \ntoward the goal of becoming a professional communicator to connect professionals around the globe \nand advance business. I hope the esteemed organization will view my credentials and qualifications as a \nbenefit for its endeavours and favourably considers my application as Conference/Meeting Interpreter \nand Business Asssitant.  \n PROFESSIONAL EXPERIENCE \nSales Executive \n                      June 2017 – Present \nSoftbank Telecom Vietnam \n \nResearching organizations and individuals online (via SNS) to identify new leads and \npotential new customers in Japanese market. \n \nContacting potential clients via email and phone to make appointment and establish rapport. \n \nMeeting clients to negotiate and close sales deal. Crafting contracts, tracking orders and \nmaintenance services. \nFreelance interpreter/ translator                                                                                          Sept 2015 – Feb 2016 \n \nGameStad Co., Ltd: Supported GameStad and Dutch entrepreneur to prepare documents, join \nmeeting and present at Tokyo Game Show 2015. Translated manuals and guides to introduce \nthe company to Japanese clients and customers. \n \nAssistant for Japanese Art Gallery in Bussum, the NL: assisted Mrs. Uchitani in opening a new \ngallery and making lesson plans to Dutch members and English-speaking customers. \nJapanese Communicator   \n       Oct 2012 – Jun 2014 \nVietsoftware International(VSII) , Hanoi, Vietnam (http://www.vsi-international.com/)  \n \nSupported Business Manager and Project Team Leader as a business support and project \ncoordinator. \n \nInterpreted meetings between Japanese customers and Vietnamese Engineering team. Translated \ndocuments from Japanese to Vietnamese and vice versa. \n \nGot promoted to Onsite project lead communicator after 2 months of employment. Orchestrated \ncommunication and assisted administrative tasks of onsite and offsite project teams.  \n \nResolved inquiries and conflicts via phone, emails, Skype and direct meetings and delivered projects \nunder pressure with top customer satisfaction rate from 80% to 90% on average. \nPage 1 of 2 \n \nCoordinated marketing campaigns for the Japanese market by proposing and delivering monthly \nsegmented emails with dynamic contents, and internal newsletters to investors and business \npartners.  \nACTIVITIES \nEvent planner and team leader at Vietnam National University (VNU) Youth Union  \n     Sept 2007 – Jun 2012 \n \nCollaborated with NGO groups to organize independent talks, seminars and workshops monthly. \n \nDirected and maneuvered Flash Mob event to promote LGBT rights with other universities. \n \nEnthusiastically supported the opening of the first English club and coached the team to score Second \nPlace in Language Competition for Non-major Universities in 2012.  \n \nCertified for exceptional contribution for Student Community in 2011-2012 and outstanding team \nleader by the President of Vietnam Coordination UNDV at International Vesak Day 2008.                        \nEDUCATION \nTilburg University, the Netherlands \n    April 2016 – Jun 2016 \nCertification: Economics for International Students \nTilburg University, the Netherlands \n      Aug 2014 – Oct 2015 \nMaster of Cultural Diversity Management \n \nAcademic Excellence Scholarship for Non-EU students \n \nOrganizational communication management, cultural training and data analysis. \nTokyo University, Japan \n      Oct 2010 – Aug 2011 \n \nAssociate degree of Arts (Japanese Studies) – Exchanged short-term program \nUniversity of Social Sciences and Humanities, Vietnam \n     Sept 2007 – Jun 2012 \nBachelor of Oriental Studies (Japanese Studies) \n \nFirst place at Vietnam National University’s Research Contest and received Honor Scholarship.  \nSKILLS \nLanguage \nFluent in English (IELTS 7.5) and Japanese (JLPT N1) \nComputer \nMS Office (Word, Excel, PowerPoint and Outlook), Social media (Twitter, Facebook, \nInstagram, Pinterest and LinkedIn). \nOTHERS \nHobbies \nRunning and reading books. \nPage 2 of 2 ", "educations": [{"id": 5329, "gpa": null, "major": "Quản lý văn hóa", "school": "Tilburg University", "diploma": "Masters", "end_time": "2015-10-01T00:00:00Z", "conf_score": 0.9030093534426143, "start_time": "2014-08-01T00:00:00Z", "picklist_major": "Other", "major_categories": "Nhân văn", "major_categories_detail": ""}, {"id": 5327, "gpa": null, "major": "Quản lý văn hóa", "school": "Tilburg University", "diploma": "Masters", "end_time": null, "conf_score": 0.8891934643122615, "start_time": null, "picklist_major": "Other", "major_categories": "Nhân văn", "major_categories_detail": ""}, {"id": 5328, "gpa": null, "major": null, "school": "Tilburg University", "diploma": "Bachelors", "end_time": "2016-06-01T00:00:00Z", "conf_score": 0.7563362100565447, "start_time": "2016-04-01T00:00:00Z", "picklist_major": "Other", "major_categories": "", "major_categories_detail": ""}, {"id": 5330, "gpa": null, "major": "Ngôn ngữ Nhật", "school": "Tokyo University, Japan", "diploma": "Other", "end_time": "2011-08-01T00:00:00Z", "conf_score": 0.7625990117186952, "start_time": "2010-10-01T00:00:00Z", "picklist_major": "Interpreter/ Translator", "major_categories": "Nhân văn", "major_categories_detail": "Ngôn ngữ, văn học và văn hóa nước ngoài"}, {"id": 5331, "gpa": null, "major": "Ngôn ngữ Nhật", "school": "University of Social Sciences and Humanities", "diploma": "Bachelors", "end_time": "2012-06-01T00:00:00Z", "conf_score": 0.8379494114911681, "start_time": "2007-09-01T00:00:00Z", "picklist_major": "Interpreter/ Translator", "major_categories": "Nhân văn", "major_categories_detail": "Ngôn ngữ, văn học và văn hóa nước ngoài"}], "experiences": [{"id": 17838, "detail": "Researching organizations and individuals online (via SNS) to identify new leads and potential new customers in Japanese market.\nContacting potential clients via email and phone to make appointment and establish rapport.\nMeeting clients to negotiate and close sales deal. Crafting contracts, tracking orders and maintenance services.", "company": "Softbank Telecom Vietnam", "end_time": "2023-04-13T00:00:00Z", "industry": "Banking", "position": "Sales Executive", "conf_score": 0.9174648511369632, "start_time": "2017-06-01T00:00:00Z"}, {"id": 17839, "detail": ": Supported GameStad and Dutch entrepreneur to prepare documents, join meeting and present at Tokyo Game Show 2015. Translated manuals and guides to introduce the company to Japanese clients and customers.", "company": "GameStad Co., Ltd", "end_time": "2016-02-29T00:00:00Z", "industry": "High Technology", "position": "Freelance interpreter/ translator", "conf_score": 0.9303495280662989, "start_time": "2015-09-01T00:00:00Z"}, {"id": 17840, "detail": "Interpreted meetings between Japanese customers and Vietnamese Engineering team. Translated documents from Japanese to Vietnamese and vice versa.\nGot promoted to Onsite project lead communicator after 2 months of employment. Orchestrated communication and assisted administrative tasks of onsite and offsite project teams.\nResolved inquiries and conflicts via phone, emails, Skype and direct meetings and delivered projects under pressure with top customer satisfaction rate from 80% to 90% on average.\nCoordinated marketing campaigns for the Japanese market by proposing and delivering monthly segmented emails with dynamic contents, and internal newsletters to investors and business partners.", "company": "Vietsoftware International(VSII)", "end_time": "2014-06-30T00:00:00Z", "industry": "High Technology", "position": "Japanese Communicator", "conf_score": 0.9088497143098518, "start_time": "2012-10-01T00:00:00Z"}], "address": "76/74 ngo Van Ung, ngo cho Kham Thien, Hanoi, Vietnam"}