{"skills": ["office administration", "payment", "insurance", "fund management", "contracting", "medical insurance", "opening accounts", "basecamp", "contract administration", "drafting contracts", "auditing", "accounting", "solidedge", "buy", "calculating salaries"], "fulltext": "Edited with the trial version of \nFoxit Advanced PDF Editor\n\n HỌC VẤN\nTo remove this notice, visit:\nwww.foxitsoftware.com/shopping\nĐẠI HỌC CÔNG NGHIỆP HÀ NỘI\n09/2008 - 09/2011\nHệ Cao Đẳng Khoa Kế toán - Kiểm toán\nĐẠI HỌC THƯƠNG MẠI\n09/2012 - 08/2015\nKhoa Kế toán - Kiểm toán\n\nKINH NGHIỆM LÀM VIỆC\nCÔNG TY TNHH TOPCHAINS VINA LOGISTICS\n05/2018 - HIỆN TẠI\nNhân Viên Kế toán\n- Kiểm tra đối chiếu số liệu và sự cân đối giữa các đơn vị nội bộ, giữa chi tiết và tổng hợp.\n- Thu thập, xử lý các số liệu kế toán liên quan đến các hoạt động kinh tế phát sinh của doanh\nnghiệp như: hoá đơn, phiếu thu, chi, chứng từ giao dịch ngân hàng... Sau đó kiểm tra tính hợp\nlệ hợp pháp của các chứng từ kế toán liên quan đến các nghiệp vụ kinh tế phát sinh và tiến\nhành ghi chép vào các sổ sách liên quan.\n- Hạch toán thu nhập, công nợ, thuế GTGT, các nghiệp vụ khác...\n– Kiểm tra hóa đơn đầu vào, đầu ra, nhập liệu vào phần mềm kế toán.\n- Theo dõi và quản lý công nợ phải thu, phải trả.\n– Kiểm soát doanh thu, chi phí để đảm bảo các khoản doanh thu, chi phí đã được ghi nhận\nđúng;\n- Cung cấp số liệu cho ban giám đốc hoặc các cơ quan chức năng khi có yêu cầu, giải trình số\nliệu cho cơ quan thuế hay các cơ quan chức năng khác khi có thắc mắc.\n- Lưu trữ các sổ sách, chứng từ kế toán của công ty theo quy định.\n– Theo dõi BHXH,BHYT.\n– Theo dõi các thể loại hợp đồng kinh doanh.\n– Quản lý quỹ tiền mặt, theo dõi thu – chi cho văn phòng.\nCÔNGTY CP THÀNH GIAO MIỀN BẮC - LAM DUY\n03/2013 - 07/2016\nNhân Viên Kế toán nội bộ kiêm hành chính văn phòng\n- Lập chứng từ tình hình xuất nhập, nhập - xuất hàng căn cứ vào các chứng tư ghi sổ theo dõi\nvà quản lý được các luồng hàng qua kho lên báo cáo nhập xuất tồn hàng.\n- Mở tài khoản ngân hàng, lập uỷ nhiệm chi, séc rút tiền, thực hiện việc nộp tiền vào tài khoản.\nCăn cứ vào các chứng từ ghi sổ Theo dõi luồng tiền thông qua ngân hàng và đến cuốitháng\nđối chiếu với sổ phụ và quản lý tiền tại ngân hàng.- Soạn thảo hợp đồng lao động, quản lý hợp\nđồng lao động theo quy định luật pháp. Xây dựng Quy chế lương, tính và thanh toán lương,\nquản lý và theo dõi các bảo hiểm như bảo hiểm xã hội, bảo hiểm y tế, bảo hiểm thất nghiệp.\n- Theo dõi các khoản phải thu, tình hình thu tiền và tình trạng công nợ của khách hàng.\n- Tiếp nhận các công văn, văn bản, giấy tờ chuyển đến và được phép giải quyết nhanh\ntrongthẩm quyền. Lưu trữ các dữ liệu, văn bản tài liệu của công ty.\n- Tiếp nhận và xử lý các trường hợp báo cáo về tình trạng của nhân viên: ốm đau, hiếu hỉ,thai\nsản...\n- Lập và theo dõi chế độ đãi ngộ đảm bảo quyền lợi cho nhân viên\n- In ấn các tài liệu cần thiết và theo yêu cầu của các phòng ban\n- Chấm công hàng tháng\n- Tính lương, thưởng hàng tháng và trình lên lãnh đạo duyệt\n- Chi trả lương cho nhân viên\n- Nghe điện, giao dịch với khách hàng; đón tiếp khách trước khi bắt đầu làm việc với lãnh đạo\n- Hỗ trợ tài liệu, nước, thiết bị... cần thiết cho các cuộc họp của công ty\n- Lên bảng kê về những văn phòng phẩm cần thiết cho công ty theo từng tháng và có kếhoạch\nmua.\n- Có kế hoạch tuyển dụng và tổ chức tuyển dụng, phân phối nhân sự cho các phòng ban,theo\ndõi nhân sự thử việc và tổ chức ký kết hợp đồng lao động\n- Theo dõi và có báo cáo thường xuyên cho lãnh đạo về tình hình nhân sự hàng tháng- Cập\nnhật và đảm bảo hồ sơ nhân viên đầy đủ theo quy định của pháp luật.\nNGUYỄN THU HƯƠNG\nNhân viên Kế toán hoặc Hành chính VP\n\n Nữ\n\n\n\n\nMỤC TIÊU NGHỀ NGHIỆP\n- Thu nhập ổn định\n- Có cơ hội thăng tiến tốt trong công\nviệc\n- Mong muốn được làm việc trong môi\ntrườngchuyên nghiệp, năng động và\nthử thách, nâng caokiến thức và kinh\nnghiệm chuyên môn.\n- Nỗ lực tối đa để hoàn thành tốt các\nnhiệm vụđược giao, góp phần xây\ndựng sự nghiệp cá nhân,đóng góp cho\nsự phát triển của công ty.\nKỸ NĂNG\nTin học văn phòng\nTiếng Anh\nSỞ THÍCH\nNghe nhạc\nXem phim\nEdited with the trial version of \nFoxit Advanced PDF Editor\n\nHOẠT ĐỘNG\nTo remove this notice, visit:\nwww.foxitsoftware.com/shopping\nNHÓM TÌNH NGUYỆN\n01/2013 - 03/2014\nTình nguyện viên\nTập hợp các món quà và phân phát tới người vô gia cư.\n- Chia sẻ, động viên họ vượt qua giai đoạn khó khăn, giúp họ có những suy nghĩ lạc quan.\n\nCHỨNG CHỈ\nTiếng Anh và Kế toán máy\n2011\n\nGIẢI THƯỞNG\n2015\nNhân viên xuất sắc nhiệt tình trong công việc công ty CP Thành Giao\nMiền Bắc - Lam Duy\n\nNGƯỜI THAM CHIẾU\n© topcv.vn", "educations": [{"id": 5371, "gpa": null, "major": "Kế toán", "school": "ĐẠI HỌC CÔNG NGHIỆP HÀ NỘI", "diploma": "Bachelors", "end_time": "2011-09-01T00:00:00Z", "conf_score": 0.9574498536255347, "start_time": "2008-09-01T00:00:00Z", "picklist_major": "Accounting", "major_categories": "Kinh doanh và quản lý", "major_categories_detail": "Tài chính – Ngân hàng – Bảo hiểm"}, {"id": 5372, "gpa": null, "major": "Kế toán", "school": "ĐẠI HỌC THƯƠNG MẠI", "diploma": "Bachelors", "end_time": "2015-08-01T00:00:00Z", "conf_score": 0.9488422326738737, "start_time": "2012-09-01T00:00:00Z", "picklist_major": "Accounting", "major_categories": "Kinh doanh và quản lý", "major_categories_detail": "Tài chính – Ngân hàng – Bảo hiểm"}], "experiences": [{"id": 17972, "detail": "- Kiểm tra đối chiếu số liệu và sự cân đối giữa các đơn vị nội bộ, giữa chi tiết và tổng hợp.\n- Thu thập, xử lý các số liệu kế toán liên quan đến các hoạt động kinh tế phát sinh của doanh nghiệp như: hoá đơn, phiếu thu, chi, chứng từ giao dịch ngân hàng... Sau đó kiểm tra tính hợp lệ hợp pháp của các chứng từ kế toán liên quan đến các nghiệp vụ kinh tế phát sinh và tiến hành ghi chép vào các sổ sách liên quan.\n- Hạch toán thu nhập, công nợ, thuế GTGT, các nghiệp vụ khác...\n- Kiểm tra hóa đơn đầu vào, đầu ra, nhập liệu vào phần mềm kế toán.\n- Theo dõi và quản lý công nợ phải thu, phải trả.\n- Kiểm soát doanh thu, chi phí để đảm bảo các khoản doanh thu, chi phí đã được ghi nhận đúng;\n- Cung cấp số liệu cho ban giám đốc hoặc các cơ quan chức năng khi có yêu cầu, giải trình số liệu cho cơ quan thuế hay các cơ quan chức năng khác khi có thắc mắc.\n- Lưu trữ các sổ sách, chứng từ kế toán của công ty theo quy định.\n- Theo dõi BHXH,BHYT. - Theo dõi các thể loại hợp đồng kinh doanh.\n- Quản lý quỹ tiền mặt, theo dõi thu - chi cho văn phòng.", "company": "CÔNG TY TNHH TOPCHAINS VINA LOGISTICS", "end_time": "2023-04-13T00:00:00Z", "industry": "Transportation & Logistics", "position": "Nhân Viên Kế toán", "conf_score": 0.9542271074073599, "start_time": "2018-05-01T00:00:00Z"}, {"id": 17973, "detail": "- Lập chứng từ tình hình xuất nhập, nhập - xuất hàng căn cứ vào các chứng tư ghi sổ theo dõi và quản lý được các luồng hàng qua kho lên báo cáo nhập xuất tồn hàng.\n- Mở tài khoản ngân hàng, lập uỷ nhiệm chi, séc rút tiền, thực hiện việc nộp tiền vào tài khoản.\nCăn cứ vào các chứng từ ghi sổ Theo dõi luồng tiền thông qua ngân hàng và đến cuốitháng đối chiếu với sổ phụ và quản lý tiền tại ngân hàng.- Soạn thảo hợp đồng lao động, quản lý hợp đồng lao động theo quy định luật pháp. Xây dựng Quy chế lương, tính và thanh toán lương, quản lý và theo dõi các bảo hiểm như bảo hiểm xã hội, bảo hiểm y tế, bảo hiểm thất nghiệp.\n- Theo dõi các khoản phải thu, tình hình thu tiền và tình trạng công nợ của khách hàng.\n- Tiếp nhận các công văn, văn bản, giấy tờ chuyển đến và được phép giải quyết nhanh trongthẩm quyền. Lưu trữ các dữ liệu, văn bản tài liệu của công ty.\n- Tiếp nhận và xử lý các trường hợp báo cáo về tình trạng của nhân viên: ốm đau, hiếu hỉ,thai sản...\n- Lập và theo dõi chế độ đãi ngộ đảm bảo quyền lợi cho nhân viên\n- In ấn các tài liệu cần thiết và theo yêu cầu của các phòng ban\n- Chấm công hàng tháng\n- Tính lương, thưởng hàng tháng và trình lên lãnh đạo duyệt\n- Chi trả lương cho nhân viên\n- Nghe điện, giao dịch với khách hàng; đón tiếp khách trước khi bắt đầu làm việc với lãnh đạo\n- Hỗ trợ tài liệu, nước, thiết bị... cần thiết cho các cuộc họp của công ty\n- Lên bảng kê về những văn phòng phẩm cần thiết cho công ty theo từng tháng và có kếhoạch mua.\n- Có kế hoạch tuyển dụng và tổ chức tuyển dụng, phân phối nhân sự cho các phòng ban,theo dõi nhân sự thử việc và tổ chức ký kết hợp đồng lao động\n- Theo dõi và có báo cáo thường xuyên cho lãnh đạo về tình hình nhân sự hàng tháng- Cập nhật và đảm bảo hồ sơ nhân viên đầy đủ theo quy định của pháp luật.", "company": "CÔNGTY CP THÀNH GIAO MIỀN BẮC - LAM DUY", "end_time": "2016-07-31T00:00:00Z", "industry": "Other", "position": "Nhân Viên Kế toán nội bộ kiêm hành chính văn phòng", "conf_score": 0.9664944150740037, "start_time": "2013-03-01T00:00:00Z"}], "address": null}