{"skills": ["linux", "aws", "unix", "angular", "freebsd", "network topology", "ssd", "isp", "load balancing", "java", "agile", "client server", "tcp", "apache", "cloud", "mobile device", "mongodb", "eauthentication", "dns", "management", "gitlab", "multi server", "proxy", "udp", "administration", "cloud storage", "bluetooth", "git", "virtualbox", "dom", "analysis", "kotlin", "redis", "router", "react native", "mysql", "swift", "radius", "android", "switch", "search", "cordova", "ssh", "desktop", "nosql", "debian", "nginx", "encryption", "php", "css", "port forwarding", "crs", "encrypted data", "phonegap", "objective c", "reactjs", "system design", "dynamodb", "database", "memcached", "database design", "cdn", "teamwork", "cloud data", "cloud cdn", "distributed system", "problem solving", "private network", "database model", "protocol", "html", "system architecture"], "fulltext": "1 \n• \nFull name: Nguyễn Văn Toàn (called as Tom).  \n• \nBirthday: March 25th, 1988.  \n• \nGender: Male \n• \nPosition applied: Senior Video Stream Engineer \n• \nLocate: Ho Chi Minh City \nSUMMARY  \n• \nKeen on many IT skills, ever startup.  \n• \nGraduated universities with three degrees, Engineer of Electronics-Telecommunications, Bachelor \nof Business and Administration and Engineer of Information Technology.  \n• \nPre-PMP at FMIT in 2014.  \nOBJECTIVE  \n• \nFinding a startup company to fight for success; \n• \nBuilding startup company product from beginning stage or develop with team.  \nEDUCATION  \n• \nEngineering of Information Technology, Posts and Telecommunications Institute of \nTechnology.  \n• \nEngineering of Electronics & Telecommunications, Posts and Telecommunications Institute of \nTechnology.  \n• \nBachelor of Business and Administration, Business and Administration, Open University.  \n• \nPre PMP, FMIT 2014.  \n TECHNICAL SKILLS  \n• \nWeb:  \n- \nHTML: Version 5, Master, DOM, element, node or data attribute, coding, debug, and optimize.  \n- \nCSS: Version 3, Master, coding, debug and optimize.  \n- \nJS: ESMAC6, Master, coding, analysis, debug and optimize.  \n- \nLow level and basically-core coding, framework as ReactJS, Angular, is still ok.  \n- \nBuilding Google Closure core project for team to code, arrange and optimize team code.  \n- \nBuilding project core functions/library for team to apply.  \n- \nObfuscated/Minified code before publishing to user.  \n2 \n• \nServer:  \n- \nNodejs: install, config, implement, optimize and secure application system.  \n- \nNginx: install, config, for proxy, load balancing, debug and test system topology.  \n- \nRedis: install, config, administrate, pub/stub for multiple chat, GEO location API.  \n- \nMongoDB: install, config, administrate, coding, optimize, design database models.  \n- \nVMWare: install, config for ESXi VMs, VLan network group, monitor application, API \nframework connection.  \n- \nVirtualBox: install, setup, administrate and SDK connect API.  \n- \nGit: install, config, setup and adjust functions flexibly as hooking at server/client side and \npermission, can work with concentration and distribution, help team deploy by pushing \ncommand/commit, resolve conflict, merge code and save team with and git related problem, \nalso change content of commit, author, committer, …  \n- \nGitlab: install, config and administrate system, connect HOOK, and adjust system detail, or \nGitlab load balancing one or multi-server for Redis, Postgres, SSH/SSHD, NFS, …  \n- \nNFS/UnionFS: install, config, merge many disks to a unified disk for larger capacitor.  \n- \nSSH/SSD: install, config, secure system access, detect and deal with connect to system by \nanother authentication.  \n- \nISPConfig: install, config, administrate, hock external API and connect to ISPConfig.  \n- \nLinux: Master Debian, User/Group permission, thread and process, CPU/Server bottleneck and \noptimization, ...  \n- \nHTTP/TCP/UDP/PORT/Sock/Socket/Domain proxy, OSI Layer Model, TCP/IP Layer Model.  \n- \nUFW/IP Table: install, config, administrate, routing IP/Port, or permit/denied access resources.  \n- \nRouter/Switch: setup and configure is ok for me, Port forwarding, NAT, Routing, Load \nbalancing ISP server from multi-ISP, also RADIUS connect is ok, …  \n- \nMySQL/Postgres/PHP/Java, … is ok for me.  \niOS:  \n- \nMaster Architecture, implement, debug, optimize with Objective C (recommend for low-level) \nand Swift. Also build base project for Team to start and build utility library/function to help \ncoder quickly completed features. Publish app and deal with iTuneConnect rule to submit and \nget rid of private API, denied functions/features.  \n- \nBuild Core, simple project, for team to implement, guide and review code and also optimize.  \nAndroid:  \n- \nReview and merge code, optimize team code as project coding guide line.  \n- \nCan coding with Java also Kotlin and submit Google PlayStore.  \nHybrid/Cross Platform:  \n- \nMaster PhoneGap/Cordova.  \n- \nKnow quickly other framework quickly as React Native and apply.  \n- \nCan build new cross-platform for mobile and desktop.  \nArchitecture:  \n- \nDesign and setup application system architecture in Software coding, pattern and model, micro \nservice in integrated system or distributed system, and Server system.  \n- \nDesign Server system architecture, server connecting topology, network connection, network \nprotocol and network topology.  \n• \n• \n• \n• \n3 \n- \nDesign private network and connection for application as VPN, SSH Tunneling, encryption \nconnection/data.  \n- \nDesign and implement cloud CDN depend on existed infrastructure.  \n- \nDatabase mirror/cluster with MongoDB.  \n- \nApplication Cluster/Multithread and Permission.  \n- \nDNS resolutions local/private solutions, encrypted data.  \n- \nCan apply Software and hardware to optimize for application system to match with goals.  \n- \nMonitor server system with solutions and DDOS mitigating solutions.  \n- \nMaster with Digital Ocean cloud.  \n- \nAWS is ok, ever work with EC2, S3, Elastic Beanstalks, Memcached, DynamoDB, RDS, …  \n- \nGCP: ever work with App Engine, Cloud Storage, Cloud Data Store (NoSQL), Cloud Memory \nStore.  \n Give me a problem or a situation I will reply you a better solution match your missions!  \n• \nManagement:  \n- \nExperiencing for 4 years of being worked as a CEO.  \n- \nCan manage, training and coach team up to 48 members (4 years of experience).  \n- \nTechnical transfer and reviewing.  \n- \nCan work with SCRUM/Agile or PMP project style, also Waterfall (IT section rarely to apply \ndue to many effected of CRs).  \n- \nSoft skill and Problem solving for a mission.  \nPRIOR WORKING EXPERIENCE:  \nHORICAL  \nDurations: FROM 5/2015 - 5/2019.  \n• \nDescription: Work as a CEO to build team for products ERP besides Outsourcing for US and \nVietnam markets.  \n• \nAccomplishments  \n- \nVSIP: Support VSIP (Vietnam Singapore Industrial Park) and their Tenant connect \nquickly, https://app.vsip.com.vn/   \n- \nMTB: Help worker to estimate car repairing and replacement for US market, \nhttps://www.mobiletechrx.com/about-us/   \n- \nCM: Collect user distance with kinds of workout as Run, Walk, Bike, \nhttps://charitymiles.org/  \n- \nStatUp: Manage football team and teammate skill and propose for potential players.  \n- \nSquint: Search content for key word from mobile device and read its content.  \n- \nMoxxly: Manage and statistic pump volume for mother after pregnant.  \n- \nDogtelligent: Manage Dog pet via phone Bluetooth.  \n- \n…  \n• \nTechnologies: Manager, Teamwork Management, VMWare, Sphere ESXI 6.x, Nginx, Apache, \nGitLab, Git LFS, SSH, HTTP2, ISPConfig, PAM, Dovecot, Postfix, ERP, Linux/Unix Kernel, \nFreeBSD, …  ", "educations": [{"id": 5362, "gpa": null, "major": "Quản lý đô thị và công trình", "school": "Open University", "diploma": "Bachelors", "end_time": "2014-01-01T00:00:00Z", "conf_score": 0.8047571763800655, "start_time": null, "picklist_major": "Architecture / Interior Design", "major_categories": "Kiến trúc và xây dựng", "major_categories_detail": "Kiến trúc và quy hoạch"}], "experiences": [{"id": 17950, "detail": "to build team for products ERP besides Outsourcing for US and\nVietnam markets.\n• Accomplishments - VSIP: Support VSIP (Vietnam Singapore Industrial Park) and their Tenant connect quickly, https://app.vsip.com.vn/\n- MTB: Help worker to estimate car repairing and replacement for US market, https://www.mobiletechrx.com/about-us/\n- CM: Collect user distance with kinds of workout as Run, Walk, Bike, https://charitymiles.org/\n- StatUp: Manage football team and teammate skill and propose for potential players.\n- Squint: Search content for key word from mobile device and read its content.\n- Moxxly: Manage and statistic pump volume for mother after pregnant.\n- Dogtelligent: Manage Dog pet via phone Bluetooth. - ... • Technologies: Manager, Teamwork Management, VMWare, Sphere ESXI 6.x, Nginx, Apache, GitLab, Git LFS, SSH, HTTP2, ISPConfig, PAM, Dovecot, Postfix, ERP, Linux/Unix Kernel, FreeBSD, ...", "company": "HORICAL", "end_time": "2019-05-31T00:00:00Z", "industry": "Other", "position": "CEO", "conf_score": 0.8763375212625228, "start_time": "2015-05-01T00:00:00Z"}], "address": null}