{"skills": ["stack", "docker", "java technology", "client server", "apache", "cloud service", "rest", "dojo", "xml schema", "unit test", "jaxp", "git", "html5", "analysis", "devops", "sap ui5", "management tool", "lifecycle", "mantis", "testing", "oracle", "cell phone", "jsp", "gson", "nec", "distributed system", "full stack development", "jetty", "telecom system", "software architecture", "java", "json", "wsdl", "javascript", "tcp", "cloud", "banking", "sql database", "enterprise", "reds", "maintenance", "asp", "desktop application", "xml processing", "manage test", "mocha", "qunit", "agile", "tdd", "payment", "xml", "management", "ant", "scrum master", "using sap", "performance management", "desktop", "debugger", "cloud foundry", "testlink", "orchestration", "ejb", "ias", "multi threaded application", "database", "mockito", "hibernate", "sap hana", "tomcat", "mongo", "automation", "selenium", "studio", "security", "jaxb", "swing", "dom", "j2ee", "bdd", "leadership skill", "engineering activity", "spring", "ajax", "xsl", "log4j", "sql", "sql database studio", "design pattern", "software development", "process model", "uml", "performance optimization", "process development", "orm", "junit", "m sql server", "glassfish"], "fulltext": "BANH TRIET DAT \nSenior Software Developer (T33) \nCell Phone: +84 906 980 240 \nEmail: trietdat@gmail.com  \nAddress: 361/3A Phan Van Tri St, Ward 11, Binh Thanh District, HCM city, Vietnam DOB: 20.10.1980 \nhttps://www.linkedin.com/in/dat-banh-6b35a1135/ \nHighlight \nBe expertise in Java and JavaScript as full-stack development, especially web-based applications and backend \npersistent layers. I have mindset of continuously learning and improvement of new things, so always equip \nmyself expertise knowledge in both software engineering and leadership skill. Therefore, I would like to keep \nlearning further about hands-on experience on orchestration chain tools of cloud development as well as \ntechnical solution architect on domain knowledge. \nEducation \nMaster Software Engineering \nIEI Institute, National University - Bordeaux, Vietnam  \nOct 2017 - Now \nBachelor of Science in Computing \nFPT - Greenwich University, Vietnam \nJul 2011 - Jun 2012 \nHigher Diploma in Software Engineering  \nFPT - Aptech, Vietnam  \nSep 2001 - Dec 2003 \nCertification \nSun Certified Java Programmer, Standard Edition 6 (SCJP6) \nAug 30, 2008 \nSun Certified Web Component Developer , Enterprise Edition 5 (SCWCD5) \nNov 08, 2008 \nEmployment History \nSAP Asia (Vietnam) \nJun 2009 to May 2019 \nViettel Tower, 14th Floor, 285 CMT8 St, Ward 12 \nDistrict 10, Ho Chi Minh city, Vietnam. \nHarveyNash Vietnam \nJul 2006 to May 2008 \nEtown2 building, 10th Floor, 364 Cong Hoa St \nTan Binh District, Ho Chi Minh city, Vietnam. \nSaiGon Software Development (SDC) \nJul 2004 to Jun 2006 \n10 Co Giang St, District 1, Ho Chi Minh city, Vietnam. \nPractical Skills \n \nJava JDK 1.8, Log4J, JUnit, and Mockito. \n \nJavascript, SAP UI5 framework, QUnit. \n \nNode JS, Mocha. \n \nMaven2, Ant. \n \nJava Persistence API (JPA), ORM Hibernate, EJB3. \n \nJava API for XML Processing (JAXP) using SAX and DOM. \n \nApache FOP (Formatting Object Processor) with XSL-FO for pdf generation, JasperReport and iReport tool \n \nREST API with Servlet, Gson and Java JSON processing. \n \nWeb Service and RPC with WSDL, Java/XML serialization/marshalling using JAXB library, and XML Schema Definition \n(XSD) \nWebsocket, a state full handshake connection between web-based client and server. \nInfrastructure as Code (IaS) in the Dockerized CI Jenkin based on Docker image, Dockerfile, Jenkin Job DSL, and \nPipeline syntax. \nDockerized Selenium E2E testing with selenium hub, browser node. \nApache Tomcat web server, Jetty, Glassfish. \nEclipse, atom, sublime text editor. \nMulti-threaded application, Software Architecture, Design Pattern. \nUML, TAM (Technical Architecture Modeling). \nGit source control. \nDatabases Oracle, PL/SQL, MS SQL Server, Inmemory DB, Mongo DB, My SQL \n \n \n \n \n \n \n \n \n \nProfessional Experiences \nSAP Asia (Vietnam) \nHANA Performance Management Tools (2016 - 2019) \n Description: A core component of HANA Cockpit 2.0 on SAP HANA Application Extended Services Advanced (XSA). It \nprovides solution of analysis, resolution about performance aspects of a database, this project is a web-tools based \nand consists of 4 components such as Performance Monitoring, Workload Analyzer, Capture and Replay, and SQL \nAnalyzer, which is used to interact with HANA database in order to support performance experts, even developers \nto analyze, capture, pre-process, replay workloads and visualize SQL plan in the performance optimization as well as \nintelligent database tuning. \n Responsibility and Role \n- \nDevelopment manager of HANA Performance Tools VN team in resource allocation, progress tracking, and \nmainly accountable for all agile development process and engineering activities, also connecting team members \nto delivery both HANA performance on-premise application and cloud services in time. \n- \nAlso play Scrum master role to drive and facilitate scrum artifacts in team. \n- \nTopic leader is involved in the development of Capture and Replay component together with other components. \n- \nJoin workshop in Korea to exchange about product vision together individual goals in team. \n Technology \n- \nJavascript, HTML5, SAP UI5 Framework. \n- \nJava, NodeJS, XS Advanced as micro service architecture based on cloud foundry specification. \n- \nEclipse-based Studio, atom, sublimetext editor. \n- \nDatabase: HANA In-memory. \n Achievement \n- \nAdopt the recent development process model of DevOps principles, Cloud Foundry Micro service, traceability \nimprovement, and single code line in Trunk based development including feature toggle, master red, TDD unit \ntest coverage and BDD acceptance test criteria together with automation pipeline in order to reach out to \nshorten cycle CD/CI HANA Cockpit 2.0 with different support packages such as SP06 (Apr 2018), SP07 (Jul 2018), \nSP08 (Oct 2019), SP09 (Jan 2019), and the latest SP10 (Apr 2019). \n- \nSetup the daily report notification of E2E selenium testing in HANA Performance team by using selenium \ndockerized system as IaC (Infrastructure as Code). \n- \nProvide daily performance measurement report by using SAP SUPA tool (Single User Performance Analysis)  and \nJenkin integration for automation notification to team which including aspects Web UI loading, latency, and \nresponse time… \n- \nUtilize dockerized TestLink, a web-based test case system management, which is used to manage test suits, test \nplan, and test case scenario which depicted by BDD syntax as common business language to team and other \nstakeholders. \n- \nCockpit for Operator Process has been formalized in cross-location team as DoD (Developer on Duty) including \ncustomer ticket handling, CVS (Centralized Validation System) upgrading. \n- \nDevelop Cockpit Fiori Lauchpad as entry point landscape for all components in SP07 – July 2018. \nSAP Web IDE and HRTT (2013 - 2016) \n Description: This project includes 2 flavors, one WEB IDE on HANA Application Extended Services Classic (XSC) and \nHANA Runtime Tools (HRTT) on HANA Extended Application Services Advanced (XSA) as micro service. This is a web-\nbased application tooling, which includes some core editors such as Editor, SQL Console, Data Preview involving \nadvanced web-based functionalities like Server Javascript Debugger, SQL Debugger … allow developers to be able to \neasily and quickly manage, develop SAP HANA application, compose SQL statements, and display artifact content in \ndatabase.  \n Responsibility and Role \n- \nTeam leaders are mainly in charge of team activities, development and delivery process. \n- \nSenior developer and also take a Product owner role in order to communicate with stakeholders for clear \nrequirements \n- \nBe trained and workshop with colleagues in Germany. \n Technology \n- \nJavascript, HTML5, SAP UI5 Framework. \n- \nNodeJS, XSJS (Extended Server Javascript), XS Advanced as micro service. \n- \nEclipse-based Studio, atom, sublimetext editor. \n- \nDatabase: HANA In-memory. \n Achievement \n- \nIntegrate four components as single product SAP Web IDE XSC including Editor, Catalog, Security and Trace. \n- \nRelease Web IDE XSC (HANA_IDE_CORE DU) in HANA Auto Content package in many Delivery Units (DU) for \nSPS10, and  SPS11 HANA 1 ... \n- \nSuccessfully migrate in parity, only Catalog component from SAP Web IDE HANA XSC to new product HANA \nRuntime Tools (HRTT) on XSA micro service with revision HANA 1 SPS11, SPS12. \nEnterprise Single Sign On (2011 - 2013) \n Description: Single Sign-On (SSO) is a system, which manages your accounts including username and passwords in \norder to automatically logon or single sign on into web based or desktop applications at client side. Besides, the \nsystem also provides a central management, which allows administrators to be able to synchronize SSO data \nbetween user client and server. \n Responsibility and Role: Software engineer. \n Technology \n- \nWeb Dynpro SAP Framework, EJB3 Persistence. \n- \nNetweaver AS Java. \n- \nEclipse-based Netweaver Studio. \n- \nDatabase: SQL Server. \nTrust Manager Enterprise (2009 - 2011) \n Description: An innovative solution for the lifecycle management of cards/tokens including recovery for lost or \nbroken cards. A distributed system works as n-tier architecture, which consists of components such as Key Server, \nCIS Server and RA-CIS Client,  Local/Remote Assistant Client. \n Responsibility and Role: Software engineer. \n Technology \n- \nJasper Report for PIN sheet delivery. \n- \nJava swing for client RA-CIS desktop-based application. \n- \nTCP socket, RMI for CIS and KEY server. \n- \nBuild installation package with Install Shield. \n- \nDatabase: Oracle 9i, 10g & 11. \nHarveyNash VietNam \nXLS (eXtended Loyalty System, 2006 - 2008) \n Description:  \n- \nThis is an outsourcing project, customer is WRT (Welcome Real Time), Singapore. \n- \nXLS is an enterprise solution which is developed by using Oracle and Java technology.  XLS adds enhanced EMV \ncapabilities to a bank’s payment authorization and processing system. \n- \nThis project includes many small projects and is developed with different versions. Each project takes 3, 4 man \nmonths. \n Responsibility and Role:  \n- \nSoftware engineer in development and maintenance \n- \nI went to Singapore to work and be trained from customer for 8 months \n Technology \n- \nStruts, Webwork, Hibernate and Spring, Velocity, Jasper Report, Quartz schedule and ajax dojo library. \n- \nApache Tomcat Server, Weblogic and Websphere. \n- \nEclipse 3.x IDE & Plugin, PLSQL Developer for Oracle DB, CVS, VSS Source Control, Maven2, Ant deploy tool, JUnit \nTesting, JDK 5.0. \n- \nDatabase: Oracle 9i & 10g. \n- \nMantis bug tracker system. \nSaiGon Software Development (SDC) \nNEC Project (2004 - 2006) \n Description: Our sourcing project, customer is Japanese market, this project mainly focused on banking application \nwhich is built for NEC (Japan) to manage banking activities in Japanese banks, including seal verification support, \npersonal identification, cheque recognition… \n Responsibility and Role: Software engineer in coding based on specification documents and writing test code. \n Technology  \n- \nA client-server based application was developed in Visual Basic together with TrueDBGrid Pro, Lead Tools, Active \nReport software component for displaying and manipulating data from SQL Sever database. \n- \nSome components was deployed on IIS server using ASP.NET and VB.NET technology. \nKT Project  (2004) \n Description: This project for Korean customers - A billing system Telecom as web-based application. \n Responsibility and Role: Software engineer in coding  based on specifications, code review and writing test code. \n Technology:  \n- \nFrontend with Gauce component JavaScript and JSP servlet together with J2EE, EJB as backend. \n- \nThis application is deployed on Weblogic server by using ant tools interacting with Oracle database. ", "educations": [{"id": 5411, "gpa": null, "major": "Kỹ thuật phần mềm", "school": "FPT - Aptech", "diploma": "Other", "end_time": "2003-12-01T00:00:00Z", "conf_score": 0.9050765977702602, "start_time": "2001-09-01T00:00:00Z", "picklist_major": "IT - Hardware/Networking", "major_categories": "Máy tính và công nghệ thông tin", "major_categories_detail": "Máy tính"}, {"id": 5410, "gpa": null, "major": "Computing", "school": "FPT - Greenwich University", "diploma": "Bachelors", "end_time": "2012-06-01T00:00:00Z", "conf_score": 0.9085716158340945, "start_time": "2011-07-01T00:00:00Z", "picklist_major": "Other", "major_categories": "", "major_categories_detail": ""}, {"id": 5409, "gpa": null, "major": "Kỹ thuật phần mềm", "school": "IEI Institute, National University -", "diploma": "Bachelors", "end_time": "2023-04-01T00:00:00Z", "conf_score": 0.7735649277904002, "start_time": "2017-10-01T00:00:00Z", "picklist_major": "IT - Hardware/Networking", "major_categories": "Máy tính và công nghệ thông tin", "major_categories_detail": "Máy tính"}], "experiences": [{"id": 18090, "detail": "Viettel Tower, 14th Floor, 285 CMT8 St, Ward 12 District 10, Ho Chi Minh city, Vietnam.", "company": "SAP Asia (Vietnam)", "end_time": "2019-05-31T00:00:00Z", "industry": "Other", "position": null, "conf_score": 0.7050867654707917, "start_time": "2009-06-01T00:00:00Z"}, {"id": 18091, "detail": ") Description: A core component of HANA Cockpit 2.0 on SAP HANA Application Extended Services Advanced (XSA). It provides solution of analysis, resolution about performance aspects of a database, this project is a web-tools based and consists of 4 components such as Performance Monitoring, Workload Analyzer, Capture and Replay, and SQL Analyzer, which is used to interact with HANA database in order to support performance experts, even developers to analyze, capture, pre-process, replay workloads and visualize SQL plan in the performance optimization as well as intelligent database tuning.\nResponsibility and Role - Development manager of HANA Performance Tools VN team in resource allocation, progress tracking, and mainly accountable for all agile development process and engineering activities, also connecting team members to delivery both HANA performance on-premise application and cloud services in time.\n- Also play Scrum master role to drive and facilitate scrum artifacts in team.\n- Topic leader is involved in the development of Capture and Replay component together with other components.\n- Join workshop in Korea to exchange about product vision together individual goals in team.\nTechnology - Javascript, HTML5, SAP UI5 Framework. - Java, NodeJS, XS Advanced as micro service architecture based on cloud foundry specification.\n- Eclipse-based Studio, atom, sublimetext editor.\n- Database: HANA In-memory. Achievement - Adopt the recent development process model of DevOps principles, Cloud Foundry Micro service, traceability improvement, and single code line in Trunk based development including feature toggle, master red, TDD unit test coverage and BDD acceptance test criteria together with automation pipeline in order to reach out to shorten cycle CD/CI HANA Cockpit 2.0 with different support packages such as SP06 (Apr 2018), SP07 (Jul 2018), SP08 (Oct 2019), SP09 (Jan 2019), and the latest SP10 (Apr 2019). - Setup the daily report notification of E2E selenium testing in HANA Performance team by using selenium dockerized system as IaC (Infrastructure as Code). - Provide daily performance measurement report by using SAP SUPA tool (Single User Performance Analysis) and\nJenkin integration for automation notification to team which including aspects Web UI loading, latency, and response time...\n- Utilize dockerized TestLink, a web-based test case system management, which is used to manage test suits, test plan, and test case scenario which depicted by BDD syntax as common business language to team and other stakeholders.\n- Cockpit for Operator Process has been formalized in cross-location team as DoD (Developer on Duty) including customer ticket handling, CVS (Centralized Validation System) upgrading.\n- Develop Cockpit Fiori Lauchpad as entry point landscape for all components in SP07 - July 2018.", "company": "SAP Asia (Vietnam)", "end_time": "2019-01-31T00:00:00Z", "industry": "Other", "position": "HANA Performance Management Tools", "conf_score": 0.8275107295019075, "start_time": "2016-01-01T00:00:00Z"}, {"id": 18092, "detail": "Description: This project includes 2 flavors, one WEB IDE on HANA Application Extended Services Classic (XSC) and\nHANA Runtime Tools (HRTT) on HANA Extended Application Services Advanced (XSA) as micro service. This is a web- based application tooling, which includes some core editors such as Editor, SQL Console, Data Preview involving advanced web-based functionalities like Server Javascript Debugger, SQL Debugger ... allow developers to be able to easily and quickly manage, develop SAP HANA application, compose SQL statements, and display artifact content in database.\nResponsibility and Role - Team leaders are mainly in charge of team activities, development and delivery process.\n- Senior developer and also take a Product owner role in order to communicate with stakeholders for clear requirements\n- Be trained and workshop with colleagues in Germany. Technology - Javascript, HTML5, SAP UI5 Framework. - NodeJS, XSJS (Extended Server Javascript), XS Advanced as micro service.\n- Eclipse-based Studio, atom, sublimetext editor.\n- Database: HANA In-memory. Achievement - Integrate four components as single product SAP Web IDE XSC including Editor, Catalog, Security and Trace. - Release Web IDE XSC (HANA_IDE_CORE DU) in HANA Auto Content package in many Delivery Units (DU) for\nSPS10, and SPS11 HANA 1 ... - Successfully migrate in parity, only Catalog component from SAP Web IDE HANA XSC to new product HANA Runtime Tools (HRTT) on XSA micro service with revision HANA 1 SPS11, SPS12.", "company": "SAP Asia (Vietnam)", "end_time": "2016-01-31T00:00:00Z", "industry": "Other", "position": "SAP Web IDE and HRTT", "conf_score": 0.6981244904084882, "start_time": "2013-01-01T00:00:00Z"}, {"id": 18093, "detail": "Description: Single Sign-On (SSO) is a system, which manages your accounts including username and passwords in order to automatically logon or single sign on into web based or desktop applications at client side. Besides, the system also provides a central management, which allows administrators to be able to synchronize SSO data between user client and server.\nResponsibility and Role: So", "company": "SAP Asia (Vietnam)", "end_time": "2013-01-31T00:00:00Z", "industry": "Other", "position": "Software engineer", "conf_score": 0.7206368052989944, "start_time": "2011-01-01T00:00:00Z"}, {"id": 18094, "detail": "Description: An innovative solution for the lifecycle management of cards/tokens including recovery for lost or broken cards. A distributed system works as n-tier architecture, which consists of components such as Key Server, CIS Server and RA-CIS Client, Local/Remote Assistant Client. Responsibility and Role: Soft", "company": "Trust Manager Enterprise", "end_time": "2011-01-31T00:00:00Z", "industry": "Other", "position": "Software engineer", "conf_score": 0.8287003437270981, "start_time": "2009-01-01T00:00:00Z"}, {"id": 18095, "detail": "Etown2 building, 10th Floor, 364 Cong Hoa St Tan Binh District, Ho Chi Minh city, Vietnam.", "company": "HarveyNash Vietnam", "end_time": "2008-05-31T00:00:00Z", "industry": "Other", "position": null, "conf_score": 0.7532646542832604, "start_time": "2006-07-01T00:00:00Z"}, {"id": 18096, "detail": "- I went to Singapore to work and be trained from customer for 8 months\nTechnology - Struts, Webwork, Hibernate and Spring, Velocity, Jasper Report, Quartz schedule and ajax dojo library.\n- Apache Tomcat Server, Weblogic and Websphere. - Eclipse 3.x IDE & Plugin, PLSQL Developer for Oracle DB, CVS, VSS Source Control, Maven2, Ant deploy tool, JUnit Testing, JDK 5.0. - Database: Oracle 9i & 10g.\n- Mantis bug tracker system.", "company": "HarveyNash VietNam", "end_time": "2008-01-31T00:00:00Z", "industry": "Other", "position": "Software engineer in development and maintenance", "conf_score": 0.8390738245948144, "start_time": "2006-01-01T00:00:00Z"}, {"id": 18097, "detail": "10 Co Giang St, District 1, Ho Chi Minh city, Vietnam.", "company": "SaiGon Software Development (SDC)", "end_time": "2006-06-30T00:00:00Z", "industry": "High Technology", "position": null, "conf_score": 0.7532646542832604, "start_time": "2004-07-01T00:00:00Z"}, {"id": 18098, "detail": "in coding based on specification documents and writing test code.\nTechnology - A client-server based application was developed in Visual Basic together with TrueDBGrid Pro, Lead Tools, Active Report software component for displaying and manipulating data from SQL Sever database.\n- Some components was deployed on IIS server using ASP.NET and VB.NET technology.\nKT Project (2", "company": "SaiGon Software Development (SDC)", "end_time": "2006-01-31T00:00:00Z", "industry": "High Technology", "position": "Software engineer", "conf_score": 0.8102286400108711, "start_time": "2004-01-01T00:00:00Z"}], "address": "361/3a Phan Van Tri St, Ward 11, Binh Thanh District, Hcm city, Vietnam"}