{"skills": ["stack", "strut", "application lifecycle", "java", "analytics", "javascript", "implementation", "cloud", "management", "redux", "jquery", "analysis", "palo alto", "typescript", "spring", "sap ui5", "maintenance", "website development", "sap cloud", "lifecycle", "css", "software development", "testing", "pyramid", "oracle", "clarify", "database", "process development", "jenkins", "jsp", "hibernate", "component testing", "qunit", "full stack development", "problem solving", "sap hana", "agile", "mysql", "html"], "fulltext": "Pham Tran Ha Dong\nHo Chi Minh City, Vietnam \nSUMMARY \nMore than 10 years' experience in software development as a full stack developer, I have been \nsuccessfully contributing to many projects for both outsourcing and products with different roles \nsuch as developer as well as the team leader. \nI experienced in working with Agile Scrum development process, experienced in working with \ninternational teams, have a good knowledge of web development, responsible for the features from \nrequirement definition, prototyping, implementation to testing and maintenance, support the \ninternal customer in finding, analyzing, resolving issues, and delivery of the committed tasks in time. \nEXPERIENCE \n  SAP LABS VIETNAM | GERMANY \nJan 2012 – May 2019 \nSenior Software engineer | SAP Analytics Cloud \nAct as a team leader, take the responsibility to drive the team develop new feature for SAP Analytics \nCloud. \nKey responsibilities \n• \nWork directly with the Lead Architect in Germany to clarify the concept and the high-level \narchitect. \n• \nCollaborate with Product Owner to clarify the requirements, and breakdown tasks for the team \nready to implement. \n• \nIntegrate the front-end and back-end which is written as a java micro service and deployed it \nto SAP Cloud Platform to have a full cycle of the feature. \n• \nMentor the junior colleagues in the team. \nKey achievements \n• \nSuccessfully release the 1st version on time and receive very good feedback from the \nstakeholders in Germany. \nUtilized Skill Sets \n• \nReact, Redux, Typescript, JavaScript, Webpack, Java, Micro services, SAP Cloud Platform and \nHana database. \nSenior Software engineer | SAP IT Operation Analysis (ITOA) \nAct as a team leader, take the responsibility to build an analytics tools for analyzing the health and \nperformance of IT landscape. \nKey responsibilities \n• \nWork closely with the Lead Architect in Germany, discuss and clarify the architect and technical \nfeasibility. \n• \nCollaborate with Product Owner to clarify the requirements, and breakdown tasks ready for \nthe team to implement. \n• \nCollaborate with the UX designer to offer a best user experience for the product and to ensure \nleast complex implementation. \n• \nDevelop major features from front-end to back-end with high quality.  \n• \nSet up the UI testing component based on SAP OPA5 framework. \n• \nSet up the development environment when moving to the new architect. \n• \nSupport internal customers to analyze and resolve issues. \n• \nMentor the junior colleagues to catch up quickly. \nKey achievements \n• \nSuccessfully develop a prototype to migrate the project from the old architect to the new one \nin 2 weeks hackathon in Germany. \n• \nDeliver successfully product with high quality to the SAP market. \n• \nJoin DKOM event in Palo Alto (USA) in 2017 to show up the product and shared technologies \nusing. \n• \nBeing selected as a SAP Catalyst in 2018 to become a Development Expert. \nUtilized Skill Sets \n• \nJavaScript, SAP UI5 framework, SAP HANA XSA framework, HANA database, QUnit test, OPA5 \nframework, QUnit test, Google Blockly. \nSenior Software engineer | SAP WebIDE \nAct as a team leader, take responsibility to develop a powerful, extensible, web-based tool that \nsimplifies the development application lifecycle. \nKey responsibilities \n• \nWork closely with colleagues in Germany to build the product. \nKey achievements \n• \nSuccessfully develop the project to show up the ability, productivity at work \n• \nWell collaborate with Germany and India colleagues. \nUtilized Skill Sets \n• \nJavaScript, HTML, jQuery, CSS, SAP HANA XS Classic framework, HANA database. \n  PYRAMID CONSULTING - PYCO GROUP | BELGIUM \nJan 2007 – Dec 2011 \nSenior Software engineer | Out sourcing projects \nTake responsibility to develop new and maintain many outsourcing projects for dedicated customer \nBelga News Agency in Belgium. \nKey responsibilities \n• \nDirectly get requirement from the customer, analyze, develop and maintain features. \nKey achievements \n• \nRelease the feature on time and quickly support customers to analyze and fix issues. \n• \nWell collaborate with colleagues in Belgium and get very good feedback from the customers \nand stakeholders. \n• \nBe promoted to a senior developer after one year joined the company. \nUtilized Skill Sets \n• \nJavaScript, HTML, jQuery, CSS, JSP, Java, Struts, Spring framework, Hibernate, MySQL, Oracle \nDB \nCABABILITY \nSAP TECHNOLOGY \n• \nSAP HANA Database, SAP UI5, SAP HANA XSA programing model, SAP HANA XSC, SAP cloud \nplatform. \n• \nOPA5 testing framework, QUnit test, Jenkins. \n• \nTechnical Architecture Modelling (TAM). \nSOFTWARE DEVELOPMENT \n• \nJava, JavaScript, Struts framework, Spring framework, Hibernate, JSP, HTML, CSS. \n• \nMySQL, Oracle DB. \n• \nMicro services. \n• \nGoogle Blockly. \nSOFT SKILLS \n• \nHighly responsible. \n• \nGood at analyzing and solving problems.  \n• \nWell communicate and collaborate with colleagues.  \n• \nGood team driven and mentor new members. \n• \nAble to work independently and self-management. \n• \nOpen and quickly adapt to new changing. \nEDUCATION \nUniversity of Science – B.A. Information of technology \n2005 \nREFERENCES \nReferences are available upon request. ", "educations": [{"id": 5415, "gpa": null, "major": "Công nghệ thông tin", "school": "University of Science", "diploma": "Bachelors", "end_time": "2005-01-01T00:00:00Z", "conf_score": 0.8232237237760615, "start_time": null, "picklist_major": "IT - Hardware/Networking", "major_categories": "Máy tính và công nghệ thông tin", "major_categories_detail": "Công nghệ thông tin"}], "experiences": [{"id": 18110, "detail": "SAP Analytics Cloud Act as a team leader, take the responsibility to drive the team develop new feature for SAP Analytics Cloud. Key responsibilities\n• Work directly with the Lead Architect in Germany to clarify the concept and the high-level architect.\n• Collaborate with Product Owner to clarify the requirements, and breakdown tasks for the team ready to implement.\n• Integrate the front-end and back-end which is written as a java micro service and deployed it to SAP Cloud Platform to have a full cycle of the feature.\n• Mentor the junior colleagues in the team.\nKey achievements\n• Successfully release the 1st version on time and receive very good feedback from the stakeholders in Germany. Utilized Skill Sets • React, Redux, Typescript, JavaScript, Webpack, Java, Micro services, SAP Cloud Platform and\nHana database.", "company": "SAP LABS VIETNAM", "end_time": "2019-05-31T00:00:00Z", "industry": "Other", "position": "Senior Software engineer |", "conf_score": 0.9208819909491309, "start_time": "2012-01-01T00:00:00Z"}, {"id": 18111, "detail": "PYRAMID CONSULTING - PYCO GROUP | BELGIUM Jan 2007 - Dec 2011 Senior Software engineer | Out sourcing projects\nTake responsibility to develop new and maintain many outsourcing projects for dedicated customer\nBelga News Agency in Belgium. Key responsibilities\n• Directly get requirement from the customer, analyze, develop and maintain features.\nKey achievements\n• Release the feature on time and quickly support customers to analyze and fix issues.\n• Well collaborate with colleagues in Belgium and get very good feedback from the customers and stakeholders.\n• Be promoted to a senior developer after one year joined the company.\nUtilized Skill Sets • JavaScript, HTML, jQuery, CSS, JSP, Java, Struts, Spring framework, Hibernate, MySQL, Oracle DB", "company": "SAP", "end_time": "2011-12-31T00:00:00Z", "industry": "Other", "position": "Senior Software engineer", "conf_score": 0.8635043182493525, "start_time": "2007-01-01T00:00:00Z"}], "address": "Ho Chi Minh City, Vietnam"}