{"skills": ["raw", "san", "marketing", "analytics", "iso 14001", "ims", "ams", "implementation", "sales", "e learning", "contact point", "management", "performance metric", "haccp", "iso 20000", "administration", "market research", "finance", "selling skill", "structure", "leadership skill", "business strategy", "iso", "database", "problem solving skill", "change management", "sales and marketing", "problem solving", "public speaking"], "fulltext": " NGUYEN THI MINH UYEN \n68 Chuong Duong, Thu Duc Dist., HCMC                                                                    \nCell: +84 909 07 8286 \nEmail:  uyenmnguyen1980@gmail.com  \nOBJECTIVES & PERSONAL PROFILES \nDeveloping business strategy to optimize sales, achieve highest profit and identify and proactive \nexpand new business opportunities in long term. \n 10 years at Key Account Management  \n Communication & presentation skills  \n 10 years at Healthcare industry  \n Sense of Business Development \n 4 years at Data Science \n Team work, self-confident, pro-active \nEDUCATION \n1998 – 2002 \nUniversity of Natural Sciences – B.S at Chemical \nChemistry department – Major at Analytical Chemistry \n2005 - 2007 \nSan Diego State University – California – US \nCertificate of Completion in Pre – MBA advanced program  \nBellevue Community College – Washington – US (Overall GPA 3.92/4.0) \nAssociate of Art in Business Administration \nCertificate of Accomplishment in Sales and Marketing  \nTRAINING COURSES ATTENDED \n Competition law training session, conducted by DSM APAC lawyers in Singapore (March 19, \n2009). \n Sales excellence training program – Advanced Negotiation: conducted by Gustav Kaser \nInternational in Philippines (May 11-13, 2009). \n Account Manager training course in Singapore: Customer Intimacy – Distributor Strategy (Jan 13-\n15, 2010). \n Account Manager training course in Singapore: Leadership (Jan 16-17, 2012). \n Account Manager training course in Singapore: Advanced Selling Skills (Mar 3-7, 2013). \n Managing@ IMS Health course (Aug 4-6 , 2015)  \n E-learning courses at IMS: Code of Conduct, Anti Bribery, Sales training program, etc. \nPROFESSIONAL EXPERIENCE \n4/2018 – 04/19 \n3/2014 – 4/2018 \nTitle: STRATEGIC PARTNERSHIP ASSOCIATE DIRECTOR \nHORUS LTD. CO.  (a start-up company) \n Business nature: Integrated services to academia, biopharma, medical device, \nand healthcare industry \nRESPONSIBILITIES: \n \nResponsible for achieving sales targets and related performance metrics. \n \nDevelop sales and marketing plan to identify new business opportunities with \nexisting clients to expand the project base and strengthen the business \nrelationships. \n \nTarget key pharmaceutical companies, CROs, institutions, & universities to \nestablish and develop long term partnership with KOLs. \n \nConduct direct selling activities, including prospecting, following-up calls, \nmeetings and sponsor presentations. \n \nIdentify opportunities for Horus to provide innovative solutions to sponsor ‘s \nneed. \n \nMaintain and update customer contact database, and generate sales pipeline, \nforecasts and activity reports. \nTitle: ACCOUNT MANAGER \nIQVIA (formerly known as IMS Health) \n Business nature: Expert in Human Data Science \nRESPONSIBILITIES: \n Expand and generate new business, understand clients needs, expectation and \ncaptured business opportunities. \n Develop new business to potential clients, IMS presented and designed \nsuitable offerings.  \n Managing & collaborating with key accounts, act as the contact point \nbetween company and clients.  \n11/2007 – 7/2013 \n Responsible for achievement of sales target and consistently reviews sales \nand client coverage to deliver maximum efficiency/impact. \n Consultant on IMS services: Information Analytics and Commercial \nEffectiveness Services: Vietnam national market audit, Commercial model, \nPrimary market research, Sales forces effectiveness, Segmentation & \nTargeting, Learning solution & change management. \n Meeting with Clients to understand Clients strategy focus and consulting \nbased on critical market data and effectiveness services. \n Solving & feedback to Clients and Operation teams any issues happened. \nBuild strategic partnership with clients in long-term. \n Coordinate with Operation/ Client service / Commercial Effectiveness \nDepartments and Regional/Global Team to deploy the project, commitment \nwith clients. \n Sales forecast and accounts planning, P&L management and initiatives new \nbusiness opportunities in Vietnam \n Business development, coordination with Medical team, R&D team of Local \nclients to explore the opportunities of Clinical Trial under expert of Quintiles \n– the first official CRO of MNC in Vietnam. \n Key clients managing such as: Sanofi, Pfizer, Novartis, MSD, GSK, Merck, \nBayer, Janssen, Abbott, Mega, Zuellig, Duoc Hau Giang, Traphaco,…     \nTitle: PHARMA INDUSTRY MANAGER \nDSM NUTRITIONAL PRODUCTS VN (formerly known as ROCHE Vitamins & \nFine Chemical, 100% invested by Dutch) \n Business nature: Manufacturing & Trading of Vitamins and Fine Chemical \nIngredients. \nRESPONSIBILITES: \nImplementation of the sales strategies:  \n Plan and implement the sales and margins according to agreed target, mainly \nwork at Food and Pharma divisions contributed to sales performance of \nVietnam. Some short period working in Personal care division \n Propose local price structure within country and regional guidelines.  \nSales development \nMake regular sales calls/ visits to develop professional relationships and follow \nup on needs aiming to close deals and finalize contracts \n Select, manage and develop some potential accounts  \n Initiate new projects on customer needs by technical advice, marketing \nproposals, concepts creation, product modifications, market trends update, \netc. \n Report regularly about commercial aspects: total market development, \nmarket shares, price development, competition, consumer trends, regulatory \naffairs, etc.  \nCustomers/ Distributors management: \n Establish action plans to keep long term and strong relationship with strategic \n8/2005 – 8/2007 \n10/2002 – 5/2005 \naccounts and distributors \n Complain management, follow up from receiving orders to arriving \nshipments to support customers and solve all related problems \n Conduct market research via visits, calls, interviews to understand customer’s \nexpectation and needs \n Regular interactions with KAMs, AMs, and other departments in region: \ncommercial, finance, logistics, quality, RA, RD to serve customers quickly \n Organize workshops, customer events, and overseas customer. \nSTUDY IN USA \n Worked part – time in a French dry-cleaning store and a spa store. \n Attended meetings of business, customer services, sales, and marketing \npresented by professors and visitors in BCC. \n Completed many team research and projects about companies: Coca Cola, \nLancôme, Adidas, P&G using learnt method of business, marketing, \nstatistics, and selling. \n Member of National Dean’s List, Phi Theta Kappa Honor Society \n BCC scholarships for international students \nTitle: QA TECHNICIAN \nUNILEVER VIETNAM (100% invested by Anglo-Dutch) \n Business nature: Manufacturing many branded home and personal care \ncategories. \nRESPONSIBILITES: \n Finally controlled and assured the quality of finished products (personal care \ncategory).  \n Audited and assured the quality of internal imported products within regional \nUnilever. \n Worked directly with Unilever staff in region about quality of products. \n Analyzed and assured quality of raw materials before used into production. \n Periodically audited and appraised company and competitors’ products tested \nquality and reported the audit to QA manager and board of management. \n Co-ordinated with R&D department in research and appraise material for \nnew projects. \n Some training courses attended: \n Training courses of ISO 9001:2000, ISO 14001, OHSAS 18001, and \nHACCP. \n Training courses of working skills in lab. \n Team working skill, problem solving skill, etc \nSKILLS \nLanguage: Fluent in English; Intermediate in German (B degree). \nComputer: MS Office; Familiar with SAP system APO forecast. \nSales and marketing skills - Leaderships and management. \nPublic speaking and presentation skills. \nMarket Access and Business Planning Strategy. \nHOBBIES \nReligious activities; Travel; Music; Gym. \nACHIEVEMENTS \nMember of National Dean’s List, Phi Theta Kappa Honor Society, BCC college \nAnnual target sales increment at avg. 15 – 18 % \nGrowth rate for key account at 45% \nPro-active and develop new accounts ", "educations": [{"id": 5428, "gpa": "3.92", "major": "Quản lý đô thị và công trình", "school": "Bellevue Community College", "diploma": "Other", "end_time": "2007-01-01T00:00:00Z", "conf_score": 0.8300130821612617, "start_time": "2005-01-01T00:00:00Z", "picklist_major": "Architecture / Interior Design", "major_categories": "Kiến trúc và xây dựng", "major_categories_detail": "Kiến trúc và quy hoạch"}, {"id": 5427, "gpa": null, "major": "Chemical", "school": "University of Natural Sciences", "diploma": "Bachelors", "end_time": "2002-01-01T00:00:00Z", "conf_score": 0.8402116203800136, "start_time": "1998-01-01T00:00:00Z", "picklist_major": "Other", "major_categories": "", "major_categories_detail": ""}], "experiences": [{"id": 18144, "detail": "(a start-up company)\nBusiness nature: Integrated services to academia, biopharma, medical device, and healthcare industry\nRESPONSIBILITIES: Responsible for achieving sales targets and related performance metrics.\nDevelop sales and marketing plan to identify new business opportunities with existing clients to expand the project base and strengthen the business relationships.\nTarget key pharmaceutical companies, CROs, institutions, & universities to establish and develop long term partnership with KOLs. Conduct direct selling activities, including prospecting, following-up calls, meetings and sponsor presentations.\nIdentify opportunities for Horus to provide innovative solutions to sponsor ‘s need.\nMaintain and update customer contact database, and generate sales pipeline, forecasts and activity reports.", "company": "HORUS LTD. CO.", "end_time": "2019-04-30T00:00:00Z", "industry": "Other", "position": "STRATEGIC PARTNERSHIP ASSOCIATE DIRECTOR", "conf_score": 0.9380974856686034, "start_time": "2018-04-01T00:00:00Z"}, {"id": 18145, "detail": ") Business nature: Expert in Human Data Science RESPONSIBILITIES: Expand and generate new business, understand clients needs, expectation and captured business opportunities.\nDevelop new business to potential clients, IMS presented and designed suitable offerings.\nManaging & collaborating with key accounts, act as the contact point between company and clients.\nResponsible for achievement of sales target and consistently reviews sales and client coverage to deliver maximum efficiency/impact.\nConsultant on IMS services: Information Analytics and Commercial Effectiveness Services: Vietnam national market audit, Commercial model,\nPrimary market research, Sales forces effectiveness, Segmentation & Targeting, Learning solution & change management.\nMeeting with Clients to understand Clients strategy focus and consulting based on critical market data and effectiveness services.\nSolving & feedback to Clients and Operation teams any issues happened.\nBuild strategic partnership with clients in long-term.\nCoordinate with Operation/ Client service / Commercial Effectiveness Departments and Regional/Global Team to deploy the project, commitment with clients.\nSales forecast and accounts planning, P&L management and initiatives new business opportunities in Vietnam Business development, coordination with Medical team, R&D team of Local clients to explore the opportunities of Clinical Trial under expert of Quintiles - the first official CRO of MNC in Vietnam. Key clients managing such as: Sanofi, Pfizer, Novartis, MSD, GSK, Merck, Bayer, Janssen, Abbott, Mega, Zuellig, Duoc Hau Giang, Traphaco,...", "company": "IQVIA", "end_time": "2018-04-30T00:00:00Z", "industry": "Other", "position": "ACCOUNT MANAGER", "conf_score": 0.9120015881049469, "start_time": "2014-03-01T00:00:00Z"}, {"id": 18146, "detail": "(formerly known as ROCHE Vitamins & Fine Chemical, 100% invested by Dutch) Business nature: Manufacturing & Trading of Vitamins and Fine Chemical Ingredients. RESPONSIBILITES: Implementation of the sales strategies:\nPlan and implement the sales and margins according to agreed target, mainly work at Food and Pharma divisions contributed to sales performance of\nVietnam. Some short period working in Personal care division\nPropose local price structure within country and regional guidelines.\nSales development\nMake regular sales calls/ visits to develop professional relationships and follow up on needs aiming to close deals and finalize contracts\nSelect, manage and develop some potential accounts\nInitiate new projects on customer needs by technical advice, marketing proposals, concepts creation, product modifications, market trends update, etc.\nReport regularly about commercial aspects: total market development, market shares, price development, competition, consumer trends, regulatory affairs, etc.\nCustomers/ Distributors management:\nEstablish action plans to keep long term and strong relationship with strategic accounts and distributors\nComplain management, follow up from receiving orders to arriving shipments to support customers and solve all related problems\nConduct market research via visits, calls, interviews to understand customer’s expectation and needs\nRegular interactions with KAMs, AMs, and other departments in region: commercial, finance, logistics, quality, RA, RD to serve customers quickly\nOrganize workshops, customer events, and overseas customer.", "company": "DSM NUTRITIONAL PRODUCTS VN", "end_time": "2013-07-31T00:00:00Z", "industry": "Other", "position": "PHARMA INDUSTRY MANAGER", "conf_score": 0.9462813080854472, "start_time": "2007-11-01T00:00:00Z"}, {"id": 18147, "detail": "tore.\nAttended meetings of business, customer services, sales, and marketing presented by professors and visitors in BCC. Completed many team research and projects about companies: Coca Cola, Lancôme, Adidas, P&G using learnt method of business, marketing, statistics, and selling.\nMember of National Dean’s List, Phi Theta Kappa Honor Society BCC scholarships for international students", "company": "French dry - cleaning store and a spa", "end_time": "2007-08-31T00:00:00Z", "industry": "Other", "position": null, "conf_score": 0.8086621310791741, "start_time": "2005-08-01T00:00:00Z"}, {"id": 18148, "detail": "(100% invested by Anglo-Dutch) Business nature: Manufacturing many branded home and personal care categories.\nRESPONSIBILITES: Finally controlled and assured the quality of finished products (personal care category).\nAudited and assured the quality of internal imported products within regional\nUnilever. Worked directly with Unilever staff in region about quality of products.\nAnalyzed and assured quality of raw materials before used into production.\nPeriodically audited and appraised company and competitors’ products tested quality and reported the audit to QA manager and board of management.\nCo-ordinated with R&D department in research and appraise material for new projects.\nSome training courses attended:\nTraining courses of ISO 9001:2000, ISO 14001, OHSAS 18001, and\nHACCP. Training courses of working skills in lab.\nTeam working skill, problem solving skill, etc", "company": "UNILEVER VIETNAM", "end_time": "2005-05-31T00:00:00Z", "industry": "Other", "position": "QA TECHNICIAN", "conf_score": 0.9462813080854472, "start_time": "2002-10-01T00:00:00Z"}], "address": "68 Chuong Duong, Thu Duc Dist., Hcmc"}