{"skills": ["search", "woocommerce", "git", "agile", "full stack development", "mai", "wordpress", "es6", "marketing", "sales", "stack", "javascript", "payment", "website development", "laravel", "mvc", "ams", "workflow", "frontend development", "futures", "php", "software development", "teamwork", "product feature", "cell phone", "user location", "management"], "fulltext": "CURRICULUM VITAE OF PHAM BA TRUNG THANH \nI am a full stack developer with 4 years of experience in\nPHP language and Front-End Web Development. \nI have good knowledge in Laravel Framework, MVC\nDesign, Repository Pattern, Agile and Scrum, Git, TestCase,\nAPI, Javascript ES6. \nI like learning new technologies and finding clever ways to\nsolve problems. I am a good team player, I can also do some\nmentoring tasks and do code reviews for other team members. \nPERSONAL INFORMATION \n●\nName: Pham Ba Trung Thanh. \n●\nAddress: No. 411 C6B – Quynh Mai – Hai Ba Trung – Ha Noi. \n●\nCell phone: 0852773450 \n●\nEmail: phambatrungthanh@gmail.com \n●\nDate of Birth: 09/01/1992 \n●\nPlace of Birth: Ho Chi Minh City \n●\nCitizenship: Vietnam \n●\nMarital Status: Single \n●\nSex: Male \nCAREER TARGET \nI would like to find a stable job with good income and good working environment. I expect to contribute\nto the development of the company as well as promoted to higher position in the near future. \nEDUCATION \n●\nUniversity: Ha Noi University of Business and Technology (2015-2019). \nSKILL \n●\nPrograming skills:  \no\n5+ years of experience in PHP. \no\n4+ years of experience in Front-end Development. \no\nGood knowledge in Laravel Framework, MVC Design, Repository Pattern, Agile and \nScrum, Git, TestCase, API, Javascript ES6. \nEnglish skills: Advance level of General English and Conversation. \nTeamwork skills from social activities taken part in the past.  \nMentor skills: 1 year mentoring a junior in a team. \n●\n●\n●\nPERSONALITY AND INTEREST \n●\nEnthusiastic, open minded, caring and resourceful, optimistic, having a good sense of humor and\nget on easily with people of all ages and backgrounds. \n●\nAlways punctual and responsible when doing anything; really serious in work. \n●\nInterested in reading books. \nWORKING EXPERIENCE \nMEC International — Senior Software Developers \nAug  2017 - Now \nLeader of an inhouse development team, making a management software closely follow the company’s \nworkflow. \n●\nDesign architecture of the project. \n●\nDesign key components of the project. \n●\nCollaborate with Project Owner to define objectives, product features, make scrum sprints, assign \ntasks and review pull request. \n●\nEvaluated team member with OKRs and KPI. \nAbout the project: \nMEC's Business Management Software is an internal software specially created to match the company's \nworkflow, speed-up the processes, manage resources,increase employee's performance and give managers a \nbroader and clearer  image of every aspect in the company. It includes HRM Module, Project Module, \nPartner-Contact Module, Resources Module, Order-Invoice-Payment Module, Marketing Module, Operation \nModule.. \nSelf-Employed — Freelancer \nAug  2015 - Jun 2017 \nWorking as a freelancer, mostly about making e-commerce website, writing custom wordpress plugins, \ndesigning brochures, posters, etc… \nFeatured Project: \n●\n[Wordpress plugin] Nhanh.vn Bridge: A bridge between woocommerce and nhanh.vn API, sync \nupdate on stocks, prices, sales to woocommerce’s products, calculate shipping fee, order tracking. \n●\n[Project] Ăn Gì Đây?: A web app that provides food suggestions based on user location and time of \nday, search for food  and live direction with map. \n●\n[E-commerce]: pukido.com, jessiesbeautystore.com, chobuonsi.vn \nI do solemnly confirm that the above mentioned information is truly and look forward to your contact\nsoon. \nBest regards \nPham Ba Trung Thanh ", "educations": [{"id": 5465, "gpa": null, "major": null, "school": "Ha Noi University of Business and Technology", "diploma": "Bachelors", "end_time": "2019-01-01T00:00:00Z", "conf_score": 0.7151136457677363, "start_time": "2015-01-01T00:00:00Z", "picklist_major": "Other", "major_categories": "", "major_categories_detail": ""}], "experiences": [{"id": 18277, "detail": "Leader of an inhouse development team, making a management software closely follow the company’s workflow.\n● Design architecture of the project.\n● Design key components of the project.\n● Collaborate with Project Owner to define objectives, product features, make scrum sprints, assign tasks and review pull request.\n● Evaluated team member with OKRs and KPI. About the project:\nMEC's Business Management Software is an internal software specially created to match the company's workflow, speed-up the processes, manage resources,increase employee's performance and give managers a broader and clearer image of every aspect in the company. It includes HRM Module, Project Module, Partner-Contact Module, Resources Module, Order-Invoice-Payment Module, Marketing Module, Operation Module..", "company": "MEC International", "end_time": "2023-04-13T00:00:00Z", "industry": "Other", "position": "Senior Software Developers", "conf_score": 0.9142206543796373, "start_time": "2017-08-01T00:00:00Z"}, {"id": 18278, "detail": "orking as a freelancer, mostly about making e-commerce website, writing custom wordpress plugins, designing brochures, posters, etc...\nFeatured Project: ● [Wordpress plugin] Nhanh.vn Bridge: A bridge between woocommerce and nhanh.vn API, sync update on stocks, prices, sales to woocommerce’s products, calculate shipping fee, order tracking.\n● [Project] Ăn Gì Đây?: A web app that provides food suggestions based on user location and time of day, search for food and live direction with map.\n● [E-commerce]: pukido.com, jessiesbeautystore.com, chobuonsi.vn", "company": "MEC International", "end_time": "2017-06-30T00:00:00Z", "industry": "Other", "position": "Freelancer", "conf_score": 0.6925429707670153, "start_time": "2015-08-01T00:00:00Z"}], "address": "No. 411 C6b - Quynh Mai - Hai Ba Trung - Ha Noi."}