{"skills": ["digital marketing", "regression", "marketing", "analytics", "chef", "h2o", "predictive analysis", "ams", "implementation", "c#", "sales", "machine learning", "management", "svm", "finance", "association rule", "analysis", "anomaly detection", "adobe analytics", "hp", "search", "lean", "commodities", "rss", "algorithm", "sql", "lean six sigma", "classification technique", "powerbi", "clustering", "class", "python", "analyst", "tableau", "six sigma"], "fulltext": "Gagan Anand \nCONTACT \nSUMMARY \nI am a seasoned Data Science professional, providing on-site consulting to some of the best names in the \nindustry. I have primarily worked on predictive analytics and classification techniques like linear and logistic \nregression, clustering, association rules, sequence pattern mining, NLP and creating KPIs for various \nbusiness problems in the Finance, Telecommunications and Digital Marketing space. \nWORK EXPERIENCE \nDec’17- present \nData Scientist \nCredit Suisse, Pune \nAs a data scientist in the CFO’s Innovation team, our objective is to increase efficiency in the finance domain \nusing process standardization, machine learning and predictive analysis. \nGenerated an anomaly detection algorithm to identify unusual trades for the trade audit team using one-\nclass SVM and Isolation forests.  \nCreated a suite of tools that analyzes the daily FOBO breaks, measures book complexity, detects \nanomalies and helps line controllers signoff on daily trades for Product Control. Saving €200,000 yearly. \nAug’15 - Nov’17 \nData Science Consultant  \nCognizant Technology Solutions, Bangalore \nAs an associate in the Data Science practice I delivered the following projects: \n\nCall Volume Prediction: Using machine learning algorithms to predict call volumes and suggest ways \nto optimize the process through geo-clustering, pattern mining and classification modeling for the \nlargest telecommunications company in the US. \n\nOnline Search Ads Analytics: Member of the long-term strategy team that identified market \nopportunities and defined methodologies for monetizing them using predictive and prescriptive \nanalytics techniques for the world’s second largest search ad engine. Projects undertaken: \no\nCreated a location based filtering algorithm to improve ad targeting and user’s propensity to click. \no\nIncreased accuracy of revenue prediction models by using geo-location analytics & user \nsegmentation. \no\nIdentified spending patterns for large advertisers across advertiser categories. \n\nAutomobile Sales Algorithm: Created an algorithm for targeted sales effort that could predict a \nprospective customer's propensity to purchase a vehicle and classify leads accordingly. \nJun’14 - Aug’14 \nDigital Analytics Intern  \nHewlett Packard, Bangalore \n\nConducted a post-click consumer analysis for HP’s monthly newsletter and provided recommendations \nto increase engagement with consumers. \n\nWorked on enhancing the machine learning algorithm for the image recognition and text identification \nsoftware on HP Autonomy’s IDOL platform for unstructured data. \nResearch Associate  \n              Jul’12 - Jun’13 \nAccent Consulting, Noida \nCreated time series models to predict commodity prices and designed dashboards to evaluate KPIs. \nLiaison Officer  \n          Oct’09 - Oct’10 \nCommonwealth Games 2010, Delhi \nLiaised with Sports Ministers, Chef de Missions and other dignitaries from Commonwealth countries during \nthe preparation of the Commonwealth Games in Delhi. \nCERTIFICATIONS \n\nManagement, Entrepreneurship and Global Leadership at London School of Economics and \nPolitical Sciences, London (United Kingdom).  \nAugust ‘11 \n\nApplied Machine Learning Specialist from Wiley & Sons    \nOctober’15 \n\nBig Data Specialist from Wiley & Sons  \nOctober’15 \nKEY ACHIEVEMENTS \nReceived the Delivery \nExcellence Award for Q2 \n2018 at Credit Suisse for \nimplementation of the PC- \nStraight Through Processing \nSuite. Saving €200,000 yearly. \nPresented with the Pinnacle \nAward in April 2016 for \nsuccessfully delivering multiple \nprojects. \nLiaison Officer to Sports \nMinisters and Chef de \nMissions at Commonwealth \nGames, Delhi \nTOOLS \nProficient in R, Tableau, H2O,  \nAdobe Analytics, SQL , Scope & \nMS-Office. \nWorking knowledge of Python, \nSAS, C# and PowerBI. \nINTERESTS \n\nVolunteer Analyst at United Way \nof \nDelhi, \nan \nNGO \nwhich \nsynergizes  the  efforts  of \ncorporate  bodies  and  other \nNGOs. \nCertified advance open water \nscuba diver and trek leader. \n\nLean Six Sigma Green Belt from KPMG   \nAugust’15 \nEDUCATION \n2015 \nMBA (Business Economics, Marketing) \nDepartment of Business Economics, University of Delhi \n2012 \nBA (Hons) Business Economics  \nSri Guru Tegh Bahadur Khalsa College, University of Delhi \n2009 \nXII (AISSCE) \nApeejay School Noida (CBSE) \n2007 \nX (AISCE) \nApeejay School Noida (CBSE) ", "educations": [{"id": 5501, "gpa": null, "major": null, "school": "Sri Guru Tegh Bahadur Khalsa College", "diploma": "Colleges", "end_time": "2009-01-01T00:00:00Z", "conf_score": 0.7050867654707917, "start_time": "2007-01-01T00:00:00Z", "picklist_major": "Other", "major_categories": "", "major_categories_detail": ""}, {"id": 5500, "gpa": null, "major": "Kinh tế", "school": "University of Delhi", "diploma": "Bachelors", "end_time": "2012-01-01T00:00:00Z", "conf_score": 0.765408085552725, "start_time": null, "picklist_major": "Economical", "major_categories": "Khoa học xã hội và hành vi", "major_categories_detail": "Kinh tế học"}], "experiences": [{"id": 18382, "detail": "Pune As a data scientist in the CFO’s Innovation team, our objective is to increase efficiency in the finance domain using process standardization, machine learning and predictive analysis.\nGenerated an anomaly detection algorithm to identify unusual trades for the trade audit team using one- class SVM and Isolation forests.\nCreated a suite of tools that analyzes the daily FOBO breaks, measures book complexity, detects anomalies and helps line controllers signoff on daily trades for Product Control. Saving €200,000 yearly.", "company": "Credit Suisse", "end_time": "2023-04-13T00:00:00Z", "industry": "Non-banking", "position": "Data Scientist", "conf_score": 0.9125776658202421, "start_time": "2017-12-13T00:00:00Z"}, {"id": 18383, "detail": "As an associate in the Data Science practice I delivered the following projects:\nCall Volume Prediction: Using machine learning algorithms to predict call volumes and suggest ways to optimize the process through geo-clustering, pattern mining and classification modeling for the largest telecommunications company in the US. Online Search Ads Analytics: Member of the long-term strategy team that identified market opportunities and defined methodologies for monetizing them using predictive and prescriptive analytics techniques for the world’s second largest search ad engine. Projects undertaken: o\nCreated a location based filtering algorithm to improve ad targeting and user’s propensity to click. o\nIncreased accuracy of revenue prediction models by using geo-location analytics & user segmentation. o\nIdentified spending patterns for large advertisers across advertiser categories.\nAutomobile Sales Algorithm: Created an algorithm for targeted sales effort that could predict a prospective customer's propensity to purchase a vehicle and classify leads accordingly.", "company": "Cognizant Technology Solutions, Bangalore", "end_time": "2017-11-30T00:00:00Z", "industry": "High Technology", "position": "Data Science Consultant", "conf_score": 0.7707675877424722, "start_time": "2015-08-13T00:00:00Z"}, {"id": 18384, "detail": ", Bangalore Conducted a post-click consumer analysis for HP’s monthly newsletter and provided recommendations to increase engagement with consumers.\nWorked on enhancing the machine learning algorithm for the image recognition and text identification software on HP Autonomy’s IDOL platform for unstructured data.", "company": "Hewlett Packard", "end_time": "2014-08-31T00:00:00Z", "industry": "Other", "position": "Digital Analytics Intern", "conf_score": 0.9125776658202421, "start_time": "2014-06-13T00:00:00Z"}, {"id": 18385, "detail": ", Noida Created time series models to predict commodity prices and designed dashboards to evaluate KPIs.", "company": "Accent Consulting", "end_time": "2013-06-30T00:00:00Z", "industry": "Other", "position": "Research Associate", "conf_score": 0.9174648511369632, "start_time": "2012-07-13T00:00:00Z"}], "address": null}