{"skills": ["verbal communication skill", "studio", "team management", "testing", "analysis", "motivate others", "jira", "process development", "linux", "project management", "testlink", "kaizen", "verbal communication", "negotiation skill", "make decision", "database", "project control", "cb", "recruitment", "software development", "teamwork", "operating system", "linux operating system", "tester", "management", "scrum master", "communication skill", "problem solving"], "fulltext": "RESUME \nThan Trong Duy \nBirthday: 04 May 1985 \nPROFILE: \nA perfectionist in work, I always want my work to get the best result. I also find \nthe effort ways to self-improve own skill as well as work quality.  \nAlways work with strong motivation and passion at work. \nGreat sense of responsibility and strong commitment. Do not give up when \nfacing difficulty or always try to fulfill duties by different ways \nBe always evaluated high level from the first days in Gameloft and Global \nCybersoft Vietnam \nLove and always be willing to take the challengers. \nOpen-minded and possess solution-oriented mindset. \nHave deep knowledge about game testing process and software testing process. \nHave good command of tools. \nBe able to make and follow-up plan. \nAlways learn from mistakes to prevent them from happening again. \nBe willing to share information, experience and knowledge. \nPossess good logical and systematically thinking. \nExpertise includes: \nTeam building \nLinux operating systems \nInterviewing \nSmall-scale project management \nMid-scale team management \nGame testing \nSoftware testing \nSound technical and testing \nSoftware Development processes \nTeams' discipline and working attitude \nCAREER HISTORY AND EXPERIENCE: \nMarch 2018 - 2019: work at Best food for you Ltd Company \n⚫ \nMay 2018: Act as General Manager and Director Assistant \nTask: \nArrange working hours for employees \nAssign and coordinate task for employees  \nManage and instruct staff how to best serve customers \nTrain employees properly \nSolve problems between customers and employees \nSupport in case the employee is absent \nResponsible for money issues or papers \nInterview, recruitment and staff training \nCheck out the kitchen area and restaurant area \nEnsure hygiene standards \nOctober 2016 - October 2017: work at Neolab Vietnam \n⚫ \nNovember 2016: Build standard testing process for company. \n⚫ \nDecember 2016: Create hiring test and join interview team for testing \nrecruitment \n⚫ \nDecember 2016: Become QC manager candidate \n⚫ \nDecember 2016: Join “kaizen” team to help improve process in company. \nTask: \nExecute test cases \nPerform Ad-hoc test \nCreate, follow and verify bug \nHelp Scrum master manage bug and task \nMake report \nSeptember 2014 - September 2016: work at Global Cybersoft Vietnam \n⚫ \nSeptember 2014: Work as engineer for the most important project. \n⚫ \nJanuary 2015: Join Leader training at Sai Gon Branch. \n⚫ \nFebruary 2015: Work as team leader at Da Nang Branch. \nTask: \nVerify bugs on JIRA for myself and the others. \nExecute and report special tasks such as NEL, DBSTalks, CB/DB, Special \nbuild, etc. \nFind and post bug. \nExecute test cases. \nSuggestion, improvements, updates to test cases on Testlink. \nJIRA processing: Filter/Prioritize/Assign bugs, Track and review comments, \nprocess; Support solving JIRA issues, Watch JIRAs to update the current \nprogress and feature update to figure out the strategy, then update to team. \nAnalyze Jira to propose TC modification. \nUpdate estimation to database. \nAssign tasks to members. \nDownload/Upload build. \nSolve issues with Sling, network, devices and environment settings. \nCompose slides for training, presentation. \nCreate/Update testsuite, manage TCs in a testsuite. \nTrack testing progress. \nSync test assignment, test result. \nUpdate latest document/spec/feature/UI/etc. \nReview bug contents or template. \nTechnical support for test execution. \nDoing report for team/task. \nCollect team data, team ideas and issues, then process it or propose to \nhigher level. \nTrack devices moving in teams. \nRole: \nJob Knowledge - Understanding of domain knowledge, skills, equipment, and \nresources required to perform work assignments. \nResponsibility - Demonstrate ownership of assigned work; accept \nresponsibility for their performance; accept new assignment; fulfill \ncommitments, meet deadlines and achieves expected results; provide fair \nand timely feedback on member's performance; positive work attitude \nInitiative - Have ability in analyzing problems, generating ideas & taking \naction to solve problems; make appropriate decisions; suggest & implement \nimproved work methods; follow through on tasks with little or no reminders; \nwillingness to learn new skills; receptive to new ideas and new questions; \nencourage innovation and initiative; create a vision and strategy for \nmembers. \nTeamwork - Have ability in cooperating with other members in a team \neffectively to achieve the common goals/targets; provide an efficient work \natmosphere; willing to help and guide members when needed \nDevelopment  - Have ability to recognize strong points, weaknesses and \ncreate a plan for self-improvement; acknowledge own limitations and \nmistakes. \nLeadership/Management skill - Have professional, administrative, and \nspecialized knowledge required to perform the job; ability to motivate others, \nto foster employee morale and satisfaction; providing clear instruction, \ncommunicating constructive feedback, recognizing and resolving problem; \nprovides opportunities for others to develop skills; influence other members; \ninspire trust and respect from others. \nNegotiation skill – Effectively resolving issues through such things as the \nunderstanding of key motivators, negotiating around fixed positions and \npracticing win-win negotiations. \nCommunication skill - Have ability to communicate clearly; effective written \nand verbal communication skills; openly and honestly with members. \nStaff Development - Have ability to recognizing employee’s abilities and \nskills, giving clear instructions and guidance in order to improve weaknesses; \npromotes employee safety and wellness; rewards and recognizes individual \nand team successes; motivate members to perform well and good working \nrelationships. \nSeptember 2010 - August 2014: work at Gameloft \n⚫ \nSeptember 2010: One of two the best passed the initial training course in \nDAD studio. \n⚫ \nOctober 2010: Newbie in TNS team, the most important team at that time. \n⚫ \nNovember 2010 - March 2011: Main key in LatAm team. \n⚫ \nMarch 2011 - July 2013: Senior in DAD Sound team. My duty is finish my \nwork, support and share tasks with my leader as well as back up for him. \n⚫ \nAugust 2013 - August 2014: Leader of SA2 Sound team. But I act as QA \nProject Manager and Sound Division Lead , I always handle 7-8 projects at \nthe same time, around 40 projects per year and make sure that all projects \nboth meet the deadline , achieve objectives and milestones. I also often \nmake decisions concerning all sound issues in Gameloft SA2 studio. I become \nthe prime candidate for SEA Sound QA Lead position. \nRole: \nAnalyze all requests, documents and objectives set for project and give right \ninstructions to the teams. \nAnalyze the project status to implement appropriate solution and strategy. \nDeploy testing plan among team-members. \nProvide guidance so that the team executes the tasks diligently. \nEnsure that the team effectively achieves milestones as planned, quality \ntargets, and meet the deadlines. \nEnsure that the team performs tests according to checklists and process. \nEnsure that the team is disciplined, motivated and committed. \nManage time, pressure and work flow in best way, so that situation of \noverloading or disorganization is prevented. \nSet clear responsibilities for each team-member and ensure that testers are \nassigned the right tasks which are suitable with their experience and skills. \nPlan the tests effectively with precise time estimation. \nControl project status, so that issues are fixed or anticipated, and necessary \nfeedback are raised to superiors in timely manner. \nCarry out project post-mortem analysis/meeting to guide team-members and \nto learn lessons from the past issues. \nFind the way to motivate team-members, inspiring them enthusiasm at \nwork, willingness to learn and improve, dedication, positive thinking as well \nproblem-solving mindset. \nCreate hiring test and interview candidates for team and division. \nTrain newbie for team and division. \nCoach testers to constitute a strong and highly skilled core resource, which \neffectively helps team management and improvement. \nHave plan to improve testers in general in both skills and professional \nworking style and method. \nSet necessary rules to improve the teams' discipline and working attitude. \nEDUCATION/ QUALIFICATIONS/ ARCHIEVEMENTS: \n2006: Graduate in NIIT course at Phu Xuan University. \n2010: Graduate in Information Systems at Yersin University. \n2010: make 365 TOEIC points. \n2011: rank 13th at annual QA challenge. \n2013: rank 1st in all Vietnam studios at the contest to recruit QA lead for SA2 \nsound team. \n2014: rank 1st at the sound skill contest. \nAnd many awards in other activities in Gameloft. \n2014: become one of two candidates for team leader after 3 working months. \n2015: join Leader training at Saigon. \n2017: get 550 TOEIC points \nREFERENCE: \nThan Trong Phuc \nManaging Director of DFJ VinaCapital fund \nEmail: phuc.than@vinacapital.com ", "educations": [{"id": 5507, "gpa": null, "major": null, "school": "Phu Xuan University", "diploma": "Bachelors", "end_time": "2006-01-01T00:00:00Z", "conf_score": 0.8068873668007818, "start_time": null, "picklist_major": "Other", "major_categories": "", "major_categories_detail": ""}, {"id": 5508, "gpa": null, "major": "Hệ thống thông tin quản lý", "school": "Yersin University", "diploma": "Bachelors", "end_time": "2010-01-01T00:00:00Z", "conf_score": 0.8301177271312712, "start_time": null, "picklist_major": "Administrative/Clerical", "major_categories": "Kinh doanh và quản lý", "major_categories_detail": "Quản trị – Quản lý"}], "experiences": [{"id": 18405, "detail": "Task: Arrange working hours for employees\nAssign and coordinate task for employees\nManage and instruct staff how to best serve customers\nTrain employees properly\nSolve problems between customers and employees\nSupport in case the employee is absent\nResponsible for money issues or papers\nInterview, recruitment and staff training\nCheck out the kitchen area and restaurant area\nEnsure hygiene standards", "company": "Best food for you Ltd Company", "end_time": "2019-01-31T00:00:00Z", "industry": "FMCG", "position": "General Manager and Director Assistant", "conf_score": 0.8533721302994479, "start_time": "2018-05-01T00:00:00Z"}, {"id": 18406, "detail": ": Create hiring test and join interview team for testing recruitment", "company": "Neolab Vietnam", "end_time": "2017-10-31T00:00:00Z", "industry": "Other", "position": null, "conf_score": 0.7977225828193003, "start_time": "2016-11-01T00:00:00Z"}, {"id": 18407, "detail": ": Join “kaizen” team to help improve process in company.\nTask: Execute test cases\nPerform Ad-hoc test\nCreate, follow and verify bug\nHelp Scrum master manage bug and task\nMake report", "company": "Neolab Vietnam", "end_time": "2016-12-31T00:00:00Z", "industry": "Other", "position": "QC manager", "conf_score": 0.6981244904084882, "start_time": "2016-12-01T00:00:00Z"}, {"id": 18408, "detail": "training at Sai Gon Branch. ⚫", "company": "Global Cybersoft Vietnam", "end_time": "2016-09-30T00:00:00Z", "industry": "High Technology", "position": "Leader", "conf_score": 0.6960871676698025, "start_time": "2014-09-01T00:00:00Z"}, {"id": 18409, "detail": ". Task: Verify bugs on JIRA for myself and the others.\nExecute and report special tasks such as NEL, DBSTalks, CB/DB, Special build, etc.\nFind and post bug.\nExecute test cases.\nSuggestion, improvements, updates to test cases on Testlink. JIRA processing: Filter/Prioritize/Assign bugs, Track and review comments, process; Support solving JIRA issues, Watch JIRAs to update the current progress and feature update to figure out the strategy, then update to team.\nAnalyze Jira to propose TC modification.\nUpdate estimation to database.\nAssign tasks to members.\nDownload/Upload build.\nSolve issues with Sling, network, devices and environment settings.\nCompose slides for training, presentation.\nCreate/Update testsuite, manage TCs in a testsuite.\nTrack testing progress.\nSync test assignment, test result.\nUpdate latest document/spec/feature/UI/etc. Review bug contents or template.\nTechnical support for test execution.\nDoing report for team/task.\nCollect team data, team ideas and issues, then process it or propose to higher level.\nTrack devices moving in teams.\nRole: Job Knowledge - Understanding of domain knowledge, skills, equipment, and resources required to perform work assignments.\nResponsibility - Demonstrate ownership of assigned work; accept responsibility for their performance; accept new assignment; fulfill commitments, meet deadlines and achieves expected results; provide fair and timely feedback on member's performance; positive work attitude\nInitiative - Have ability in analyzing problems, generating ideas & taking action to solve problems; make appropriate decisions; suggest & implement improved work methods; follow through on tasks with little or no reminders; willingness to learn new skills; receptive to new ideas and new questions; encourage innovation and initiative; create a vision and strategy for members.\nTeamwork - Have ability in cooperating with other members in a team effectively to achieve the common goals/targets; provide an efficient work atmosphere; willing to help and guide members when needed\nDevelopment - Have ability to recognize strong points, weaknesses and create a plan for self-improvement; acknowledge own limitations and mistakes.\nLeadership/Management skill - Have professional, administrative, and specialized knowledge required to perform the job; ability to motivate others, to foster employee morale and satisfaction; providing clear instruction, communicating constructive feedback, recognizing and resolving problem; provides opportunities for others to develop skills; influence other members; inspire trust and respect from others.\nNegotiation skill - Effectively resolving issues through such things as the understanding of key motivators, negotiating around fixed positions and practicing win-win negotiations.\nCommunication skill - Have ability to communicate clearly; effective written and verbal communication skills; openly and honestly with members.\nStaff Development - Have ability to recognizing employee’s abilities and skills, giving clear instructions and guidance in order to improve weaknesses; promotes employee safety and wellness; rewards and recognizes individual and team successes; motivate members to perform well and good working relationships.", "company": "Da Nang Branch", "end_time": "2015-12-31T00:00:00Z", "industry": "Other", "position": "team leader", "conf_score": 0.8121556455763596, "start_time": "2015-02-01T00:00:00Z"}, {"id": 18410, "detail": "", "company": "Global Cybersoft Vietnam", "end_time": "2015-01-31T00:00:00Z", "industry": "High Technology", "position": "engineer", "conf_score": 0.7828559450360946, "start_time": "2014-09-01T00:00:00Z"}, {"id": 18411, "detail": ", I always handle 7-8 projects at the same time, around 40 projects per year and make sure that all projects both meet the deadline , achieve objectives and milestones. I also often make decisions concerning all sound issues in Gameloft SA2 studio. I become the prime candidate for SEA Sound QA Lead position.\nRole: Analyze all requests, documents and objectives set for project and give right instructions to the teams.\nAnalyze the project status to implement appropriate solution and strategy.\nDeploy testing plan among team-members.\nProvide guidance so that the team executes the tasks diligently.\nEnsure that the team effectively achieves milestones as planned, quality targets, and meet the deadlines.\nEnsure that the team performs tests according to checklists and process.\nEnsure that the team is disciplined, motivated and committed.\nManage time, pressure and work flow in best way, so that situation of overloading or disorganization is prevented.\nSet clear responsibilities for each team-member and ensure that testers are assigned the right tasks which are suitable with their experience and skills.\nPlan the tests effectively with precise time estimation.\nControl project status, so that issues are fixed or anticipated, and necessary feedback are raised to superiors in timely manner.\nCarry out project post-mortem analysis/meeting to guide team-members and to learn lessons from the past issues.\nFind the way to motivate team-members, inspiring them enthusiasm at work, willingness to learn and improve, dedication, positive thinking as well problem-solving mindset.\nCreate hiring test and interview candidates for team and division.\nTrain newbie for team and division.\nCoach testers to constitute a strong and highly skilled core resource, which effectively helps team management and improvement.\nHave plan to improve testers in general in both skills and professional working style and method.\nSet necessary rules to improve the teams' discipline and working attitude.", "company": "SA2 Sound team", "end_time": "2014-08-31T00:00:00Z", "industry": "Other", "position": "QA\nProject Manager and Sound Division Lead", "conf_score": 0.7481370716395834, "start_time": "2013-08-01T00:00:00Z"}, {"id": 18412, "detail": "", "company": "Gameloft", "end_time": "2014-08-31T00:00:00Z", "industry": "High Technology", "position": "Newbie", "conf_score": 0.7828559450360946, "start_time": "2010-09-01T00:00:00Z"}, {"id": 18413, "detail": "", "company": "DAD Sound team", "end_time": "2013-07-31T00:00:00Z", "industry": "Other", "position": "Leader", "conf_score": 0.7828559450360946, "start_time": "2011-03-01T00:00:00Z"}, {"id": 18414, "detail": "", "company": "LatAm team", "end_time": "2011-03-31T00:00:00Z", "industry": "Other", "position": "Senior", "conf_score": 0.7481370716395834, "start_time": "2010-11-01T00:00:00Z"}, {"id": 18415, "detail": "", "company": "TNS team", "end_time": "2010-10-31T00:00:00Z", "industry": "Other", "position": "Main key", "conf_score": 0.7481370716395834, "start_time": "2010-09-01T00:00:00Z"}], "address": null}