{"skills": ["user interface", "dom", "analysis", "dhtml", "database management", "virtualizations", "provisioning", "design pattern", "vast", "multi server", "mysql", "query optimization", "database management system", "cakephp", "apache http server", "object oriented design", "system testing", "window xp", "virtual box", "laravel", "implementation", "mvc", "bootstrap", "nginx", "operating system", "rest", "problem solving", "c++", "ruby", "agile", "testing", "complex query", "python", "computing service", "xsl", "wordpress", "security", "database development", "software development methodology", "uml", "html5", "payment", "apache", "database", "ubuntu linux", "npm", "object oriented", "cloud", "php", "linux operating system", "management", "git", "java", "css", "service oriented architecture", "html", "virtualization", "xslt", "sqlite", "jquery", "linux system", "data management", "ood", "software development", "m sql server", "sdlc", "relational database", "centos", "data structure", "json", "chef", "svn", "structure", "linux", "ajax", "css3", "ubuntu", "mssql", "sql", "aws cloud computing", "package manager", "magento", "virtual machine", "javascript", "wsdl", "actionscript", "mvc architecture", "client server", "xml", "aws", "enterprise", "virtualization technology", "perforce", "cloud computing service", "etl", "process model"], "fulltext": "ASHISH LAW – Magento Developer \nSkype: live: ashish-law, Email: Ashishlaw@cssoftsolutions.com \nSUMMARY \nLead and senior Magento developer with over 8+ years of professional experience in all phases of \nSoftware Development Life Cycle (SDLC) with a focus on web based client-server (multi-tier architecture) \napplications, mobile, and database development. Experience in developing web applications using PHP \n4/5/7, Magento, Magento 2, LAMP, WAMP, Python, Flash, ActionScript 2/3, HTML5, WebGL, SVG, CSS3, \nDHTML, DOM, JavaScript, HTML4, JQuery, Joomla, Web Workers, Raphael.js, Snap.svg, Node.js, JSON, \nUML, XML, XSL/XSLT and AJAX. I have ability to work both independently and as part of a team with strong \ncommunication, collaboration, and analytical solving skills. \nPROFESSIONAL OVERVIEW \n \nExperience developing and deploying web applications with MVC frameworks: Laravel and \nCakePHP. \n \nProficient in Object-Oriented Design (OOD), data structures, problem solving, complexity analysis \n& debugging and good understanding of various design patterns. \n \nFamiliar with Service Oriented Architecture (SOA) with experience developing and consuming \nWeb Services using REST, SOAP, XML, WSDL. \n \nExperience developing application based on Magento, Joomla, WordPress and Content \nManagement Systems (CMS) \n \nExperience implementing third-party connections via API. \n \nExperience using version control systems such as Git, and Perforce. \n \nExperience using package managers such as Composer and NPM. \n \nWell versed in using Software Development Methodologies like Waterfall and Agile. \n \nExperience with database development with Relational Database Management Systems such as \nMSSQL, MYSQL, and SQLite. \n \nExcellent working knowledge on LAMP environment. \n \nExperienced in designing complex queries, stored procedures, triggers, joins, Common Table \nExpressions ( CTE ), Temp tables, tables, views and user defined functions using T-SQL. \n \nStrong RDBMS skills with excellent knowledge of Design, Normalization, De-Normalization, ETL \nimplementation using SQL Server Integration Services ( SSIS ), Performance Tuning, Query \nOptimization and Database Management Concepts. \n \nWorking knowledge of Virtualization technologies including VMWare, Virtual box, Vagrant for \ncreating virtual machines and provisioning environments (using Shell and Chef). \n \nAcquainted with AWS Cloud-Computing Services including EC2, S3, EBS, VPC, ELB, AMI, SNS, SQS, \nIAM, Security Groups, Dynamo DB, Cloud Front, Cloud Formation, and Route 53. \n \nGood Web Application debugging skills using Chrome Developer Tool and Firebug. \nWORK EXPERIENCE \nSenior Magento Developer/Team Lead  \nAugust 2017 – Present \nCS SOFT SOLUTIONS PVT. LTD. \n \nDevelop and integrate intelligent features into Visual-Planner aimed at maximizing the software's effectiveness and \nusefulness. \n \nFine-tune and rebuild parts of User Interface (UI) to achieve high quality user experience. \n \nWork closely with other team members to coordinate software development and determine project scope and \nlimitations. \n \nRevamped the entire Admin panel by implementing MVC architecture using Laravel framework and various open-\nsource libraries (Data Tables, Bootstrap, jQuery/jQuery UI) \n \nResponsible for scoping and developing client websites using the enterprise version of Magento Commerce e-\ncommerce platform. \n \nActively involved in R&D for new technologies and recommend solutions that enable the company to achieve its goals. \n \nStrong experience with Magento Commerce (creating modules, extending out-of-the-box functionality, layout creation \nand theming)  \nMagento Developer \nAugust 2014 – July 2017 \nCS SOFT SOLUTIONS PVT. LTD. \n \nDesigned, built, tested and implemented stand-alone modules for Magento 2, including payment and shipping modules. \n \nCustomized Magento's inherent features based on client needs. \n \nManaged and maintained development of PHP backend for dynamic database driven websites \n \nDevelop and design all corporative web sites, based in Joomla template \n \nWorked on PHP, HTML/CSS, Node.js, Ajax/JavaScript, SVN, GIT and MySQL and Apache, demonstrating vast LAMP \narchitecture experience. \n \nDeveloped new modules on Laravel - Worked on building admin side dashboard. \n \nDeveloped cross browser and multi browser compatible web pages using HTML5, MySQL, CSS3, and JavaScript. \n \nTracked and fixed bugs that were found during various phases of developments.  \nJunior Magento Developer \nAugust 2011 – July 2014 \nCS SOFT SOLUTIONS PVT. LTD. \n \nFollowed software development life cycle and process models to design and develop web based internal lot tracking \nsystem using PHP and MySQL database. \n \nReviewed project requests, describing database user needs, to estimate time required to accomplish the project. \n \nDefined and maintained standard database methodologies, procedures and guidelines (e.g., design, monitoring) in \norder to ensure effective and efficient data management. \n \nDeveloped statistical reports and used PHP scripts to generate dynamic charts and graphs. \n \nPlanned, coordinated and implemented security measures to safeguard information against accidental or unauthorized \ndamage, modification or disclosure. \n \nProvided support (e.g. debug, enhancements, monitoring, testing) and upgrades in order to maintain the application. \n \nCreated test cases and performed unit and system testing. \n \nMaintained programming, documentation and coding standards using perforce version control system.  \nEDUCATION \nBTECH in Computer Science \nYear of Passing 2011 \nHigher Secondary Education \nYear of Passing 2007 \n10th  \nYear of Passing 2005 \nTECHNICAL SKILLS \nSkills: PHP 4/5/7, Java, C/C++, T-SQL, Ruby, Shell, Joomla, Python, JavaScript, ActionScript 2/3 \nWeb Technologies: HTML 4/5, Node.js, LAMP, WebGL, SVG, Laravel, CSS3, JQuery, Web Workers, \nRaphael.js, Snap.svg, XML, JSON, AJAX, SEO, HTML5, Zend, Bootstrap 2/3 \nDatabases: MS SQL Server 2008, MySQL, Amazon Dynamo DB, SQLite \nOperating Systems: Linux (Ubuntu, CentOS), Windows (XP, Vista, 7, 8, 10) \nWeb Servers: Apache HTTP Server, Nginx \nVirtualization/Cloud Technologies: VMWare, Virtual Box, Vagrant, Amazon Web Services (AWS) \nVersioning: Git, Perforce \nDECLARATION \nI hereby declare that the above mentioned information is correct up to my knowledge and I bear the \nresponsibility for the correctness of the above mentioned particulars. \nPlace: Chandigarh \nAshish Law \nPowered by TCPDF (www.tcpdf.org)", "educations": [{"id": 5509, "gpa": null, "major": null, "school": "Higher Secondary Education", "diploma": "Other", "end_time": "2007-01-01T00:00:00Z", "conf_score": 0.8068873668007818, "start_time": "2005-01-01T00:00:00Z", "picklist_major": "Other", "major_categories": "", "major_categories_detail": ""}], "experiences": [{"id": 18416, "detail": "Develop and integrate intelligent features into Visual-Planner aimed at maximizing the software's effectiveness and usefulness.\nFine-tune and rebuild parts of User Interface (UI) to achieve high quality user experience.\nWork closely with other team members to coordinate software development and determine project scope and limitations.\nRevamped the entire Admin panel by implementing MVC architecture using Laravel framework and various open- source libraries (Data Tables, Bootstrap, jQuery/jQuery UI) Responsible for scoping and developing client websites using the enterprise version of Magento Commerce e- commerce platform.\nActively involved in R&D for new technologies and recommend solutions that enable the company to achieve its goals.\nStrong experience with Magento Commerce (creating modules, extending out-of-the-box functionality, layout creation and theming)", "company": "CS SOFT SOLUTIONS PVT. LTD.", "end_time": "2023-04-13T00:00:00Z", "industry": "High Technology", "position": "Senior Magento Developer/Team Lead", "conf_score": 0.9512303155325736, "start_time": "2017-08-01T00:00:00Z"}, {"id": 18417, "detail": "Designed, built, tested and implemented stand-alone modules for Magento 2, including payment and shipping modules.\nCustomized Magento's inherent features based on client needs.\nManaged and maintained development of PHP backend for dynamic database driven websites\nDevelop and design all corporative web sites, based in Joomla template\nWorked on PHP, HTML/CSS, Node.js, Ajax/JavaScript, SVN, GIT and MySQL and Apache, demonstrating vast LAMP architecture experience.\nDeveloped new modules on Laravel - Worked on building admin side dashboard.\nDeveloped cross browser and multi browser compatible web pages using HTML5, MySQL, CSS3, and JavaScript. Tracked and fixed bugs that were found during various phases of developments.", "company": "CS SOFT SOLUTIONS PVT. LTD.", "end_time": "2017-07-31T00:00:00Z", "industry": "High Technology", "position": "Magento Developer", "conf_score": 0.9512303155325736, "start_time": "2014-08-01T00:00:00Z"}, {"id": 18418, "detail": "Followed software development life cycle and process models to design and develop web based internal lot tracking system using PHP and MySQL database.\nReviewed project requests, describing database user needs, to estimate time required to accomplish the project.\nDefined and maintained standard database methodologies, procedures and guidelines (e.g., design, monitoring) in order to ensure effective and efficient data management.\nDeveloped statistical reports and used PHP scripts to generate dynamic charts and graphs.\nPlanned, coordinated and implemented security measures to safeguard information against accidental or unauthorized damage, modification or disclosure.\nProvided support (e.g. debug, enhancements, monitoring, testing) and upgrades in order to maintain the application.\nCreated test cases and performed unit and system testing.\nMaintained programming, documentation and coding standards using perforce version control system.", "company": "CS SOFT SOLUTIONS PVT. LTD.", "end_time": "2014-07-31T00:00:00Z", "industry": "High Technology", "position": "Junior Magento Developer", "conf_score": 0.9542271074073599, "start_time": "2011-08-01T00:00:00Z"}], "address": null}