{"skills": ["search", "management tool", "machine learning", "user interface", "java", "css", "json", "testing", "clustering", "automation", "kafka", "hdfs", "maven", "extjs", "python", "self learning", "random number", "structure", "data warehouse", "html", "twitter", "kibana", "redis", "bidding", "linear regression", "java core", "oracle", "hbase", "file system", "artificial neural network", "jquery", "eauthentication", "regression", "unit test", "marketing", "activemq", "cnn", "selenium", "business logic", "elasticsearch", "recurrent neural network", "html5", "javascript", "strut", "apache", "mockito", "milk", "cache", "hibernate", "frontend development", "convolutional neural network", "software development", "php", "backend development", "android", "rest", "angularjs", "event log", "social media marketing", "hadoop", "mapreduce", "spring", "rnn", "management", "medium", "neural network", "raw"], "fulltext": "Khiem Tran \n- \nGraduated from the University of Information Technology VNU-HCM (in 2013) \nHave been working as a software engineer since 2013 for two companies (FPT Software HCM, \nVietnam, 2013-2016 and MainSpring Technology, Indonesia, 2016-now) \nWork as a backend developer with Java, Python, PHP, a front-end developer with HTML, CSS, \nJavascript and mobile app developer with Android \nHave experiences on Big-data, Machine Learning and social media marketing \n- \n- \n- \nWorking Experiences \n9/2016 - Now (MainSpring Technologies, Jakarta) \nSocial marketing engineer and Team leader \nProject: Organic user growth \nDescription:  \nGet new users and increase old user app engagement (re-engagement) from Facebook fan pages, Twitter \nand Instagram \nResponsibilities: \n● \nTake full responsibility to create an automated system to fetch the recommended contents, post \ninto social media channels (FB, Twitter and Instagram), analyse its performance insights and \noptimize it to get new users and engage users come back to the app \nTechnologies:   \n● \nPython, FB, Twitter SDK  \nAchievement : \n● \nReach 1+ million users, 80+ new users/day, 0.18% re-engagement \nProject: Content pipeline for social media marketing automation \nDescription:  \nUsing Machine learning to build a content recommendation system for social media marketing \nResponsibilities: \n● \nResearch Machine Learning models: Linear Regression, Classification, Clustering, Artificial Neural \nNetwork (ANN), Convolutional Neural Network (CNN), Recurrent Neural Network (RNN), Natural \nLanguage Processing (NLP), etc \n● \nApply Machine Learning models to create a rank model \nTechnologies:   \n● \nPython  \n● \nMachine Learning libraries \nAchievement : \n● \nBuilding a rank model with Deep Neural Network (DNN) to predict a good CTR article with the \nprecision is 70+% \nProject: Social media marketing automation \nDescription:  \nInternal tools to automate the social media marketing processes (FB, Twitter, Instagram) \nResponsibilities: develop backend features for: \n● \nFacebook Ads Automation: automate creating campaigns process \n● \nFacebook Rule Tool: automate bidding, turn on, turn off campaigns \n● \nRule Log Monitoring Tool: search log details, summarize log status, warning alert \nTechnologies:   \n● \nPython for backend, Facebook SDK \n● \nPHP, AngularJS for frontend \nAchievement : \n● \nMarketing team saves 80% time with the automation tool \nBig-data engineer and Team leader  \nProject Description:  \nBuild an analytic system to analyze app events, user behavior to improve app content quality and marketing \nperformance \nResponsibilities: Re-structure the old system with: \n● \nLog handler: build log handling server with Netty and write data to Kafka \n● \nLog cluster writer: reading log from Kafka, process and write to Elasticsearch, Redis, Raw file \nsystem and forward it to other systems to unify the data \n● \nLog cluster tracking: display cluster status info: Kafka partition’s status, the health of workers, \nprocessors, writers, etc \n● \nLog api: built on top of Elasticsearch to get out the aggregation of log information \n● \nHadoop cluster: store raw log events to Hbase and HDFS. Build data warehouse for ad-hoc query \nwith long time range with Apache Phoenix and Hive \nTechnologies : \n● \nBig-data tools: Kafka, Elasticsearch, Redis, Hive, Hbase \n● \nJava \nAchievement : \n● \nThe new system running with the memory heap is under controlled (not increase to overflow) day \nby day \n● \nBe able to handle average 100+ million events per day. Visually 14-day data in Kibana charts \n6/2013 – 9/2016 (FPT Software, HCM, Vietnam) \nProject: Metadata Management Tool \nDescription: Maintain and add new features to project Metadata Management Tool. Customer is DirecTV, \na US client which provide satellite TV programs, now merged to AT&T \nResponsibilities: Develop new features:  \n● \nManage and track all metadata related to TV Program like: title, description, thumbnail, release \nyear. Support end-user to view, search, schedule a report, download, email, create ticket to fulfill \nmissing metadata… \n● \nBigData prototype project: migrate the current project to Hadoop environment to get the benefit \nfrom batch processing to generate the missing metadata report. Batch processing is based on \nMapReduce, Oozie, Pig, Hive, data is stored in HDFS. \nTechnologies:   \n● \nBackend: Java core, Spring, JPA, Jersey, Redis cache, ActiveMQ, Quartz scheduler \n● \nFront-end: Liferay Portal, Jquery, BackboneJs, AngularJs, HTML5, Css \n● \nTesting: Mockito, PowerMock (Unit Test), DBUnit, Spring test, REST-assured (Integration test), \nSelenium (UI Test) \n● \nServer: Weblogic \n● \nDB: Oracle \nProject: Universal Profile – DirecTV Customer (US client) \nDescription: Manage universal user profile, which allows user login in multiple devices (laptop, PC, mobile \nand smart TV)  \nResponsibilities :  \n● \nWrite unit test for some functions \nTechnologies:  Spring, Jersey, Mockito, Maven \n3/2013 – 6/2013 \nProject: Simple Issue Tracker, final school project \nDescription: Develop a tool for issue tracking. User can create a project, add member, add issue and \nassign issue to resolver. All status will be shown on the dashboard page. Each member has a role so they \nare only login to their pages to get and edit information. \nResponsibilities:  \n● \nView: Create a web app using ExtJs 4. \n● \nBusiness Logic: implemented using Struts 2. \n● \nPersistence Layer: Implement by Hibernate 3. Business logic produce data and send to View Layer \nby JSON and Hibernate 3 map all table in DB to object so  \nthese parts are separate, very \neasy to maintain and expand. \nTechnologies:  ExtJs 4,  Struts 2, Hibernate 3 \n9/2012 – 3/2013 \nDrupal 7 Developer (iStar Solution company, HCM, Part-time job) \nProject Description:  Build a website and Facebook App for Vinasoy Corp company to present their \nevents to introduce the new products.  \nThe website must be beautiful and give helpful information to the visitor. Visitors can register to receive \nfree-trial milk on Facebook and Website. All orders will be gathered and processed by Vinasoy Corp \nemployees, then the milk will be delivered to visitors \nResponsibilities:  \n● \nDevelop UI, web pages with Drupal 7 \n● \nImplement functionalities to generate random number for coupon gift, receive user register \ninformation… \nTechnologies:  PHP, Drupal 7, CSS, JavaScript, jQuery \nOther projects: \nWebsite ATZ Solutions \nProject Description:  Build a website ATZ Solutions Company \nResponsibilities:  \n● \nDesign and develop pages: Home, About Us, Production & Solutions, etc \n● \nHandle Contact form submission and Sending email \nTechnologies:  Drupal 7 \nLink:  http://atzsolutions.com.vn/ \nWebsite Ba Ria - Vung Tau University \nProject Description:  Build a website for the Ba Ria – Vung Tau’s university and its faculties using Liferay \nPortal, displaying useful information for students and visitors. User interface must look neat, easy to use \nand stable day by day. \nResponsibilities :  \n● \nDesign website structure: master site, department sites, support sites \n● \nDevelop Front-end pages (Main page, details pages, management pages) \n● \nDevelop News, User, Document management system, LDAP authentication system (portlets in \nLiferay) \nTechnologies:  Liferay Portal \nLink: http://bvu.edu.vn/ \nEducation \n● \nThe University Of Information Technology – Major: Software Engineer (GPA: 8.4/10) \n● \nZend Framework (PHP) course at Nhat Nghe IT \n● \nSelf learning Big-data, Machine learning courses in Coursera.com, Udemy.com \nCertification \n● \nLiferay Certified Professional Developer 6.1 ", "educations": [{"id": 5514, "gpa": "8.4", "major": "Software Engineer", "school": "The University Of Information Technology", "diploma": "Bachelors", "end_time": null, "conf_score": 0.7758015359822968, "start_time": null, "picklist_major": "Other", "major_categories": "", "major_categories_detail": ""}, {"id": 5513, "gpa": null, "major": null, "school": "University of Information Technology VNU", "diploma": "Bachelors", "end_time": "2013-01-01T00:00:00Z", "conf_score": 0.8130227357863926, "start_time": "2013-01-01T00:00:00Z", "picklist_major": "Other", "major_categories": "", "major_categories_detail": ""}], "experiences": [{"id": 18429, "detail": "Project: Organic user growth\nDescription: Get new users and increase old user app engagement (re-engagement) from Facebook fan pages, Twitter and Instagram Responsibilities: ● Take full responsibility to create an automated system to fetch the recommended contents, post into social media channels (FB, Twitter and Instagram), analyse its performance insights and optimize it to get new users and engage users come back to the app\nTechnologies: ● Python, FB, Twitter SDK", "company": "MainSpring Technologies", "end_time": "2023-04-13T00:00:00Z", "industry": "High Technology", "position": "Social marketing engineer and Team leader", "conf_score": 0.922941463950707, "start_time": "2016-09-01T00:00:00Z"}, {"id": 18430, "detail": "Java, Python, PHP, a front-end developer with HTML, CSS, Javascript and mobile app developer with Android Have experiences on Big-data, Machine Learning and social media marketing", "company": "MainSpring Technology", "end_time": "2023-04-13T00:00:00Z", "industry": "High Technology", "position": "backend developer", "conf_score": 0.8249348395643831, "start_time": "2016-01-01T00:00:00Z"}, {"id": 18431, "detail": ", HCM, Vietnam) Project: Metadata Management Tool Description: Maintain and add new features to project Metadata Management Tool. Customer is DirecTV, a US client which provide satellite TV programs, now merged to AT&T Responsibilities: Develop new features:\n● Manage and track all metadata related to TV Program like: title, description, thumbnail, release year. Support end-user to view, search, schedule a report, download, email, create ticket to fulfill missing metadata...\n● BigData prototype project: migrate the current project to Hadoop environment to get the benefit from batch processing to generate the missing metadata report. Batch processing is based on\nMapReduce, Oozie, Pig, Hive, data is stored in HDFS. Technologies: ● Backend: Java core, Spring, JPA, Jersey, Redis cache, ActiveMQ, Quartz scheduler\n● Front-end: Liferay Portal, Jquery, BackboneJs, AngularJs, HTML5, Css ● Testing: Mockito, PowerMock (Unit Test), DBUnit, Spring test, REST-assured (Integration test),\nSelenium (UI Test) ● Server: Weblogic ● DB: Oracle Project: Universal Profile - DirecTV Customer (US client)\nDescription: Manage universal user profile, which allows user login in multiple devices (laptop, PC, mobile and smart TV) Responsibilities : ● Write unit test for some functions\nTechnologies: Spring, Jersey, Mockito, Maven", "company": "FPT Software", "end_time": "2016-09-30T00:00:00Z", "industry": "High Technology", "position": null, "conf_score": 0.6981244904084882, "start_time": "2013-06-01T00:00:00Z"}, {"id": 18432, "detail": "Drupal 7 Developer (iStar Solution company, HCM, Part-time job)\nProject Description: Build a website and Facebook App for Vinasoy Corp company to present their events to introduce the new products.\nThe website must be beautiful and give helpful information to the visitor. Visitors can register to receive free-trial milk on Facebook and Website. All orders will be gathered and processed by Vinasoy Corp employees, then the milk will be delivered to visitors\nResponsibilities: ● Develop UI, web pages with Drupal 7 ● Implement functionalities to generate random number for coupon gift, receive user register information...\nTechnologies: PHP, Drupal 7, CSS, JavaScript, jQuery", "company": "iStar Solution company", "end_time": "2013-03-31T00:00:00Z", "industry": "High Technology", "position": "Drupal 7 Developer", "conf_score": 0.8605808114883062, "start_time": "2012-09-01T00:00:00Z"}, {"id": 18433, "detail": "", "company": "FPT Software HCM", "end_time": "2013-01-31T00:00:00Z", "industry": "High Technology", "position": "software engineer", "conf_score": 0.8239308511863517, "start_time": "2013-01-01T00:00:00Z"}], "address": null}