{"skills": ["css", "git", "ruby", "amazon s3", "administration", "reactjs", "html", "twitter", "css3", "ubuntu", "capistrano", "redux", "jquery", "eauthentication", "material design", "omniauth", "coffeescript", "sell", "stack", "html5", "responsive", "oop", "javascript", "payment", "website development", "database", "nginx", "object oriented", "bootstrap", "ams", "docker", "cloud", "google map", "futures", "heroku", "test driven development", "rail", "asset management", "postgresql", "management", "google cloud", "aws", "bot"], "fulltext": "Thu Duc district, Ho Chi Minh\n\nDAU THE TIEN\nRuby on rails developer\nI am a Ruby on rails developer, I have self-taught web development and Ruby on Rails since my junior days\nand graduated Ruby on Rails courses at CoderSchool in August 2017. I work primarily in Ruby on Rails but as\nwell have experience in ReactJS, HTML, CSS, CoffeeScript, Twitter Bootstrap, Materialize, etc.\nI am looking for a chance to gain work experience as a Ruby on Rails Developer. Willing to work hard and\nexcited to continue learning new skills to become a successful developer.\nI want to work somewhere where I’ll have opportunities to develop my skills, take on interesting projects, and\nwork with people I can really learn from., I write elegant, readable code and learn new things. New\ntechnologies are always enjoyable for me, I love to build software that solves problems and makes life easier.\nSummary Summary    \nSept 2018 - Present\nJun 2017 - Jan 2018\nFull-stack Web Developer (Rails / React)\nSymphony Creative Solution\nUtilized OOP in Ruby to implement various functionalities.\nApply ReactJS and Redux to handle the front-end part of company project\nMaintain applications (Optimizing, Refactoring function)\nWorked independently and worked efficiently on a team to develop a website from\nscratch till the end using Rails and various common Ruby gems.\nBuild reusable modules to develop faster in the future.\nSupported other team members.\nResearch solution to handle application with a larger database.\nRefactor Rails application to a new pattern for clean code and optimize performance\nI have gotten the best growth of the year prize since 2018\nExperienced Ruby on Rails Developer\nVinova - Part-time job\nUtilized OOP in Ruby to implement various functionalities.\nMaintain applications (Optimizing, Refactoring function)\nWorked independently and worked efficiently on a team of 8 developers to develop a website from\nscratch till the end using Rails and various common Ruby gems.\nBuild reusable modules to develop faster in the future.\nSupported my team and other team members.\nDesigned and implemented database architecture for applications.\nShare my knowledge with my team members, coworkers and learned from them.\nWork experience\nWork experience    \nProgramming languages: Ruby, Javascript, HTML5, CSS3, Slim, Haml, CoffeeScript\nFrameworks / Libraries: Ruby on Rails, ReactJS, Redux, MaterializeCSS, Bootstrap, jQuery, Grape\nCloud platforms: AWS EC2, Digital Ocean, Heroku, Google Cloud\nServer administration: Ubuntu server, Nginx\nStorage: PostgreSQL\nTools: Sublime Text, VisualCode, Git, Docker, Terminal\nParadigms: Behavior-driven Development, Test-driven Development, Object-oriented Programming,\nResponsive Web Design, Model-View-Controller\nTechnical Skills\nTechnical Skills    \nChoVoucher\nA marketplace for trading, sharing voucher and coupons\nUsers can sell, buy vouchers or coupons. Users can purchase by COD  or Vietnam payment method. This\nhelps users stop wasting  unneeded voucher or coupons\nFront-end: React\nBackend: Rails\nDesigned a web-based UI with Google Material Design inspiration.\nConnected payment gateway VNPay processing application to Vietnam payment method.\nDevelop a scraper to get more vouchers from deals page in Vietnam.\nUtilized background processing to scrap data daily and to post the cheapest deal daily.\nIntegrated Facebook grape API to post vouchers to the Facebook page.\nUsing Capistrano to deploy the application to Google Cloud VPS.\nIntegrated Amazon S3 to serve images in the production environment.\nApplication config with Nginx, Puma, Let's Encrypt.\nLtrip  (Contributor)\nThis application is a project for the demo day of Coderschool course in August 2017\nDesigned a web-based UI with Google Material Design inspiration.\nIntegrated Amazon S3 to serve images in the production environment.\nMailing with Sengird-Email delivery service.\nIntegrated OmniAuth for authentication and restriction.\nUsing Google API to match taught places in google map.\nUsing API for showing the weather of place at the time.\nBuild Facebook Messenger bot to check trips connect with a database of the website\nASSET MANAGEMENT SYSTEM\nThe project to evaluate the internship course at Vinova Company\nThe system to manage the equipment in the company. The user can send the request and wait for\nfeedback from HR.\nIntegrated Amazon S3 to serve images in the production environment.\nMailing with Sengird-Email delivery service.\nSet cronjob for an auto-updating expired request and canceled a request.\nUsing React and Redux to handle the front-end part.\nPersonal project \nPersonal project   \nAugust 2014 - July 2019\nUndergraduate\nViet Nam National University HCMC - University Of Information\nTechnology\nMajor: Infomation system.\nAward: Receive scholarships to encourage good learning(once)\nCertificate: TOEIC 815\nEducation Education    ", "educations": [{"id": 5520, "gpa": null, "major": "Hệ thống thông tin", "school": "Viet Nam National University HCMC - University Of Information Technology", "diploma": "Bachelors", "end_time": "2019-07-01T00:00:00Z", "conf_score": 0.8737546908231326, "start_time": "2014-08-01T00:00:00Z", "picklist_major": "IT - Hardware/Networking", "major_categories": "Máy tính và công nghệ thông tin", "major_categories_detail": "Máy tính"}], "experiences": [{"id": 18445, "detail": "tilized OOP in Ruby to implement various functionalities.\nApply ReactJS and Redux to handle the front-end part of company project\nMaintain applications (Optimizing, Refactoring function)\nWorked independently and worked efficiently on a team to develop a website from scratch till the end using Rails and various common Ruby gems.\nBuild reusable modules to develop faster in the future.\nSupported other team members.\nResearch solution to handle application with a larger database.\nRefactor Rails application to a new pattern for clean code and optimize performance\nI have gotten the best growth of the year prize since 2018", "company": "Symphony Creative Solution", "end_time": "2023-04-13T00:00:00Z", "industry": "High Technology", "position": "Full - stack Web Developer (Rails / React)", "conf_score": 0.8948419004195385, "start_time": "2018-09-01T00:00:00Z"}, {"id": 18447, "detail": "- Part-time job\nUtilized OOP in Ruby to implement various functionalities.\nMaintain applications (Optimizing, Refactoring function)\nWorked independently and worked efficiently on a team of 8 developers to develop a website from scratch till the end using Rails and various common Ruby gems.\nBuild reusable modules to develop faster in the future.\nSupported my team and other team members.\nDesigned and implemented database architecture for applications.\nShare my knowledge with my team members, coworkers and learned from them.", "company": "Vinova", "end_time": "2018-01-31T00:00:00Z", "industry": "Other", "position": "Ruby on Rails Developer", "conf_score": 0.9283402044765778, "start_time": "2017-06-01T00:00:00Z"}], "address": "Thu Duc district, Ho Chi Minh"}