{"skills": ["payment", "perform testing", "insurance", "buy", "fund accounting", "commodities", "excel", "accounting", "microsoft", "using computer", "solidedge", "stocktaking", "sales", "sell", "calculating salaries"], "fulltext": "CV ỨNG TUYỂN \nVị trí: Kế toán  \nTHÔNG TIN CÁ NHÂN:     LÊ THỊ HƯỞNG \nNgày sinh: \n19/01/1990 \nNơi sinh: \nKhoái Châu – Hưng Yên \nQuốc tịch: \nViệt Nam \nGiới tính: \nNữ \nTình trạng hôn nhân: Đã kết hôn \nTrình độ đào tạo: \nĐại học \nĐịa chỉ: \nBạch Mai, HBT, HN \nMỤC TIÊU NGHỀ NGHIỆP: \n- Được làm việc trong môi trường chuyên nghiệp, gắn bó lâu dài với doanh \nnghiệp và có cơ hội thăng tiến trong công việc, \n- Tích lũy thêm nhiều kinh nghiệm cho công việc được hiệu quả và nhanh \nchóng \nTRÌNH ĐỘ CHUYÊN MÔN \n- Tốt nghiệp Khoa Tài chính Doanh nghiệp – Học viện Ngân hàng \n- Đạt loại: Khá \nKINH NGHIỆM LÀM VIỆC: \nTừ \ntháng \n8 \nnăm 2017 đến \nnay \nKế toán tổng hợp tại Công ty TNHH Xuất nhập khẩu Điện Máy \nDuy Tân \nCông việc chính: \n- Theo dõi, cập nhật, hạch toán những nghiệp vụ kinh tế phát \nsinh hàng ngày tại công ty.Quản lý hệ thống chứng từ, sổ sách \nlưu trữ kế toán theo quy đinh \n- Thực hiện kiểm tra tính chính xác, hợp lý, hợp lệ của các \nchứng từ, giấy tờ và thực hiện thanh toán cho nhà cung cấp. \n- Hàng ngày Theo dõi, đối chiếu thu hồi công nợ khách hàng.  \n- Giao dịch với ngân hàng và các cơ quan chức năng. \n- Lập báo cáo thuế GTGT, BCTC, TNCN, TNDN theo định kì \n- Hàng tháng lập báo cáo thu chi, lãi lỗ tháng theo yêu cầu của \nban lãnh đạo. \n- Thực hiện các công việc nội bộ khác của công ty theo yêu cầu \ncủa Ban Giám Đốc. \nTừ  tháng \n11/2014  đến \n07/2017   \n Kế toán tại trường Cao đẳng Asean \nCông việc chính: \n- Thu học phí sinh viên, theo dõi việc thu học phí của sinh viên \ncác lớp hệ cao đẳng. \n- Theo dõi và thanh toán phí thỉnh giảng cho giáo viên thỉnh \ngiảng \n- Kế toán và quản lý bán hàng Căng tin, hàng tháng lập báo cáo \nhoạt động căng tin báo cáo trực tiếp Chủ tịch \n- Hàng tháng tính lương, Bảo hiểm cho cán bộ nhân viên của \nnhà trường. Thực hiện các thủ tục giải quyết chế độ thai sản, \nốm đau cho cán bộ nhân viên nhà trường \n- Phụ trách nhận kế hoạch văn phòng phẩm của các khoa, \nphòng ban trong trường từ đó tổng hợp, mua văn phòng phẩm \nvà phân chia lại cho các phòng ban. \n- Tổng hợp và hoàn thiện sổ sách kế toán \n- Lên báo cáo tài chính quý, năm \nTừ 5/2013 đến \n10/2014 \nNhân viên kế toán công ty  TNHH Vinatech \nCông việc chính: \n- Tính lương cho nhân viên công ty \n- Giao dịch Ngân hàng theo yêu cầu \n- Tham gia kiểm tra, kiểm kê hàng hóa vào cuối mỗi tháng, quý \n- Theo dõi công nợ phải thu, công nợ phải trả của khách hàng \n- Làm báo cáo thuế hàng tháng, quý, năm \n- Làm các công việc được giao khác \nTừ 8/2012 đến \n3/2013 \nNhân viên kế toán Phòng Kế toán quỹ Tập đoàn Tân á Đại \nThành \nCông việc chính: \n- Lập phiếu thu chi tại quỹ tiền mặt, lập báo cáo quỹ tiền mặt \nhàng ngày, đối chiếu thu chi với thủ quỹ, các khoản tiền chi \nnhánh gửi về tổng công ty hàng ngày \n- Đối chiếu tài khoản tiền gửi, tiền vay; lập hồ sơ vay vốn ngân \nhàng \n- Nhập kho văn phòng phẩm, đồ dùng cần thiết trên tổng công \nty \n- Lưu trữ chứng từ, sổ sách kế toán theo quy đinh \nKĨ NĂNG: \n- Máy tính: sử dụng thành thạo  Microsoft office như word, excel, powpoint \n- Ngoại ngữ:   Đọc hiểu Tiếng Anh \n- Nhiệt tình, có trách nhiệm với công việc được giao và có khả năng làm \nviệc dưới áp lực và cường độ cao \nSỞ THÍCH: \n- Đọc sách,báo \n- Nghe nhạc \n- Đi du lịch cùng bạn bè, gia đình ", "educations": [{"id": 5573, "gpa": null, "major": "Tài chính – Ngân hàng", "school": "Học viện Ngân hàng", "diploma": "Bachelors", "end_time": null, "conf_score": 0.8237520863211427, "start_time": null, "picklist_major": "Finance/Investment", "major_categories": "Kinh doanh và quản lý", "major_categories_detail": "Tài chính – Ngân hàng – Bảo hiểm"}], "experiences": [{"id": 18601, "detail": "Công việc chính:\n- Theo dõi, cập nhật, hạch toán những nghiệp vụ kinh tế phát sinh hàng ngày tại công ty.Quản lý hệ thống chứng từ, sổ sách lưu trữ kế toán theo quy đinh\n- Thực hiện kiểm tra tính chính xác, hợp lý, hợp lệ của các chứng từ, giấy tờ và thực hiện thanh toán cho nhà cung cấp.\n- Hàng ngày Theo dõi, đối chiếu thu hồi công nợ khách hàng.\n- Giao dịch với ngân hàng và các cơ quan chức năng.\n- Lập báo cáo thuế GTGT, BCTC, TNCN, TNDN theo định kì\n- Hàng tháng lập báo cáo thu chi, lãi lỗ tháng theo yêu cầu của ban lãnh đạo.\n- Thực hiện các công việc nội bộ khác của công ty theo yêu cầu của Ban Giám Đốc.", "company": "Công ty TNHH Xuất nhập khẩu Điện Máy Duy Tân", "end_time": "2023-04-13T00:00:00Z", "industry": "Other", "position": "Kế toán tổng hợp", "conf_score": 0.8673821186853424, "start_time": "2017-01-01T00:00:00Z"}, {"id": 18602, "detail": "Công việc chính:\n- Thu học phí sinh viên, theo dõi việc thu học phí của sinh viên các lớp hệ cao đẳng.\n- Theo dõi và thanh toán phí thỉnh giảng cho giáo viên thỉnh giảng\n- Kế toán và quản lý bán hàng Căng tin, hàng tháng lập báo cáo hoạt động căng tin báo cáo trực tiếp Chủ tịch\n- Hàng tháng tính lương, Bảo hiểm cho cán bộ nhân viên của nhà trường. Thực hiện các thủ tục giải quyết chế độ thai sản, ốm đau cho cán bộ nhân viên nhà trường\n- Phụ trách nhận kế hoạch văn phòng phẩm của các khoa, phòng ban trong trường từ đó tổng hợp, mua văn phòng phẩm và phân chia lại cho các phòng ban.\n- Tổng hợp và hoàn thiện sổ sách kế toán\n- Lên báo cáo tài chính quý, năm", "company": "trường Cao đẳng Asean", "end_time": "2017-07-31T00:00:00Z", "industry": "Other", "position": "Kế toán", "conf_score": 0.9264139694127339, "start_time": "2014-11-01T00:00:00Z"}, {"id": 18603, "detail": "Công việc chính:\n- Tính lương cho nhân viên công ty\n- Giao dịch Ngân hàng theo yêu cầu\n- Tham gia kiểm tra, kiểm kê hàng hóa vào cuối mỗi tháng, quý\n- Theo dõi công nợ phải thu, công nợ phải trả của khách hàng\n- Làm báo cáo thuế hàng tháng, quý, năm\n- Làm các công việc được giao khác", "company": "công ty TNHH Vinatech", "end_time": "2014-10-31T00:00:00Z", "industry": "High Technology", "position": "Nhân viên kế toán", "conf_score": 0.9264139694127339, "start_time": "2013-05-01T00:00:00Z"}, {"id": 18604, "detail": "Công việc chính:\n- Lập phiếu thu chi tại quỹ tiền mặt, lập báo cáo quỹ tiền mặt hàng ngày, đối chiếu thu chi với thủ quỹ, các khoản tiền chi nhánh gửi về tổng công ty hàng ngày\n- Đối chiếu tài khoản tiền gửi, tiền vay; lập hồ sơ vay vốn ngân hàng\n- Nhập kho văn phòng phẩm, đồ dùng cần thiết trên tổng công ty\n- Lưu trữ chứng từ, sổ sách kế toán theo quy đinh", "company": "Kế toán quỹ Tập đoàn Tân á Đại Thành", "end_time": "2013-03-31T00:00:00Z", "industry": "Other", "position": "Nhân viên kế toán", "conf_score": 0.905449349642689, "start_time": "2012-08-01T00:00:00Z"}], "address": "Bạch Mai, Hbt, Hn"}