{"skills": ["management consulting", "implementation", "sales", "risks", "management", "project execution", "mobile application", "project management", "team management", "restructuring", "performance management", "insurance", "recruitment", "business goal", "business strategy", "accounting", "risk management", "sales activities", "operational risk", "innovative technology", "information management", "auditing", "agile"], "fulltext": "Edited with the trial version of \nFoxit Advanced PDF Editor\nTo remove this notice, visit:\nwww.foxitsoftware.com/shopping\nNGUYEN CHI THANH (Mr.) \nMobile phone:                          Email:  \n“Nothing is certain except for the need to have great people”. I believe the key for any business success is to \nmanage how organization works from a people and a culture perspective. Therefore, I always work to enhance \nand bring the best experience and values to my team, my clients, and community, to inspire confidence and \nempower for changes. I also believe good results must come from good processes. \nEducation background \n•\n2013: Project Management Professional (PMP), PMI, USA \n•\n2012: Bachelor’s degree in Accounting and Auditing, University of Economics HCMC \n•\n2011: Certified Information System Auditor (CISA), ISACA, USA \n•\n2007: Bachelor’s degree in Mathematics and Informatics, University of Natural Sciences HCMC \nOther training courses: Trusted Advisor; Fraud Risk Management; Investigation training; Advisory and \nConsulting Core Skills; Project Management; and Portfolio Management; Information Risk Management; and \nother Leadership training courses. \nEmployment history \nJune 2017 – present: KPMG Vietnam and Cambodia – Manager, Chairman and CEO’s Office \n-\nLeading business transformation project such as M&A, innovative technology, agile office, etc. to achieve \nbusiness goals and objectives. \n-\nFacilitating business strategy development and implementation with all Partners and management team. \n-\nFacilitating business planning and operations for all functions to ensure business strategy is aligned. \n-\nLeading Corporate Affairs. \n-\nLeading Corporate Citizenship and business sustainable development programs. \n-\nSample project: new digital platform (web + mobile application) for offering new services to clients \no\nLeading the business model from definition to execution, including market strategy and \noperations. \no\nLeading and leveraging the resource of other functional teams to implement project activities, \nincluding designer and technical developer teams. \no\nLeading and collaborating with suppliers / partners for the project execution. \no\nMonitoring the project and reporting to Chairman and CEO. \nJune 2016 – Jun 2017: KPMG Vietnam and Cambodia – Manager, People-Performance and Culture \n-\nLeading HR transformation from manual and administrative support to be more effective HR function as \nbusiness partners and consultants to close the function gaps and enable business strategy and vision. \n-\nLeading all people’s initiatives including but not limited to Employer branding, Recruitment, Training and \nDevelopment, People Engagement, and Performance Management. \n- \nLeading daily operations of People function (Recruitment, Learning and Development, Engagement). \nSeptember 2014 – May 2016: Prudential Vietnam Assurance – Compliance Manager \n- \nAssisting Head of Compliance to build the right compliance culture to enable business strategy, including \nawareness training programs and other initiatives. \n- \nDeveloping policies and control frameworks and oversight business operational risk related matters and key \ncompliance indicators (including operational risks indicators) \n- \nMaintaining controls to prevent, detect and investigate frauds from happening, and response to fraud \nincidents \n- \nPlanning and executing compliance reviews to provide reasonable assurance over daily operations to the \nManagements \n- \nConsulting and successor for Business Continuity and Information Risk Management Manager \nJuly 2008 – September 2014: KPMG Vietnam and Cambodia – Assistant Manager, Management \nConsulting \nProject Advisory services: \n- \nBuilding and maintaining client relationship, and performing pre-sale and sale activities \n- \nLeading and working with combined regional and local teams of professionals to market and deliver a range \nof advisory services to clients on business transformation programs and projects including business \nrestructuring, business processes improvement, risk management and new IT systems implementation and \nintegration across manufacturing, insurance, real estate, and retails industries. \nIT Assurance services: \n- \nWorking with Financial Audit teams to identify IT controls and assess IT environments to give reasonable \nassurance over the IT systems’ operations. \n- \nAdvise the management team for risk mitigation and controls improvements opportunities over current IT \nenvironment and system controls \nReferences (details as on request) ", "educations": [{"id": 5631, "gpa": null, "major": "Kế toán", "school": "University of Economics HCMC", "diploma": "Bachelors", "end_time": "2012-01-01T00:00:00Z", "conf_score": 0.7897513794629749, "start_time": null, "picklist_major": "Accounting", "major_categories": "Kinh doanh và quản lý", "major_categories_detail": "Tài chính – Ngân hàng – Bảo hiểm"}, {"id": 5632, "gpa": null, "major": "Toán tin", "school": "University of Natural Sciences HCMC", "diploma": "Bachelors", "end_time": "2011-01-01T00:00:00Z", "conf_score": 0.7761728190039863, "start_time": "2007-01-01T00:00:00Z", "picklist_major": "IT - Hardware/Networking", "major_categories": "Toán và thống kê", "major_categories_detail": "Toán học"}], "experiences": [{"id": 18829, "detail": "- Leading business transformation project such as M&A, innovative technology, agile office, etc. to achieve business goals and objectives.\n- Facilitating business strategy development and implementation with all Partners and management team.\n- Facilitating business planning and operations for all functions to ensure business strategy is aligned.\n- Leading Corporate Affairs. - Leading Corporate Citizenship and business sustainable development programs.\n- Sample project: new digital platform (web + mobile application) for offering new services to clients o\nLeading the business model from definition to execution, including market strategy and operations. o\nLeading and leveraging the resource of other functional teams to implement project activities, including designer and technical developer teams. o\nLeading and collaborating with suppliers / partners for the project execution. o\nMonitoring the project and reporting to Chairman and CEO.", "company": "KPMG Vietnam and Cambodia", "end_time": "2023-04-13T00:00:00Z", "industry": "Other", "position": "Manager, Chairman and CEO’s Office", "conf_score": 0.9174648511369632, "start_time": "2017-06-01T00:00:00Z"}, {"id": 18830, "detail": "Leading HR transformation from manual and administrative support to be more effective HR function as business partners and consultants to close the function gaps and enable business strategy and vision.\n- Leading all people’s initiatives including but not limited to Employer branding, Recruitment, Training and\nDevelopment, People Engagement, and Performance Management. - Leading daily operations of People function (Recruitment, Learning and Development, Engagement).", "company": "KPMG Vietnam and Cambodia", "end_time": "2017-06-30T00:00:00Z", "industry": "Other", "position": "Manager, People - Performance and Culture", "conf_score": 0.9091763759982866, "start_time": "2016-06-01T00:00:00Z"}, {"id": 18831, "detail": "- Assisting Head of Compliance to build the right compliance culture to enable business strategy, including awareness training programs and other initiatives.\n- Developing policies and control frameworks and oversight business operational risk related matters and key compliance indicators (including operational risks indicators)\n- Maintaining controls to prevent, detect and investigate frauds from happening, and response to fraud incidents\n- Planning and executing compliance reviews to provide reasonable assurance over daily operations to the\nManagements - Consulting and successor for Business Continuity and Information Risk Management Manager", "company": "Prudential Vietnam Assurance -", "end_time": "2016-05-31T00:00:00Z", "industry": "Insurance", "position": "Compliance Manager", "conf_score": 0.9147334378489395, "start_time": "2014-09-01T00:00:00Z"}, {"id": 18832, "detail": "Project Advisory services:\n- Building and maintaining client relationship, and performing pre-sale and sale activities\n- Leading and working with combined regional and local teams of professionals to market and deliver a range of advisory services to clients on business transformation programs and projects including business restructuring, business processes improvement, risk management and new IT systems implementation and integration across manufacturing, insurance, real estate, and retails industries.\nIT Assurance services:\n- Working with Financial Audit teams to identify IT controls and assess IT environments to give reasonable assurance over the IT systems’ operations.\n- Advise the management team for risk mitigation and controls improvements opportunities over current IT environment and system controls\nReferences (details as on request)", "company": "KPMG Vietnam and Cambodia", "end_time": "2014-09-30T00:00:00Z", "industry": "Other", "position": "Assistant Manager, Management Consulting", "conf_score": 0.9174648511369632, "start_time": "2008-07-01T00:00:00Z"}], "address": null}