{"skills": ["magento", "responsive", "javascript", "html", "frontend development", "wordpress", "css", "website development", "testing", "analysis", "jquery", "bigcommerce", "tester", "development testing", "reactjs", "implementation", "react native", "bootstrap"], "fulltext": "Contact\n+84 969005169 (Mobile)\nthienbuifrontend@gmail.com\nwww.linkedin.com/in/thien-bui- frontend  (LinkedIn)\nTop Skills\nFront-end Development\nMagento\nShopify\nThien Bui\nFront-End Developer\nSummary\nI have over a year of experience in front end web development\nwith strong knowledge in development working with IT industry,\nincluding research and analysis, design using Adobe Photoshop,\ndevelopment, testing, implementation of code and website, mobile\napp. \nSome of my key areas are HTML / CSS, JavaScript, Web/Mobile\nDevelopment, Reactive Native, React JS, Responsive design,\nTesting.\nAnd some of the frameworks I have experience are Magento2,\nWordpress, Shopify and Bigcommerce. I'm looking for new\nopportunities to broaden my knowledge, please feel free to contact\nme at thienbuifrontend@gmail.com.\nExperience\nWsoftpro\nFrontend Web Developer\nMay 2018 - Present \nHanoi\n- Have solid understanding of web fundamentals (HTML, CSS, JavaScript) and\nsome CMS such as Magento2, Wordpress, Shopify and BigCommerce, React\nNative, React JS.\n- Familiar with frameworks such as jQuery, Bootstrap.\n- Implement the web applications, mobile applications, and APIs based on\nReactJS, React Native, and Magento2.\n- Work with team of 6 or 7 people on several long term projects and\ncommunicate directly with customers, who are mostly from Asia Pacific,\nEurope and America, such as Icube (Indonesia), Moustache (New Zealand),\nZago Sweden. \n- Have responsibility to handle a whole project or small tasks, work well with\ntester and project manager to delivery to customer. \n- Estimate time, update progress for customers at the end of the day\nPage 1 of 2\n- Manage code and review code from other team members, support trainees to\nfollow work flow \nEducation\nHoa Binh University\nBachelors, Information Technology · (2015 - 2019)\nVietpro Academy\nBasic and Advanced in HTML, CSS & JavaScript\nProgramming  · (2018 - 2018)\nPage 2 of 2", "educations": [{"id": 5649, "gpa": null, "major": "Công nghệ thông tin", "school": "Hoa Binh University", "diploma": "Bachelors", "end_time": "2019-01-01T00:00:00Z", "conf_score": 0.917841109432358, "start_time": "2015-01-01T00:00:00Z", "picklist_major": "IT - Hardware/Networking", "major_categories": "Máy tính và công nghệ thông tin", "major_categories_detail": "Công nghệ thông tin"}, {"id": 5650, "gpa": null, "major": ", CSS & JavaScript\nProgramming", "school": "Vietpro Academy", "diploma": "Bachelors", "end_time": "2018-01-01T00:00:00Z", "conf_score": 0.873866977543044, "start_time": "2018-01-01T00:00:00Z", "picklist_major": "Other", "major_categories": "", "major_categories_detail": ""}], "experiences": [{"id": 18871, "detail": "Hanoi - Have solid understanding of web fundamentals (HTML, CSS, JavaScript) and some CMS such as Magento2, Wordpress, Shopify and BigCommerce, React Native, React JS. - Familiar with frameworks such as jQuery, Bootstrap. - Implement the web applications, mobile applications, and APIs based on\nReactJS, React Native, and Magento2. - Work with team of 6 or 7 people on several long term projects and communicate directly with customers, who are mostly from Asia Pacific, Europe and America, such as Icube (Indonesia), Moustache (New Zealand), Zago Sweden. - Have responsibility to handle a whole project or small tasks, work well with tester and project manager to delivery to customer.\n- Estimate time, update progress for customers at the end of the day\n- Manage code and review code from other team members, support trainees to follow work flow", "company": "Wsoftpro", "end_time": "2023-04-13T00:00:00Z", "industry": "Other", "position": "Frontend Web Developer", "conf_score": 0.8986425279419377, "start_time": "2018-05-01T00:00:00Z"}], "address": null}