{"skills": ["workflow", "internet", "payment", "internal audit", "marketing", "analytics", "futures", "implementation", "sales", "risks", "root cause analysis", "rest", "management", "resource planning", "excel", "banking", "administration", "business analysis", "market research", "equity", "finance", "analysis", "investments", "visualization", "data analysis", "market analysis", "medium", "business analyst", "accounting", "private equity", "microsoft project", "client management", "data visualization", "microsoft power bi", "microsoft", "communication skill", "google analytics", "process data", "database", "data management", "analyst", "math", "gms", "data collection", "microsoft excel"], "fulltext": "Contact\nTòa Nhà Handico Phạm Hùng,\nPhường Mễ Trì, Quận Nam Từ Liêm\n+84384791190 (Mobile)\nanh.nguyenlehoang@outlook.c om\nwww.linkedin.com/in/yingng (LinkedIn)\nAnh L. Nguyen\nCommercial Analyst/ Data Analyst\nSummary\n\"The only way to do great work is to love what you do.  If you haven't\nfound it yet, keep looking.  As with all matters of the heart,  you'll\nknow when you find it.\"\n• Summary:          \n- Native Vietnamese. Strong command of oral and written English,\nand a little Mandarin.\n- Strong interpersonal and communication skills; as such to build\nproductive internal relationships and to collaborate with others to\nachieve objectives and ensure information flow;\n- General knowledge of procedures and activities within own work\narea. Ability to relate actual day-to-day work to business priorities;\n- Focused on learning the key aspects and duties of the job being\nperformed;\n- Applies research, information gathering and analytical skills.\nHandles detailed, structured problems;\n- Works on assignments where judgment is required a majority of the\ntime;\n- Works under general direction, seeks assistance as needed;\n- Contributes to own team/closely related teams through quality and\naccuracy of own output;\n- Conveys information in a concise and professional manner;\n- Ability to drive root cause analysis to closure, interpret alternatives\nand present solutions;\n- Experience in managing multiple tasks and workflows;\n- Positive, self-starter, initiative-taker, eager to learn;\n- Ability to work under pressure and meet deadlines;\n- Ability to work both self-directed as well as part of a team;\n- Strong IT skills in Windows environment (Power BI, MS Word,\nExcel, Access, Powerpoint) and Google Analytics Tool;\n- Exposure to multidimensional reporting applications as well as\ngeneral ledger software.\n※ For more information, please visit: vn.linkedin.com/in/yingng/; or\nemail to hoanganhnguyen3110@gmail.com\nTop Skills\nData Analysis\nMicrosoft Power BI\nMicrosoft Project\nLanguages\nChinese  (Elementary)\nEnglish (Full Professional)\nVietnamese (Native or Bilingual)\nPage 1 of 6\nExperience\nFortna\nResource Specialist/ Data analysis\nAugust 2017 - Present \nVietnam\n1. Resource planning and management\n• On an ongoing basis, reconcile projected resources and projects.\n• Maintain and reconcile current and projected projects in Project Online.\n• Support technical issues in Project Online.\n• Provide project team resource planning.\n• Develop & implement strategic approach to improve the effectiveness &\naccuracy of resource planning.\n• QA Plan\n• Templates on based on opportunity (Example: Greenfield DC has one\ntemplate and Retro DC has another) \n• Metric – need to document and process out for the rest of PSO \n• Make sure regularly that all resource planning data is accurate. \n• Data visualization by Microsoft Excel and Power BI \n2. Cost Alignment and Execution\n• Staff smaller and more flexible project teams\n• Utilize Athletic resources who can spread across multiple projects to\nmaximize utilization.\n• Support proper change control process to assess impact of project changes\nin scope, schedule, budget and resource requirements.\n• Provide updates through a Project Online Site (SAP)\n• Metric – \n Bi-Monthly Data Collection and analysis on: \n• Team Size to project \n• Feedback from PSO Leadership/Sales Leadership on Effective WP Planning\nrelative to resources \nSkill required: Microsoft Excel, Power BI, time management, data process\nunderstanding\nGrant Thornton Vietnam\nBusiness Analyst\nOctober 2014 - January 2017 (2 years 4 months)\nHo Chi Minh City, Vietnam\nPage 2 of 6\n■ Business Analysis:\n- Market research: in-depth research information about the market, clients,\nindustry etc. in order to obtain critical data for develop marketing solutions;\ncurious to learn more about the sectors in which the company specialises such\nas communications, content creation, professional services and more;\n- Applies research, information gathering and analytical skills. Handles\ndetailed, structured problems;\n- Contributes to own team/closely related teams through quality and accuracy\nof own output;\n- Conveys information in a concise and professional manner;\n- Collaborate with Marketing & Sale team in building budget annually; to\nsupport other departments to ensure budget/ rivision process with require\naccurate data and information;\n- To support Internal Control process implementation: Prepare, develop and\nanalyze Internal Audit reports, key performance indicators (KPI) for the Firm,\nidentify trends and exceptions for management’s review;\n- Compile data for monthly GM analysis;\n- Review strategy and investment effectiveness of business unit for\nimprovement;\n- Evaluate business performance by benchmarking;\n- Monitor Sales performance by preparing weekly and monthly reports;\n- Assist in conducting the Client Satisfaction survey, Private Equity survey,\nPublic Sector survey; \n■ Administration:\n- Track key data and insights for the business, and to maintain an up-to-date\nand accurate database of financial information used by the team to support\nclient management and acquisition;\n- Prepare documents and presentation in clients meeting and workshops;\n- Arrange meetings within the team and clients;\n- Assist in preparation of Proposals;\n- Any other ad-hoc assignments and special projects requested by Superiors.\nANZ\nStudent Internship\nFebruary 2014 - April 2014 (3 months)\nHo Chi Minh city\nCommercial Banking Team\n•Collect all kinds of bills and check the amount of final payment\nPage 3 of 6\n•Write meeting minutes after having a staff meeting\n•Prepare bank sheet for a transfer\n•Make payment receipt and keep it in folder for internal use\n•Bookeeping\n•Reading and spreading data on financial reports\n•Generate risk reports based on financial reports\n•Financial Math calculation\n•Portfolio management\nRMIT Japan Culture Club\nUniversity working experience: Account Executive\nOctober 2013 - January 2014 (4 months)\nAt JCC, I work as Account planner (Program department) and Online media\ncontroller. As an Account Planner, my responsibility includes:\n• Working in group with other members to create activities for club’s operation\n(at least for 3-semesters)\n• Working with Chief Accountant to devise events/workshops that meets the\nschool’s brief and budget\n• Checking and reporting on the events' progress.\n• Conducting reports to Project Manager the club activities\nand as an Online media controller, mine consists of;\n- Keeping all information about JCC is up-dated  and understanding for all\nviewers\n- Internet searching:\n• Looking for information of projects, businesses academic opportunities\nrelated to Japanese, for example MEXT scholarship or job fairs’ information\nhold by Consulate General of Japan in Ho Chi Minh City\n• Looking around for any Japanese events at Ho Chi Minh city\n- News scanning:\n• Listing the main topic of news a day.\n• Making summary of news from local, international.\nRMIT Film Society The Ticket\nUniversity Working Experience: Executive Board - External\nCoordianator\nOctober 2012 - June 2013 (9 months)\n702 Nguyen Van Linh District 7 Tan Phong Ward Ho Chi Minh City\nPage 4 of 6\nThe Ticket was founded in June 2011 by Paul Smith (B. Design), Madeleine\nMorris (B. Design), Melanie Casul (B. Professional Communication), Christian\nBerg (B. Profesional Communication), and Khoa Nguyen (B. Design).\nThe Ticket is not just about watching good movies. It’s about understanding\nhow they affect us, how different cultures understand stories differently, how\nthe context in which films are viewed plays a large part in our experience of\nthem. Each week, the nominator of the film gives a short introductory talk.\nThen the film is screened, and a post-viewing discussion is held. Discussions\nhosted by The Ticket range all the way from from historical contexts, fiction vs\nnon-fiction and how humans are portrayed in film to the technical aspects of\nfilm-making, production and financing.\nIn The Ticket, I work as an External Coordinator. As an External coordinator,\nI worked with both the external factors (such as RMIT staffs, Student Council,\npeople from Film Industry, sponsors, suppliers, etc) and within the Film Society\nsuch as Film department and PR & Marketing department. Moreover, this\nposition is responsible for making plans and calculate the budget for any plan\ninvolving external resources (each semester), submit those plans to the Head\nof Executive to get approval; and making deals with other departments to\ncontrol all processes are in the right way.After each project/event, the external\ncoordinator must conduct reports to compare between actual expenditure and\nbudgeted plans in order to judge the efficiency of those.\n• Skills needed for this position could be useful for future career such as PR,\nChief of Finance, Chief of Accountancy, Cost manager.\nHoa Hoc Tro magazine\nPart-time Administration staff\nOctober 2006 - March 2007 (6 months)\n•News scanning:\n-Listing the main topic of news a day.\n-Making summary of news from local, international.\n•Internet searching:\n-Looking for (highlight) information of youth trend (ex. fashion, eating location,\netc)\n-Looking around for any exhibitions or events.\n•Collect all kinds of bills (ex. rent car, subscription, photocopy, stationary bills\netc.) and check the amount of final payment.\nPage 5 of 6\n•Check the condition of equipment (ex. ink refill of color printer & photocopy,\npaper shredder etc.).\n•Write meeting minutes after having staff meetings.\nEducation\nRMIT University\nBachelor of Commerce (BCom, BCA), Accounting and Finance · (2010 - 2013)\nPage 6 of 6", "educations": [{"id": 5659, "gpa": null, "major": "Kế toán", "school": "RMIT University", "diploma": "Bachelors", "end_time": "2013-01-01T00:00:00Z", "conf_score": 0.7625990117186952, "start_time": "2010-01-01T00:00:00Z", "picklist_major": "Accounting", "major_categories": "Kinh doanh và quản lý", "major_categories_detail": "Tài chính – Ngân hàng – Bảo hiểm"}], "experiences": [{"id": 18897, "detail": "Vietnam 1. Resource planning and management\n• On an ongoing basis, reconcile projected resources and projects.\n• Maintain and reconcile current and projected projects in Project Online. • Support technical issues in Project Online. • Provide project team resource planning.\n• Develop & implement strategic approach to improve the effectiveness & accuracy of resource planning.\n• QA Plan • Templates on based on opportunity (Example: Greenfield DC has one template and Retro DC has another)\n• Metric - need to document and process out for the rest of PSO • Make sure regularly that all resource planning data is accurate.\n• Data visualization by Microsoft Excel and Power BI 2. Cost Alignment and Execution • Staff smaller and more flexible project teams\n• Utilize Athletic resources who can spread across multiple projects to maximize utilization.\n• Support proper change control process to assess impact of project changes in scope, schedule, budget and resource requirements.\n• Provide updates through a Project Online Site (SAP) • Metric - Bi-Monthly Data Collection and analysis on:\n• Team Size to project\n• Feedback from PSO Leadership/Sales Leadership on Effective WP Planning relative to resources\nSkill required: Microsoft Excel, Power BI, time management, data process understanding", "company": "Fortna", "end_time": "2023-04-13T00:00:00Z", "industry": "Other", "position": "Resource Specialist/ Data analysis", "conf_score": 0.9174648511369632, "start_time": "2017-08-01T00:00:00Z"}, {"id": 18898, "detail": "(2 years 4 months)\nHo Chi Minh City, Vietnam ■ Business Analysis: - Market research: in-depth research information about the market, clients, industry etc. in order to obtain critical data for develop marketing solutions; curious to learn more about the sectors in which the company specialises such as communications, content creation, professional services and more;\n- Applies research, information gathering and analytical skills. Handles detailed, structured problems;\n- Contributes to own team/closely related teams through quality and accuracy of own output;\n- Conveys information in a concise and professional manner;\n- Collaborate with Marketing & Sale team in building budget annually; to support other departments to ensure budget/ rivision process with require accurate data and information;\n- To support Internal Control process implementation: Prepare, develop and analyze Internal Audit reports, key performance indicators (KPI) for the Firm, identify trends and exceptions for management’s review;\n- Compile data for monthly GM analysis;\n- Review strategy and investment effectiveness of business unit for improvement;\n- Evaluate business performance by benchmarking;\n- Monitor Sales performance by preparing weekly and monthly reports;\n- Assist in conducting the Client Satisfaction survey, Private Equity survey,\nPublic Sector survey;\n■ Administration: - Track key data and insights for the business, and to maintain an up-to-date and accurate database of financial information used by the team to support client management and acquisition;\n- Prepare documents and presentation in clients meeting and workshops;\n- Arrange meetings within the team and clients;\n- Assist in preparation of Proposals; - Any other ad-hoc assignments and special projects requested by Superiors.", "company": "Grant Thornton Vietnam", "end_time": "2017-01-31T00:00:00Z", "industry": "Non-banking", "position": "Business Analyst", "conf_score": 0.9125776658202421, "start_time": "2014-10-01T00:00:00Z"}, {"id": 18899, "detail": "Team •Collect all kinds of bills and check the amount of final payment\n•Write meeting minutes after having a staff meeting\n•Prepare bank sheet for a transfer\n•Make payment receipt and keep it in folder for internal use\n•Bookeeping •Reading and spreading data on financial reports\n•Generate risk reports based on financial reports\n•Financial Math calculation\n•Portfolio management", "company": "ANZ", "end_time": "2014-04-30T00:00:00Z", "industry": "Other", "position": "Student Internship", "conf_score": 0.885168676428609, "start_time": "2014-02-01T00:00:00Z"}, {"id": 18900, "detail": ", my responsibility includes:\n• Working in group with other members to create activities for club’s operation (at least for 3-semesters)\n• Working with Chief Accountant to devise events/workshops that meets the school’s brief and budget\n• Checking and reporting on the events' progress.\n• Conducting reports to Project Manager the club activities and as an Online media controller, mine consists of;\n- Keeping all information about JCC is up-dated and understanding for all viewers\n- Internet searching:\n• Looking for information of projects, businesses academic opportunities related to Japanese, for example MEXT scholarship or job fairs’ information hold by Consulate General of Japan in Ho Chi Minh City • Looking around for any Japanese events at Ho Chi Minh city\n- News scanning:\n• Listing the main topic of news a day.\n• Making summary of news from local, international.", "company": "JCC", "end_time": "2014-01-31T00:00:00Z", "industry": "Other", "position": "Account Executive", "conf_score": 0.878473915117935, "start_time": "2013-10-01T00:00:00Z"}, {"id": 18901, "detail": "(9 months)\n702 Nguyen Van Linh District 7 Tan Phong Ward Ho Chi Minh City", "company": "RMIT Film Society", "end_time": "2013-06-30T00:00:00Z", "industry": "High Technology", "position": "Executive Board - External Coordianator", "conf_score": 0.882548939924795, "start_time": "2012-10-01T00:00:00Z"}, {"id": 18902, "detail": "Hoa Hoc Tro magazine\nPart-time Administration staff\nOctober 2006 - March 2007 (6 months)\n•News scanning:\n-Listing the main topic of news a day.\n-Making summary of news from local, international.\n•Internet searching:\n-Looking for (highlight) information of youth trend (ex. fashion, eating location, etc)\n-Looking around for any exhibitions or events.\n•Collect all kinds of bills (ex. rent car, subscription, photocopy, stationary bills etc.) and check the amount of final payment.\n•Check the condition of equipment (ex. ink refill of color printer & photocopy, paper shredder etc.).\n•Write meeting minutes after having staff meetings.", "company": "Hoa Hoc Tro magazine", "end_time": "2007-03-31T00:00:00Z", "industry": "Other", "position": "External Coordinator", "conf_score": 0.8815343973703126, "start_time": "2006-10-01T00:00:00Z"}], "address": "Tòa Nhà Handico Phạm Hùng, Phường Mễ Trì, Quận Nam Từ Liêm"}