{"skills": ["facebook insights", "digital marketing", "class", "pop", "digital entertainment", "marketing", "analytics", "sales and marketing", "le", "implementation", "facebook analytics", "sales", "public speaking", "medium", "management", "studio", "google analytics"], "fulltext": "BUI NGOC THUY LINH\nDeputy Director Of Sale Departerment\nEducation\nHo Chi Minh City University of Economics [Sep 2013 -\nMay 2017]\nMajor: Marketing\nGPA : 7.53\nContact information\nAugust 22, 1994\n(+84)96 929.9294\nthuylinh.0894@gmail.com\nHo Chi Minh, Vietnam\nWork experience\nBUiM Group [August 2019 - Now]\nDeputy Director of Marketing Department\nBUiM Group enables businesses to exchange ideas,\nknowledge and experience through international industrial\nconferences, seminars, workshops, training programs and\nB2B communications.\n- Manage and Control sale team achieving sale target, sale\nbudget and sale plan : Sale volume, Revenue and Gross\nprofit, suggests appropriate improvements to sale executives\n- Support to SM to establish job ọbjectives, planning,\nmonitoring, appraising, and reviewing job contributions;\n- Supervising, coaching, training, orienting, supporting and\nevaluating all Sales staffs (Include Internal and external\nsections).\n- Explore potential customers and market \n- Build, develop cooperation with partners , generate\ncustomer source; \n- Direct, review and proceed activities in Sales and Marketing\nDepartment; \n- Monitor customer preferences to determine focus of Sales\nefforts; Take care of key-clients\n- Advise dealers on company policies and operating\nprocedures to ensure the effectiveness of business\n- Represent company at trade association meeting to\npromote products\nEligraphics JSC Company [Dec 2017 - Jun 2019]\nMarketing Manager\nEligraphics is the first world-class animation studio in\nVietnam. We started out as a service company. Since 2013,\nEligraphics has shifted focus to producingour own IP -\n‘Planet Z’ and ‘Eli Kids’, targeting traditional media as well as\ndigitalplatforms, with the financial backing of Elinext Group.\nMarketing Manager  has responsibilies to contribute a\nCertifications\nTOEIC Certificate with score 600\n[2019]\nYoutube Certified [2016]\nTopik Certificate Korean 3 [2019]\nSkills\nOffice\nLogical thinking and\ncreative\nPublic Speaking\nWriting\nReferences\nVo Hoai Nhon\nDirector of MKT Team\nEmail: hoainhonvo@gmail.com\nMobile: (+94)98 3696 913\nLe Kim Yen\nLeader of MKT Team\nEmail: kimyenle0202@gmail.com\nMobile: (+94)90 8811 199\ncommunity for company on social network in order to viral\ntheirs digital products.\n- Responsible for developing strategies and planning for\neach film release\n- Do SEO to optimize to website, social media\n- Run Ads, do ads optiminzation, google ads\n- Analyze data from Google Analytics, facebook insight\n- Buid and Oversee the social media channel\n- Responsible for the planning and implementation of\nmarketing campaigns for film projects, including advertising,\nPR and events, media and other digital marketing activities; \n- Develop and establish a relationship with partner \n- Management and distribution operating revenue of\nchannels - Responsible for the development and\nimplementation of the criteria of revenues and expenses\nhave been approved by CEO; \n- To monitor, synthesize and analyze market revenue\ndistribution; \n- Support the marketing team in the implementation process\nof promoting the film; \n- Responsible for building a team strong and proactive team\nwork.\nCát Tiên Sa Media Company [May 2017 - Nov 2018]\nContent Creator & Social Media Leader\nCat Tien Sa is a company that specializes in organizing\nevents and television programs, dealing in advertising\nservices and specializing in the production of films and\ntelevision series..\n- Manage FB Fanpages, Google Plus Page, Zalo Page, IG\nPage\n- Analytic Performence of Social Platform\n- Plan and Report Ad - hoc Campaign\n- Experience and Expand new Social Platform\n- Plan and Report FB Mini Game\n- Report Violent Contents/ Trademask\n- Writing scripts and editing content for social\n- Design picture and video editing for viral content \n- Using Digital Marketing Tool\nPOPS WorldWide [April 2016 - May 2017]\nCommunity & Media Executive\nPOPS Worldwide is the leading digital entertainment\ncompany in Southeast Asia with operations. The POPS\nNetwork works with over 1,500 content partners from all over\nthe world. The top digital stars, musicians, production\ncompanies, TV broadcasters and content owners have made\nPOPS Worldwide their partner of choice.\nCommunity & Media Executive has responsibilies to\ncontribute a community for POPS Audience on social\nnetwork in order to viral theirs digital products\n- Manage FB Fanpages, Google Plus Page, Zalo Page, IG\nPage\n- Analytic Performence of Social Platform\n- Plan and Report Ad - hoc Campaign\n- Experience and Expand new Social Platform\n- Plan and Report FB Mini Game\n- Report Violent Contents/ Trademask\n- Using Digital Marketing Tool\nGoal: Experience how to viral video content on Social\nNetwork.\nYAN Live [April 2013 - August 2014]\nEvent Staff\nYAN Live is the international and local expert eventers as\nwell as network of not only local but also international artists,\nhas organized successfully more than 50 diversified\nentertainment events, ranging from corporate events, music\nconcert, themed parties indoor and outdoor to launch events\nof leading brands. \n- Manage and support artists before and during events\n- Supervison backstage area\n- Support team to manage sound equipment\n- Recruit and manage volunteers for event\nGoal: Knowledge about backstage and event operation skill\nYAN TV [Dec 2014 - Mar 2015]\nSocial Media Executive\nYAN TV - The leading youth channel. YAN TV was officially\nlaunched in Jun 2009. It currently reaches over 5 million\nhousehold in all major cities and provinces nationwide.\nYANTV's overall platform combines on-air, online, mobile and\non-the-ground elements.\n- Manage Fanpage and Create Content for YANTV, YAN\nNEWS, Bí Kíp Yêu \n- Report Weekly Performance of Page for Leader\nGoal: Fanpage Management\n© topcv.vn", "educations": [{"id": 5668, "gpa": "7.53", "major": "Marketing", "school": "Ho Chi Minh City University of Economics", "diploma": "Bachelors", "end_time": "2017-05-01T00:00:00Z", "conf_score": 0.7989900928703364, "start_time": "2013-09-01T00:00:00Z", "picklist_major": "Marketing", "major_categories": "Kinh doanh và quản lý", "major_categories_detail": "Kinh doanh"}], "experiences": [{"id": 18942, "detail": "BUiM Group enables businesses to exchange ideas, knowledge and experience through international industrial conferences, seminars, workshops, training programs and\nB2B communications.\n- Manage and Control sale team achieving sale target, sale budget and sale plan : Sale volume, Revenue and Gross profit, suggests appropriate improvements to sale executives\n- Support to SM to establish job ọbjectives, planning, monitoring, appraising, and reviewing job contributions;\n- Supervising, coaching, training, orienting, supporting and evaluating all Sales staffs (Include Internal and external sections).\n- Explore potential customers and market\n- Build, develop cooperation with partners , generate customer source;\n- Direct, review and proceed activities in Sales and Marketing Department; - Monitor customer preferences to determine focus of Sales efforts; Take care of key-clients\n- Advise dealers on company policies and operating procedures to ensure the effectiveness of business\n- Represent company at trade association meeting to promote products", "company": "BUiM Group", "end_time": "2023-04-13T00:00:00Z", "industry": "Other", "position": "Deputy Director of Marketing Department", "conf_score": 0.9436608569184953, "start_time": "2019-08-01T00:00:00Z"}, {"id": 18943, "detail": "Eligraphics is the first world-class animation studio in\nVietnam. We started out as a service company. Since 2013, Eligraphics has shifted focus to producingour own IP - ‘Planet Z’ and ‘Eli Kids’, targeting traditional media as well as digitalplatforms, with the financial backing of Elinext Group. Marketing Manager has responsibilies to contribute a community for company on social network in order to viral theirs digital products.\n- Responsible for developing strategies and planning for each film release\n- Do SEO to optimize to website, social media\n- Run Ads, do ads optiminzation, google ads\n- Analyze data from Google Analytics, facebook insight\n- Buid and Oversee the social media channel\n- Responsible for the planning and implementation of marketing campaigns for film projects, including advertising,\nPR and events, media and other digital marketing activities;\n- Develop and establish a relationship with partner\n- Management and distribution operating revenue of channels - Responsible for the development and implementation of the criteria of revenues and expenses have been approved by CEO; - To monitor, synthesize and analyze market revenue distribution;\n- Support the marketing team in the implementation process of promoting the film;\n- Responsible for building a team strong and proactive team work.", "company": "Eligraphics JSC Company", "end_time": "2019-06-30T00:00:00Z", "industry": "Other", "position": "Marketing Manager", "conf_score": 0.9542271074073599, "start_time": "2017-12-01T00:00:00Z"}, {"id": 18944, "detail": "Cat Tien Sa is a company that specializes in organizing events and television programs, dealing in advertising services and specializing in the production of films and television series..\n- Manage FB Fanpages, Google Plus Page, Zalo Page, IG Page - Analytic Performence of Social Platform - Plan and Report Ad - hoc Campaign - Experience and Expand new Social Platform - Plan and Report FB Mini Game - Report Violent Contents/ Trademask - Writing scripts and editing content for social\n- Design picture and video editing for viral content\n- Using Digital Marketing Tool", "company": "Cát Tiên Sa Media Company", "end_time": "2018-11-30T00:00:00Z", "industry": "Other", "position": "Content Creator & Social Media Leader", "conf_score": 0.9623457881619946, "start_time": "2017-05-01T00:00:00Z"}, {"id": 18945, "detail": "POPS Worldwide is the leading digital entertainment company in Southeast Asia with operations. The POPS Network works with over 1,500 content partners from all over the world. The top digital stars, musicians, production companies, TV broadcasters and content owners have made\nPOPS Worldwide their partner of choice.\nCommunity & Media Executive has responsibilies to contribute a community for POPS Audience on social network in order to viral theirs digital products\n- Manage FB Fanpages, Google Plus Page, Zalo Page, IG Page - Analytic Performence of Social Platform - Plan and Report Ad - hoc Campaign - Experience and Expand new Social Platform - Plan and Report FB Mini Game - Report Violent Contents/ Trademask - Using Digital Marketing Tool Goal: Experience how to viral video content on Social Network.", "company": "POPS WorldWide", "end_time": "2017-05-31T00:00:00Z", "industry": "Other", "position": "Community & Media Executive", "conf_score": 0.9542271074073599, "start_time": "2016-04-01T00:00:00Z"}, {"id": 18946, "detail": "It currently reaches over 5 million household in all major cities and provinces nationwide.\nYANTV's overall platform combines on-air, online, mobile and on-the-ground elements.\n- Manage Fanpage and Create Content for YANTV, YAN NEWS, Bí Kíp Yêu - Report Weekly Performance of Page for Leader Goal: Fanpage Management", "company": "YAN TV", "end_time": "2015-03-31T00:00:00Z", "industry": "Other", "position": "Social Media Executive", "conf_score": 0.8840435012249193, "start_time": "2014-12-01T00:00:00Z"}, {"id": 18947, "detail": "YAN Live is the international and local expert eventers as well as network of not only local but also international artists, has organized successfully more than 50 diversified entertainment events, ranging from corporate events, music concert, themed parties indoor and outdoor to launch events of leading brands.\n- Manage and support artists before and during events\n- Supervison backstage area\n- Support team to manage sound equipment\n- Recruit and manage volunteers for event\nGoal: Knowledge about backstage and event operation skill", "company": "YAN Live", "end_time": "2014-08-31T00:00:00Z", "industry": "Other", "position": "Event Staff", "conf_score": 0.9542271074073599, "start_time": "2013-04-01T00:00:00Z"}], "address": "Ho Chi Minh, Vietnam"}