{"skills": ["payment", "logistics planning", "sales", "management", "excel", "banking", "reds", "leadership skill", "customs clearance", "commodities", "communication skill", "contract terms", "problem solving skill", "derivatives", "teamwork", "outbound logistics", "problem solving", "people management", "freight forwarding"], "fulltext": "RESUME \nFull name \n: \nNGUYEN PHUONG HANH \nDate of Birth \n: \n07 Dec. 1981 \nPlace of Birth \n: \n HANOI \nGender  :  Female \nMobil Phone \n: \n0984109876 \nMarital Status \n: \nMarried \nPermanent Address \n  : \nC14.2 Phu Hoang Anh Apartment, Nguyen Huu Tho  \nStr., Phuoc Kien, Nha be District, HCMC \nEmail \n: \nphuonghanh71281@gmail.com \nHighlights: \nForeign Trade University HCMC – Graduated in 2004 \n15 years in Export Fields including Logistic and Customer Service \nGood Problem Solving Skill \nGood Team Leader \nOutbound Execution Supervisor \nLouis Dreyfus Company \nDec 2012 – Present (6 years 6 months) \nTraffic execution Officer  \nSucafina S.A. \nMay 2007 – July 2012 (5 years 2 months) \nSea Export Dept. – Customer Service \nSDV VIETNAM \nJuly 2005 – Apr 2007 (1 year 10 months) \nSea Export Dept. – Customer Service \nTRIMAX LOGISTICS JOINT VENTURE COMPANY \nSep 2003 – Jun 2005 (1 year 9 months) \nSep 2015 – Present \nLOUIS DREYFUS COMPANY VIETNAM TRADING AND PROCESSING CO., LTD \n** Outbound Execution Supervisor \nBesides tasks as an Outbound Execution Officer mentioned below, I take more responsibilities \nas followed: \nGeneral Responsibility: Be in charge of outbound logistics team \nPage 1 of 3 \nRESUME – NGUYEN PHUONG HANH \n \nDaily download list of new contracts from system and assign to each member.  \n \nSupervise team to avoid any delay or problem. \n \nSend weekly report to manager by recapping all the status of contracts, keep her updated about all \narising problem. \n \nSolve all matter relating to pre-shipment sample, booking space with shipping line, claim from \nclient for damaged goods. \n \nBe the team leader, I manage, build and retain the best team by establishing the team goals, \nassigning tasks to members, coaching new member, making year-end performance review. \nThrough that I can understand the competencies of people and know what can motivate them. \nAchievements: \n \nTake the key role in the logistics process for assigned customers. \n \nGained much knowledge of logistics planning and execution. \n \nManagerial role was improved when managing a team of 3 peoples. \nDec 2012 – Aug 2015 \nLOUIS DREYFUS COMPANY VIETNAM TRADING AND PROCESSING CO., LTD \n** Outbound Execution Officer \nGeneral Responsibility: Handle all Sales & Purchases contracts – make sure they are executed \ncomply with all contract term & conditions. \n \nWork as Representative office for parent company when the goods are allocated from Bonded \nwarehouse, work with local manufacturers for shipping schedule, shipping details and send \nthem shipping instructions and receive full sets of shipping documents to send to consignees. \n \nWork as Local company when allocate good from Non-bonded warehouse, follow production \nplan from warehouse to arrange shipment schedule, send them stuffing instruction. \n \nFollow up export shipments from getting contract from system until the goods arrives at \ndestination on time in full (OTIF).  \n \nMake sure the export shipping documents including custom declaration, Bill of lading, Certificate \nof origin from Vietnam Chamber of Commerce and Industry & other documents such as \nPhytosanitary certificate, Fumigation Certificate, Weight, Quality, Health certificate is always \nissued correctly and in a timely manner. \n \nSolve logistics issue (if any).  \n \nIssue commercial invoice, send payment request and follow up with customers for payment \naccording to signed contract. \n \nSend shipment advice, full set of docs to clients by email/ courier. \n \nGenerate monthly report of claim for weight loss, damaged goods \nMay 2007 – Jul 2012 \nSUCAFINA S.A. REP. OFFICE VIETNAM (Trading Coffee Company) \n** Traffic execution Officer        \nGeneral Responsibility:  \n \nCoordinate with Geneva main office to follow up shipments from South America to Europe & \ndeliveries from Europe warehouse to client. \n \nClosely communicate with relevant parties such as clients in Europe, shipper in origins, broker, \nbanks, shipping line and warehouses … \nDaily works: \n \nDaily checking new contracts from system online.  \n \nFollow up pre-shipment sample, sample for approval \n \nSend shipping instructions to shippers and follow up when the goods are shipped. \n \nReceive and check original documents, approve and make payment. \n \nSend landing instruction to warehouse to store the goods. \n \nCoordinate with Europe warehouses to follow up shipments, deliveries, coffee in/ out warehouses \n \nPrepare all documents for delivery/ release of goods, customs clearance and arrangement of \nmoving goods between warehouses  \n \nCheck stock reports from all warehouses in Vietnam and Europe every month \n \nSolve problems relating to claims (such as short landed, stained bag, slack bags …) \n \nIssue commercial invoice and follow up payment. \n \nCheck position of all goods every week; report to manager the status of all purchases/sales. \nPage 2 of 3 \nRESUME – NGUYEN PHUONG HANH \nJuly 2005 – Apr 2007 \nSDV VIETNAM (Freight Forwarding Company) \n** Sea Export Customer Service \nGeneral Responsibility: Handle all Sea Export shipments. \nDaily works: \n \nWork with local customer every day, keep the informed about the status of shipments. \n \nWork with shipping line to getting the best rate, best booking and OBL. \n \nMake customer satisfy by giving them all information about the transit time, the status of container. \n \nIssue the House Bill of lading, invoice to client. \nJuly 2005 – Apr 2007 \nTRIMAX LOGISTICS JOINT VENTURE COMPANY (Freight Forwarding Company) \n** Sea Export Customer Service \nGeneral Responsibility: Responsible for handling Sea Export shipments \nDaily works: \n \nContact shipping lines for freight quotation, booking, submit OBL, tracking containers. \n \nFollow up the shipment; keep client updated about information of the shipment’s status. \n \nDeal with all complains from customer relating to late delivery, rollover at transit port, damaged \ngoods…and other potential problems. \n \nIssue red invoices to clients and follow up the payment process. \n Leadership skill \n Communication skill \n People management skill \n Interpersonal and organizing skill \n Coaching skill. \n Quick learning and logical thinking. \n Commitment \n Business mind-set \n Good at English. \n Teamwork  \n Derivative course for commodities – 2013 by Banking University HCMC \n Fundamentals of people management – 2017 by Louis Dreyfus Company \n Influencing Others and High Collaboration – 2018 by Professional Trainer Nguyen Ha Dong from Seed Company \n Advanced Excel Course – 2018 by The University of Science HCM \n Problem Solving Skill Course – 2019 by Professional Trainer Nguyen Ha Dong from Seed Company \n Louis Dreyfus Company – Ms Thảo Nguyễn – Trading Assistant – 0961816809 \n Sucafina S.A – Ms Nguyệt Hồ - Former Logistics Manager – 0918044462 \n Trimax – Ms Huyền Nguyễn – Former Customer Service staff - 0903880489 \nPage 3 of 3 \nRESUME – NGUYEN PHUONG HANH ", "educations": [{"id": 5683, "gpa": null, "major": "Tiếng Việt và văn hóa Việt Nam", "school": "Foreign Trade University HCMC", "diploma": "Bachelors", "end_time": "2004-01-01T00:00:00Z", "conf_score": 0.7090835962781957, "start_time": null, "picklist_major": "Other", "major_categories": "Nhân văn", "major_categories_detail": "Ngôn ngữ, văn học và văn hóa Việt Nam"}], "experiences": [{"id": 19000, "detail": "Besides tasks as an Outbound Execution Officer mentioned below, I take more responsibilities as followed:\nGeneral Responsibility: Be in charge of outbound logistics team\nDaily download list of new contracts from system and assign to each member.\nSupervise team to avoid any delay or problem.\nSend weekly report to manager by recapping all the status of contracts, keep her updated about all arising problem.\nSolve all matter relating to pre-shipment sample, booking space with shipping line, claim from client for damaged goods.\nBe the team leader, I manage, build and retain the best team by establishing the team goals, assigning tasks to members, coaching new member, making year-end performance review.\nThrough that I can understand the competencies of people and know what can motivate them.\nAchievements: Take the key role in the logistics process for assigned customers.\nGained much knowledge of logistics planning and execution.\nManagerial role was improved when managing a team of 3 peoples.", "company": "LOUIS DREYFUS COMPANY VIETNAM TRADING AND PROCESSING CO., LTD", "end_time": "2023-04-13T00:00:00Z", "industry": "Trade", "position": "Outbound Execution Supervisor", "conf_score": 0.9174648511369632, "start_time": "2015-09-01T00:00:00Z"}, {"id": 19001, "detail": "", "company": "Louis Dreyfus Company", "end_time": "2017-04-30T11:34:42.382882Z", "industry": "Other", "position": "Outbound Execution Supervisor", "conf_score": 0.7968341985623422, "start_time": "2012-12-01T00:00:00Z"}, {"id": 19002, "detail": "General Responsibility: Handle all Sales & Purchases contracts - make sure they are executed comply with all contract term & conditions.\nWork as Representative office for parent company when the goods are allocated from Bonded warehouse, work with local manufacturers for shipping schedule, shipping details and send them shipping instructions and receive full sets of shipping documents to send to consignees.\nWork as Local company when allocate good from Non-bonded warehouse, follow production plan from warehouse to arrange shipment schedule, send them stuffing instruction.\nFollow up export shipments from getting contract from system until the goods arrives at destination on time in full (OTIF). Make sure the export shipping documents including custom declaration, Bill of lading, Certificate of origin from Vietnam Chamber of Commerce and Industry & other documents such as\nPhytosanitary certificate, Fumigation Certificate, Weight, Quality, Health certificate is always issued correctly and in a timely manner.\nSolve logistics issue (if any).\nIssue commercial invoice, send payment request and follow up with customers for payment according to signed contract.\nSend shipment advice, full set of docs to clients by email/ courier.\nGenerate monthly report of claim for weight loss, damaged goods", "company": "LOUIS DREYFUS COMPANY VIETNAM TRADING AND PROCESSING CO., LTD", "end_time": "2015-08-31T00:00:00Z", "industry": "Trade", "position": "Outbound Execution Officer", "conf_score": 0.9256580526889115, "start_time": "2012-12-01T00:00:00Z"}, {"id": 19003, "detail": "", "company": "Sucafina S.A.", "end_time": "2012-07-31T00:00:00Z", "industry": "Other", "position": "Traffic execution Officer", "conf_score": 0.9162385206282713, "start_time": "2007-05-01T00:00:00Z"}, {"id": 19004, "detail": "", "company": "SDV VIETNAM", "end_time": "2007-04-30T00:00:00Z", "industry": "Other", "position": "Sea Export Dept. - Customer Service", "conf_score": 0.9162385206282713, "start_time": "2005-07-01T00:00:00Z"}, {"id": 19005, "detail": "", "company": "TRIMAX LOGISTICS JOINT VENTURE COMPANY", "end_time": "2005-06-30T00:00:00Z", "industry": "Transportation & Logistics", "position": "Sea Export Dept. - Customer Service", "conf_score": 0.9162385206282713, "start_time": "2003-09-01T00:00:00Z"}], "address": "C14.2 Phu Hoang Anh Apartment, Nguyen Huu Tho Str., Phuoc Kien, Nha be District, Hcmc"}